Repository: zhulinhai/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: cy

source: Delete this component
cy: Dileu'r gydran hon

source: Drag to reorder
cy: Llusgwch i aildrefnu

source: Open the courseware in the LMS
cy: Agor gwaith y cwrs yn y system rheoli dysgu (LMS)

source: View Live Version
cy: Gweld y fersiwn fyw

source: Preview the courseware in the LMS
cy: Rhagweld gwaith y cwrs yn y system rheoli dysgu (LMS)

source: Adding components
cy: Yn ychwanegu cydrannau

source: Select a component type under {strong_start}Add New Component{strong_end}. Then select a template.
cy: Dewiswch math o gydran o dan {strong_start}Ychwanegu Cydran Newydd{strong_end}. Yna dewiswch batrymlun.

source: The new component is added at the bottom of the page or group. You can then edit and move the component.
cy: Ychwanegir y gydran newydd ar waelod y dudalen neu'r grŵp. Yna gallwch olygu a symud y gydran.

source: Editing components
cy: Golygu cydrannau

source: Click the {strong_start}Edit{strong_end} icon in a component to edit its content.
cy: Cliciwch ar eicon {strong_start}Golygu{strong_end} cydran i olygu ei chynnwys.

source: Reorganizing components
cy: Aildrefnu cydrannau

source: Drag components to new locations within this component.
cy: Llusgwch gydrannau i leoliadau newydd o fewn y gydran hon.

source: For content experiments, you can drag components to other groups.
cy: Ar gyfer arbrofion cynnwys, gallwch lusgo cydrannau i grwpiau eraill.

source: Working with content experiments
cy: Gweithio gydag arbrofion cynnwys

source: Confirm that you have properly configured content in each of your experiment groups.
cy: Cadarnhewch eich bod wedi ffurfweddu'r cynnwys yn gywir ar gyfer pob un o'ch grwpiau arbrofi.

source: Learn more about component containers
cy: Dysgu mwy am gynwysyddion cydrannau

source: Unit Location
cy: Lleoliad yr uned

source: Location ID
cy: Rhif adnabod y lleoliad

source: To create a link to this unit from an HTML component in this course, enter "/jump_to_id/<location ID>" as the URL value.
cy: I greu dolen i'r uned hon o gydran HTML yn y cwrs hwn, rhowch "/jump_to_id/<location ID>" fel y gwerth URL.

source: Location in Course Outline
cy: Lleoliad yn amlinelliad y cwrs

source: Create a Course Rerun of:
cy: Creu ail-rediad cwrs ar gyfer:

source: Create a re-run of a course
cy: Creu ail-rediad o'r cwrs ar gyfer:

source: You are creating a re-run from:
cy: Rydych yn creu ail-rediad ar gyfer:

source: Provide identifying information for this re-run of the course. The original course is not affected in any way by a re-run.
cy: Rhowch wybodaeth adnabod ar gyfer ail-redeg y cwrs. Nid effeithir ar y cwrs gwreiddiol mewn unrhyw fodd gan ailrediad.

source: Note: Together, the organization, course number, and course run must uniquely identify this new course instance.
cy: Sylwer: Gyda'i gilydd, rhaid i'r sefydliad, rhif y cwrs a rhediad y cwrs greu cyfuniad adnabod unigryw i'w cwrs newydd hwn.

source: Required Information to Create a re-run of a course
cy: Gwybodaeth ofynnol i greu ailrediad cwrs

source: e.g. Introduction to Computer Science
cy: e.e. Cyflwyniad i gyfrifiadureg

source: The public display name for the new course. (This name is often the same as the original course name.)
cy: Enw'r cwrs newydd a ddangosir yn gyhoeddus. (Mae'r enw hwn yn aml yr un peth ag enw gwreiddiol y cwrs.)

source: Organization
cy: Sefydliad

source: e.g. UniversityX or OrganizationX
cy: e.e. UniversityX neu OrganizationX

source: The name of the organization sponsoring the new course. (This name is often the same as the original organization name.)
cy: Enw'r sefydliad sy'n noddi'r cwrs newydd. (Mae'r enw hwn yn aml yr un peth ag enw gwreiddiol y sefydliad.)

source: Note: No spaces or special characters are allowed.
cy: Sylwer: Ni chaniateir bylchau na chymeriadau arbennig.

source: e.g. CS101
cy: e.e. CS101

source: The unique number that identifies the new course within the organization. (This number will be the same as the original course number and cannot be changed.)
cy: Y rhif unigryw sy'n nodi'r cwrs newydd o fewn sefydliad. (Bydd y rhif hwn yr un fath â rhif gwreiddiol y cwrs ac ni ellir ei newid.)

source: Course Run
cy: Rhediad y cwrs

source: e.g. 2014_T1
cy: e.e. 2014_T1

source: The term in which the new course will run. (This value is often different than the original course run value.)
cy: Y tymor y cynhelir y cwrs newydd ynddo. (Mae'r gwerth hwn yn aml yn wahanol i werth rhediad gwreiddiol y cwrs)

source: Create Re-run
cy: Creu ailredeg

source: When will my course re-run start?
cy: Pryd bydd ail-rediad fy nghwrs yn dechrau?

source: The new course is set to start on January 1, 2030 at midnight (UTC).
cy: Bydd y cwrs newydd yn dechrau 1 Ionawr 2030 am ganol nos (UTC).

source: What transfers from the original course?
cy: Beth sy'n trosglwyddo o'r cwrs gwreiddiol?

source: The new course has the same course outline and content as the original course. All problems, videos, announcements, and other files are duplicated to the new course.
cy: Mae gan y cwrs newydd yr un amlinelliad cwrs a chynnwys â'r cwrs gwreiddiol. Mae'r holl broblemau, fideos, cyhoeddiadau a ffeiliau eraill wedi'u dyblygu i'r cwrs newydd.

source: What does not transfer from the original course?
cy: Beth nad yw'n trosglwyddo o'r cwrs gwreiddiol?

source: You are the only member of the new course's staff. No students are enrolled in the course, and there is no student data. There is no content in the discussion topics or wiki.
cy: Chi yw unig aelod staff cwrs newydd. Nid oes unrhyw fyfyrwyr wedi cofrestru ar y cwrs, ac nid oes unrhyw ddata myfyrwyr. Nid oes cynnwys yn y pwnc trafodaeth neu wici.

source: Learn more about Course Re-runs
cy: Dysgu mwy am gyrsiau'n ailredeg

source: Course Updates
cy: Diweddariadau cyrsiau

source: New Update
cy: Diweddariad newydd

source: Use course updates to notify students of important dates or exams, highlight particular discussions in the forums, announce schedule changes, and respond to student questions. You add or edit updates in HTML.
cy: Defnyddiwch ddiweddariadau cyrsiau i hysbysu myfyrwyr am ddyddiadau pwysig neu arholiadau, amlygu trafodaethau penodol yn y fforymau, cyhoeddi newidiadau i amserlenni ac ymateb i gwestiynau myfyrwyr. Cewch ychwanegu neu olygu diweddariadau mewn HTML.

source: Course Outline
cy: Amlinelliad o'r cwrs

source: This course was created as a re-run. Some manual configuration is needed.
cy: Crëwyd y cwrs hwn fel ailrediad. Mae angen ffurfweddu rhywfaint eich hun.

source: No course content is currently visible, and no learners are enrolled. Be sure to review and reset all dates, including the Course Start Date; set up the course team; review course updates and other assets for dated material; and seed the discussions and wiki.
cy: Nid oes cynnwys cwrs i'w weld ar hyn o bryd, ac nid oes unrhyw ddysgwyr wedi'u cofrestru. Sicrhewch eich bod yn adolygu ac yn ailosod yr holl ddyddiadau, gan gynnwys dyddiad dechrau'r cwrs; sefydlu tîm y cwrs; adolygu diweddariadau'r cwrs ac asedau eraill ar gyfer hen ddeunydd; ac ysgogi trafodaethau a wici.

source: Dismiss
cy: Gwrthod

source: Warning
cy: Rhybudd

source: This course uses features that are no longer supported.
cy: Mae'r cwrs hwn yn defnyddio nodweddion na chefnogir bellach.

source: You must delete or replace the following components.
cy: Rhaid i chi ddileu neu amnewid y cydrannau hyn.

source: Unsupported Components
cy: Cydrannau heb eu cefnogi

source: Deprecated Component
cy: Cydrannau anghymeradwy

source: To avoid errors, {platform_name} strongly recommends that you remove unsupported features from the course advanced settings. To do this, go to the {link_start}Advanced Settings page{link_end}, locate the "Advanced Module List" setting, and then delete the following modules from the list.
cy: I osgoi gwallau, mae {platform_name} yn argymell yn gryf eich bod yn dileu nodweddion na chefnogir o osodiadau uwch y cwrs. I wneud hyn, ewch i {link_start}dudalen Gosodiadau Uwch{link_end}, canfod gosodiad "Rhestr Modiwl Uwch", ac yn dileu'r modiwlau hyn o'r rhestr.

source: Unsupported Advance Modules
cy: Modiwlau uwch heb eu cefnogi

source: Click to add a new section
cy: Cliciwch i ychwanegu adran newydd

source: New Section
cy: Adran newydd

source: Reindex current course
cy: Ailfynegeio'r cwrs cyfredol

source: Reindex
cy: Ailfynegeio

source: Collapse All Sections
cy: Cwympo pob adran

source: Expand All Sections
cy: Ehangu pob adran

source: Click to open the courseware in the LMS in a new tab
cy: Cliciwch i agor gwaith y cwrs yn y system rheoli dysgu (LMS) mewn tab newydd

source: View Live
cy: Gweld yn fyw

source: Edit Start Date
cy: Golygu'r dyddiad dechrau

source: Course Pacing:
cy: Cyflymder y cwrs:

source: Self-Paced
cy: Pennu cyflymder eich hun

source: Instructor-Paced
cy: Ar gyflymder yr hyfforddwr

source: Creating your course organization
cy: Creu trefniadaeth eich cwrs eich hun

source: You add sections, subsections, and units directly in the outline.
cy: Gallwch ychwanegu adrannau, is-adrannau ac unedau'n uniongyrchol i'r amlinelliad.

source: Create a section, then add subsections and units. Open a unit to add course components.
cy: Crëwch adran, ac yna ychwanegu is-adrannau ac unedau. Agor uned i ychwanegu cydrannau cwrs

source: Reorganizing your course
cy: Aildrefnu eich cwrs.

source: Drag sections, subsections, and units to new locations in the outline.
cy: Llusgwch adrannau, is-adrannau ac unedau i'w lleoliadau newydd yn yr amlinelliad.

source: Learn more about the course outline
cy: Dysgu mwy am amlinelliad y cwrs

source: Setting release dates and grading policies
cy: Gosod dyddiadau rhyddhau a pholisïau graddio

source: Select the Configure icon for a section or subsection to set its release date. When you configure a subsection, you can also set the grading policy and due date.
cy: Dewiswch yr eicon Ffurfweddu ar gyfer adran neu is-adran i osod ei ddyddiad rhyddhau. Pan fyddwch yn ffurfweddu is-adran, gallwch hefyd osod y polisi graddio a dyddiad dychwelyd.

source: Learn more about grading policy settings
cy: Dysgu mwy am osodiadau'r polisi graddio

source: Changing the content learners see
cy: Newid y cynnwys mae dysgwyr yn ei weld

source: To publish draft content, select the Publish icon for a section, subsection, or unit.
cy: I gyhoeddi cynnwys drafft, dewiswch yr eicon cyhoeddi ar gyfer adran, is-adran neu uned.

source: To make a section, subsection, or unit unavailable to learners, select the Configure icon for that level, then select the appropriate {em_start}Hide{em_end} option. Grades for hidden sections, subsections, and units are not included in grade calculations.
cy: I wneud adran, is-adran neu uned ar gael i ddysgwyr, dewiswch yr eicon Ffurfweddu ar gyfer y lefel honno, yna dethol y dewis {em_start}Cuddio{em_end} priodol. Ni chaiff y graddau ar gyfer adrannau, is-adrannau ac unedau cudd eu cynnwys wrth gyfrifo'r graddau.

source: To hide the content of a subsection from learners after the subsection due date has passed, select the Configure icon for a subsection, then select {em_start}Hide content after due date{em_end}. Grades for the subsection remain included in grade calculations.
cy: I guddio cynnwys is-adran rhag dysgwyr ar ôl dyddiad disgwyl is-adran, dewiswch yr eicon Ffurfweddu ar gyfer is-adran, yna dewis {em_start}Cuddio cynnwys wedi dyddiad disgwyl{em_end}. Mae'r graddau ar gyfer is-adran yn parhau i gael eu cynnwys wrth gyfrifo graddau.

source: Learn more about content visibility settings
cy: Dysgu mwy am osodiadau gwelededd cynnwys

source: Pages
cy: Tudalennau

source: New Page
cy: Tudalen newydd

source: Note: Pages are publicly visible. If users know the URL of a page, they can view the page even if they are not registered for or logged in to your course.
cy: Sylwer: Mae'r tudalennau i'w gweld yn gyhoeddus Os yw'r defnyddwyr yn gwybod URL y dudalen, yna gallant weld y dudalen hyd yn oed os nad ydynt wedi cofrestru ar gyfer y cwrs neu heb fewngofnodi.

source: Show this page
cy: Dangos y dudalen

source: Show/hide page
cy: Dangos/cuddio tudalen

source: This page cannot be reordered
cy: Ni ellir aildrefnu'r dudalen hon

source: You can add additional custom pages to your course.
cy: Gallwch ychwanegu tudalennau ychwanegol a wnaed ar fesur i'ch cwrs.

source: Add a New Page
cy: Ychwanegu tudalen newydd

source: What are pages?
cy: Beth yw tudalennau?

source: Pages are listed horizontally at the top of your course. Default pages (Home, Course, Discussion, Wiki, and Progress) are followed by textbooks and custom pages that you create.
cy: Caiff tudalennau eu rhestru'n llorweddol ar frig eich cwrs. Daw gwerslyfrau a thudalennau ar fesur y gwnaethoch eu creu ar ôl y tudalennau diofyn (Hafan, Cwrs, Trafodaeth, Wici a Cynnydd).

source: Custom pages
cy: Tudalennau a wnaed ar fesur

source: You can create and edit custom pages to provide students with additional course content. For example, you can create pages for the grading policy, course slides, and a course calendar.
cy: Gallwch greu a golygu tudalennau ar fesur i roi cynnwys cwrs ychwanegol i fyfyrwyr. Er enghraifft, gallwch greu tudalennau ar gyfer y polisi graddio, sleidiau cyrsiau a chalendr cwrs.

source: How do pages look to students in my course?
cy: Sut olwg sydd ar y tudalennau i fyfyrwyr fy nghwrs?

source: Students see the default and custom pages at the top of your course and use these links to navigate.
cy: Bydd myfyrwyr yn gweld y tudalennau diofyn ac ar fesur ar frig eich cwrs ac yn defnyddio'r dolenni hyn i lywio.

source: See an example
cy: Gweld enghraifft

source: Pages in Your Course
cy: Tudalennau eich cwrs

source: Preview of Pages in your course
cy: Rhagweld tudalennau eich cwrs

source: Pages appear in your course's top navigation bar. The default pages (Home, Course, Discussion, Wiki, and Progress) are followed by textbooks and custom pages.
cy: Bydd tudalennau'n ymddangos ym mar llywio brig y ffenestr eich cwrs. Daw gwerslyfrau a thudalennau ar fesur y gwnaethoch eu creu ar ôl y tudalennau diofyn (Hafan, Cwrs, Trafodaeth, Wici a Cynnydd).

source: close modal
cy: cau'r moddol

source: Internal Server Error
cy: Gwall gweinydd mewnol

source: The Page You Requested Page Cannot be Found
cy: Ni ellir dod o hyd i'r dudalen y gofynnoch amdani

source: We're sorry. We couldn't find the {studio_name} page you're looking for. You may want to return to the {studio_name} Dashboard and try again. If you are still having problems accessing things, please feel free to {link_start}contact {studio_name} support{link_end} for further help.
cy: Mae'n flin gennym. Ni fedrem ddod o hyd i'r dudalen {studio_name} rydych ymchwilio amdani. Efallai eich bod am ddychwelyd i ddangosfwrdd {studio_name} a rhoi cynnig arall arni. Os ydych yn parhau i gael problemau wrth agor pethau, {link_start}cysylltwch â {studio_name} chefnogaeth{link_end} am fwy o gymorth.

source: The Server Encountered an Error
cy: Daeth y gweinydd ar draws gwall

source: We're sorry. There was a problem with the server while trying to process your last request. You may want to return to the {studio_name} Dashboard or try this request again. If you are still having problems accessing things, please feel free to {link_start}contact {studio_name} support{link_end} for further help.
cy: Mae'n flin gennym. Cafwyd problem gyda'r gweinydd wrth geisio prosesu eich cais diwethaf. Efallai eich bod am ddychwelyd i ddangosfwrdd {studio_name} neu roi cynnig arall ar y cais hwn. Os ydych yn parhau i gael problemau wrth agor pethau, {link_start}cysylltwch â {studio_name} chefnogaeth{link_end} am fwy o gymorth.

source: Back to dashboard
cy: Yn ôl i'r dangosfwrdd

source: Library Export
cy: Allforio llyfrgell

source: Course Export
cy: Allforio cwrs

source: Tools
cy: Offer

source: About Exporting Libraries
cy: Am allforio llyfrgelloedd

source: You can export libraries and edit them outside of {studio_name}. The exported file is a .tar.gz file (that is, a .tar file compressed with GNU Zip) that contains the library structure and content. You can also re-import libraries that you've exported.
cy: Gallwch allforio llyfrgelloedd a'u golygu y tu allan i {studio_name}. Y ffeil a gaiff ei hallforio yw ffeil .tar.gz (hynny ydi, ffeil .tar wedi'i chywasgu gan GNU Zip) sy'n cynnwys strwythur a chynnwys y llyfrgell. Gallwch hefyd ail-fewnforio llyfrgelloedd rydych wedi'u hallforio.

source: About Exporting Courses
cy: Am allforio cyrsiau

source: You can export courses and edit them outside of {studio_name}. The exported file is a .tar.gz file (that is, a .tar file compressed with GNU Zip) that contains the course structure and content. You can also re-import courses that you've exported.
cy: Gallwch allforio cyrsiau a'u golygu y tu allan i {studio_name}. Y ffeil a gaiff ei hallforio yw ffeil .tar.gz (hynny ydi, ffeil .tar wedi'i chywasgu gan GNU Zip) sy'n cynnwys strwythur a chynnwys y cwrs. Gallwch hefyd ail-fewnforio cyrsiau rydych wedi'u hallforio.

source: {em_start}Caution:{em_end} When you export a course, information such as MATLAB API keys, LTI passports, annotation secret token strings, and annotation storage URLs are included in the exported data. If you share your exported files, you may also be sharing sensitive or license-specific information.
cy: {em_start}Rhybudd:{em_end} Wrth allforio cwrs, caiff gwybodaeth megis allweddi API MATLAB, pasportau LTI, llinynnau tocyn cudd anodi, ac URL storio anodi eu cynnwys yn y data a gaiff ei allforio. Os ydych yn rhannu eich ffeiliau a allforiwyd, mae'n bosib y byddwch yn rhannu gwybodaeth sensitif neu wybodaeth benodol i drwydded.

source: Export My Library Content
cy: Allforio cynnwys fy llyfrgell

source: Export My Course Content
cy: Allforio cynnwys fy nghwrs

source: Export Library Content
cy: Allforio cynnwys fy llyfrgell

source: Export Course Content
cy: Allforio cynnwys cwrs

source: Success
cy: Llwyddiant

source: Data {em_start}exported with{em_end} your course:
cy: Data {em_start}a allforiwyd gyda'ch{em_end} cwrs:

source: Values from Advanced Settings, including MATLAB API keys and LTI passports
cy: Gwerthoedd o osodiadau uwch, gan gynnwys allweddi API MATLAB a phasportau LTI

source: Course Content (all Sections, Sub-sections, and Units)
cy: Cynnwys y cwrs (pob adran, is-adrannau ac unedau)

source: Course Structure
cy: Strwythur y cwrs

source: Individual Problems
cy: Problemau unigol

source: Course Assets
cy: Asedau'r cwrs

source: Course Settings
cy: Gosodiadau'r cwrs

source: Data {em_start}not exported{em_end} with your course:
cy: Data {em_start}na allforiwyd gyda'ch{em_end} cwrs:

source: User Data
cy: Data defnyddwyr

source: Course Team Data
cy: Data tîm y cwrs

source: Forum/discussion Data
cy: Data fforwm/trafodaeth

source: Why export a library?
cy: Pam allforio llyfrgell?

source: You may want to edit the XML in your library directly, outside of {studio_name}. You may want to create a backup copy of your library. Or, you may want to create a copy of your library that you can later import into another library instance and customize.
cy: Mae'n bosib y byddwch am olygu'r XML yn eich llyfrgell yn uniongyrchol, y tu allan i {studio_name}. Mae'n bosib y byddwch am greu copi wrth gefn o'ch llyfrgell. Neu, mae'n bosib y byddwch am greu copi o'ch llyfrgell y gallwch ei fewnforio'n ddiweddarach i lyfrgell arall a'i deilwra.

source: Opening the downloaded file
cy: Agor y ffeil a lawrlwythwyd

source: Use an archive program to extract the data from the .tar.gz file. Extracted data includes the library.xml file, as well as subfolders that contain library content.
cy: Defnyddiwch raglen archif i echdynnu'r data o'r ffeil .tar.gz. Mae data a echdynnwyd yn cynnwys ffeil .xml y llyfrgell, ynghyd ag is-adrannau sy'n cynnwys cynnwys y llyfrgell.

source: Learn more about exporting a library
cy: Dysgu mwy am allforio llyfrgell

source: Why export a course?
cy: Pam allforio cwrs?

source: You may want to edit the XML in your course directly, outside of {studio_name}. You may want to create a backup copy of your course. Or, you may want to create a copy of your course that you can later import into another course instance and customize.
cy: Mae'n bosib y byddwch am olygu'r XML yn eich cwrs yn uniongyrchol, y tu allan i {studio_name}. Mae'n bosib y byddwch am greu copi wrth gefn o'ch y cwrs. Neu, mae'n bosib y byddwch am greu copi o'ch cwrs y gallwch ei fewnforio'n ddiweddarach i gwrs arall a'i deilwra.

source: What content is exported?
cy: Pa gynnwys gaiff ei allforio?

source: The course content and structure (including sections, subsections, and units) are exported. Values from Advanced Settings, including MATLAB API keys and LTI passports, are also exported. Other data, including student data, grading information, discussion forum data, course settings, and course team information, is not exported.
cy: Caiff cynnwys a strwythur y cwrs (gan gynnwys adrannau, is-adrannau ac unedau) eu hallforio. Caiff gwerthoedd o osodiadau uwch, gan gynnwys allweddi API MATLAB a phasportau LTI hefyd eu hallforio. Ni chaiff data arall, gan gynnwys data myfyrwyr, gwybodaeth graddio, data fforymau trafodaeth, gosodiadau cyrsiau na gwybodaeth tîm cyrsiau eu hallforio.

source: Use an archive program to extract the data from the .tar.gz file. Extracted data includes the course.xml file, as well as subfolders that contain course content.
cy: Defnyddiwch raglen archif i echdynnu'r data o'r ffeil .tar.gz. Mae data a echdynnwyd yn cynnwys ffeil .xml y cwrs, ynghyd ag is-adrannau sy'n cynnwys cynnwys y cwrs.

source: Learn more about exporting a course
cy: Dysgu mwy am allforio cwrs

source: Export Course to Git
cy: Allforio cwrs i Git

source: Export to Git
cy: Allforio i Git

source: About Export to Git
cy: Am allforio i Git

source: Use this to export your course to its git repository.
cy: Defnyddiwch hwn i allforio eich cwrs i'w gronfa git.

source: This will then trigger an automatic update of the main LMS site and update the contents of your course visible there to students if automatic git imports are configured.
cy: Yna bydd hyn yn achosi diweddariad awtomataidd o'r prif safle LMS ac yn diweddaru cynnwys eich cwrs sydd i'w weld i fyfyrwyr os yw'r mewnforiadau git awtomataidd wedi'u ffurfweddu.

source: Export Course to Git:
cy: Allforio cwrs i Git:

source: giturl must be defined in your course settings before you can export to git.
cy: rhaid diffinio'r giturl yng ngosodiadau'ch cwrs cyn y gallwch allforio i git.

source: Export Failed
cy: Allforio wedi methu

source: Export Succeeded
cy: Allforio wedi llwyddo

source: Your course:
cy: Eich cwrs:

source: Course git url:
cy: Urls git y cwrs:

source: Experiment Group Configurations
cy: Ffurfweddiadau grŵp arbrofol

source: This module is disabled at the moment.
cy: Mae'r modiwl hwn wedi cael ei analluogi ar hyn o bryd.

source: If you have cohorts enabled in your course, you can use content groups to create cohort-specific courseware. In other words, you can customize the content that particular cohorts see in your course.
cy: Os oes gennych gohortau wedi'u galluogi yn eich cwrs, gallwch ddefnyddio grwpiau cynnwys i greu deunydd cwrs penodol i gohort. Mewn geiriau eraill, gallwch deilwra'r cynnwys y gwêl y cohort penodol hwnnw ar y cwrs.
