Repository: zhulinhai/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: cy

source: You have not made any notes in this course yet. Other students in this course are using notes to:
cy: Nid ydych wedi gwneud unrhyw nodiadau yn y cwrs hwn eto. Mae myfyrwyr eraill ar y cwrs hwn yn defnyddio nodiadau i:

source: Mark a passage or concept so that it's easy to find later.
cy: Nodi rhan neu gysyniad fel ei fod yn hawdd dod o hyd iddo'n ddiweddarach.

source: Record thoughts about a specific passage or concept.
cy: Cofnodi barn am ddarn neu gysyniad penodol.

source: Highlight important information to review later in the course or in future courses.
cy: Amlygu gwybodaeth bwysig i'w hadolygu'n ddiweddarach yn y cwrs neu ar gyrsiau yn y dyfodol.

source: Get started by making a note in something you just read, like {section_link}.
cy: Dechreuwch arni drwy wneud nodyn yn rhywbeth y darllenoch, megis {section_link}.

source: Hide notes
cy: Cuddio'r nodiadau

source: Show notes
cy: Dangos y nodiadau

source: Welcome to {course_name}
cy: Croeso i {course_name}

source: Welcome to {course_title}
cy: Croeso i {course_title}

source: To get started, please visit https://{site_name}. The login information for your account follows.
cy: I ddechrau, ewch i https://{site_name}. Dyma'r manylion mewngofnodi ar gyfer eich cyfrif.

source: email: {email}
cy: e-bost: {email}

source: password: {password}
cy: cyfrinair: {cyfrinair}

source: It is recommended that you change your password.
cy: Argymhellir eich bod yn newid eich cyfrinair.

source: Sincerely yours,The {course_name} Team
cy: Yn gywir, Tîm {course_name}

source: Dear {full_name}
cy: Annwyl {full_name}

source: You have been invited to be a beta tester for {course_name} at {site_name} by a member of the course staff.
cy: Cawsoch eich gwahodd i fod yn brofwr beta ar gyfer {course_name} yn {site_name} gan aelod o staff y cwrs.

source: To start accessing course materials, please visit {course_url}
cy: I ddechrau gweld deunydd y cwrs, ewch i {course_url}

source: Visit {course_about_url} to join the course and begin the beta test.
cy: Ewch i {course_about_url} i ymuno â'r cwrs a dechrau prawf beta.

source: Visit {site_name} to enroll in the course and begin the beta test.
cy: Ewch i {course_about_url} i gofrestru ar y cwrs a dechrau prawf beta.

source: This email was automatically sent from {site_name} to {email_address}
cy: Anfonwyd yr e-bost hwn yn awtomatig o {site_name} at {email_address}

source: You have been invited to a beta test for {course_name}
cy: Cawsoch eich gwahodd i fod yn brofwr beta ar gyfer {course_name}

source: Your payment was successful.
cy: Roedd eich taliad yn llwyddiannus.

source: If you have billing questions, please read the FAQ ({faq_url}) or contact {billing_email}.
cy: Os oes gennych gwestiynau am filio, darllenwch y cwestiynau cyffredin ({faq_url}) neu gysylltwch â {billing_email}.

source: If you have billing questions, please contact {billing_email}.
cy: Os oes gennych gwestiynau am filio, cysylltwch â {billing_email}.

source: {order_placed_by} placed an order and mentioned your name as the Organization contact.
cy: Gosododd {order_placed_by} archeb a chrybwyll eich enw fel cyswllt y sefydliad.

source: {order_placed_by} placed an order and mentioned your name as the additional receipt recipient.
cy: Gosododd {order_placed_by} archeb a chrybwyll eich enw i dderbyn derbynneb ychwanegol.

source: The items in your order are:
cy: Yr eitemau yn eich harcheb yw:

source: Quantity - Description - Price
cy: Swm - Disgrifiad - Pris

source: Total billed to credit/debit card: {currency_symbol}{total_cost}
cy: Cyfanswm y bil i'r cerdyn credyd/debyd: {currency_symbol}{total_cost}

source: Company Name:
cy: Enw'r cwmni:

source: Purchase Order Number:
cy: Rhif yr archeb:

source: Company Contact Name:
cy: Enw cyswllt y cwmni:

source: Company Contact Email:
cy: Cyfeiriad e-bost cyswllt y cwmni:

source: Recipient Name:
cy: Enw'r derbynnydd:

source: Recipient Email:
cy: E-bost y derbynnydd:

source: Order Number: {order_number}
cy: Rhif yr archeb: {order_number}

source: A CSV file of your registration URLs is attached. Please distribute registration URLs to each student planning to enroll using the email template below.
cy: Mae ffeil .csv o URL eich cofrestriad ynghlwm. Dosbarthwch URL cofrestru i bob myfyriwr sy'n cynllunio cofrestru gan ddefnyddio'r patrymlun e-bost isod.

source: Warm regards,
cy: Cofion cynnes,

source: Warm regards,<br>The {platform_name} Team
cy: Cofion cynnes,<br>Y {platform_name} Tîm

source: Dear [[Name]]
cy: Annwyl [[Name]]

source: To enroll in {course_names} we have provided a registration URL for you. Please follow the instructions below to claim your access.
cy: I gofrestru ar {course_names} rydym wedi darparu URL cofrestru ar eich cyfer. Dilynwch y cyfarwyddiadau isod i hawlio eich mynediad.

source: Your redeem url is: [[Enter Redeem URL here from the attached CSV]]
cy: Eich url cyfnewid yw: [[Rhowch eich URL cyfnewid yma o'r CSV atodedig]]

source: (1) Register for an account at {site_name}
cy: (1) Cofrestrwch am gyfrif gyda {site_name}

source: (2) Once registered, copy the redeem URL and paste it in your web browser.
cy: (2) Wedi cofrestru, copïwch yr URL cyfnewid a'i ludo yn eich porwr gwe.

source: (3) On the enrollment confirmation page, Click the 'Activate Enrollment Code' button. This will show the enrollment confirmation.
cy: (3) Ar y dudalen cadarnhau cofrestru, cliciwch ar y botwm 'Ysgogi'r Côd Cofrestru'. Bydd hyn yn dangos y cadarnhad cofrestru.

source: (4) You should be able to click on 'view course' button or see your course on your student dashboard at {url}
cy: (4) Dylech allu clicio ar y botwm 'gweld y cwrs' neu weld eich cwrs ar eich dangosfwrdd myfyriwr yn {url}

source: (5) Course materials will not be available until the course start date.
cy: (5) Ni fydd deunydd y cwrs ar gael hyd nes dyddiad dechrau'r cwrs.

source: <p>Sincerely,</p><p>[[Your Signature]]</p>
cy: <p>Yn gywir,</p><p>[[Your Signature]]</p>

source: This is to confirm that you changed the e-mail associated with {platform_name} from {old_email} to {new_email}. If you did not make this request, please contact us immediately. Contact information is listed at:
cy: Mae hyn i gadarnhau eich bod wedi newid yr e-bost sy'n gysylltiedig â {platform_name} o {old_email} i {new_email}. Os na wnaethoch y cais hwn, cysylltwch â ni ar unwaith. Mae'r wybodaeth gyswllt wedi'i rhestru yn:

source: We keep a log of old e-mails, so if this request was unintentional, we can investigate.
cy: Rydym yn cadw cofnod o hen e-bostiau, felly os yw'r cais hwn yn anfwriadol gallwch ymchwilio iddo.

source: We received a request to change the e-mail associated with your {platform_name} account from {old_email} to {new_email}. If this is correct, please confirm your new e-mail address by visiting:
cy: Rydym wedi derbyn cais i newid yr e-bost sy'n gysylltiedig â'ch cyfrif {platform_name} o {old_email} i {new_email}. Os yw hyn yn gywir, cadarnhewch eich cyfeiriad e-bost newydd drwy fynd i:

source: If you didn't request this, you don't need to do anything; you won't receive any more email from us. Please do not reply to this e-mail; if you require assistance, check the help section of the {platform_name} web site.
cy: Os na wnaethoch ofyn am hyn, nid oes rhaid i chi wneud unrhyw beth; ni fyddwch yn derbyn mwy o negeseuon e-bost gennym. Peidiwch ag ateb yr e-bost hwn; os oes angen cymorth arnoch, ewch i adran help gwefan {platform_name} .

source: Request to change {platform_name} account e-mail
cy: Cais i newid cyfrif e-bost {platform_name}

source: Dear student,
cy: Annwyl fyfyriwr,

source: You have been invited to join {course_name} at {site_name} by a member of the course staff.
cy: Cawsoch eich gwahodd i ymuno â {course_name} yn {site_name} gan aelod o staff y cwrs.

source: To access the course visit {course_url} and login.
cy: I gael mynediad i'r cwrs ewch i {course_url} a mewngofnodi.

source: To access the course visit {course_about_url} and register for the course.
cy: I gael mynediad i'r cwrs ewch i {course_about_url} a chofrestru ar gyfer y cwrs.

source: To finish your registration, please visit {registration_url} and fill out the registration form making sure to use {email_address} in the E-mail field.
cy: I orffen cofrestru, ewch i {registration_url} a chwblhau'r ffurflen gofrestru gan sicrhau eich bod yn rhoi {email_address} yn y maes e-bost.

source: Once you have registered and activated your account, you will see {course_name} listed on your dashboard.
cy: Wedi i chi gofrestru ac ysgogi eich cyfrif, fe welwch {course_name} wedi'i restru ar eich dangosfwrdd.

source: Once you have registered and activated your account, visit {course_about_url} to join the course.
cy: Wedi i chi gofrestru ac ysgogi eich cyfrif, ewch i {course_about_url} i ymuno â'r cwrs.

source: You can then enroll in {course_name}.
cy: Yna gallwch gofrestru ar {course_name}.

source: You have been invited to register for {course_name}
cy: Cawsoch eich gwahodd i gofrestru ar gyfer {course_name}

source: You have been enrolled in {course_name} at {site_name} by a member of the course staff. The course should now appear on your {site_name} dashboard.
cy: Cawsoch eich cofrestru ar {course_name} yn {site_name} gan aelod o staff y cwrs. Dylai'r cwrs bellach ymddangos ar eich dangosfwrdd {site_name}.

source: This email was automatically sent from {site_name} to {full_name}
cy: Anfonwyd yr e-bost hwn yn awtomatig o {site_name} at {full_name}

source: You have been enrolled in {course_name}
cy: Rydych wedi'ch cofrestru ar {course_name}

source: Your payment was successful. You will see the charge below on your next credit or debit card statement under the company name {merchant_name}.
cy: Roedd eich taliad yn llwyddiannus. Byddwch yn gweld y pris isod ar eich datganiad cerdyn credyd neu ddebyd nesaf o dan enw'r cwmni, {merchant_name}.

source: Thank you,
cy: Diolch,

source: Your order number is: {order_number}
cy: Rhif eich archeb yw: {order_number}

source: Hi {full_name},
cy: Helo {full_name},

source: Thanks for submitting your photos!
cy: Diolch am gyflwyno eich lluniau!

source: We've received your information and the verification process has begun. You can check the status of the verification process on your dashboard.
cy: Rydym wedi derbyn eich gwybodaeth ac mae'r broses wirio wedi dechrau. Gallwch wirio statws y broses wirio yn eich dangosfwrdd.

source: The {platform_name} team
cy: Tîm {platform_name}

source: Thank you for purchasing enrollments in {course_name}.
cy: Diolch am brynu cofrestriadau yn {course_name}.

source: An invoice for {currency_symbol}{total_price} is attached. Payment is due upon receipt. You can find information about payment methods on the invoice.
cy: Mae anfoneb am {currency_symbol}{total_price} ynghlwm. Rhaid talu wedi derbyn. Gallwch ddod o hyd i wybodaeth am ddulliau talu ar yr anfoneb.

source: A .csv file that lists your enrollment codes is attached. You can use the email template below to distribute enrollment codes to your students. Each student must use a separate enrollment code.
cy: Mae ffeil .csv sy'n rhestru'ch codau cofrestru ynghlwm. Gallwch ddefnyddio'r patrymlun e-bost isod i ddosbarthu codau cofrestru i'ch myfyrwyr. Rhaid i bob myfyriwr ddefnyddio côd cofrestru gwahanol.

source: Thanks, The {platform_name} Team
cy: Diolch, Tîm {platform_name}

source: Dear [[Name]]:
cy: Annwyl [[Name]]:

source: We have provided a course enrollment code for you in {course_name}. To enroll in the course, click the following link:
cy: Rydym wedi darparu côd cofrestru ar gwrs ar eich cyfer yn {course_name}. I gofrestru ar y cwrs, cliciwch ar y ddolen hon:

source: HTML link from the attached CSV file
cy: Dolen HTML o'r ffeil CSV sydd wedi'i hatodi

source: After you enroll, you can see the course on your student dashboard. You can see course materials after the course start date.
cy: Wedi i chi gofrestru, gallwch weld y cwrs ar ei dangosfwrdd myfyriwr. Gallwch weld deunydd y cwrs ar ôl dyddiad dechrau'r cwrs.

source: Sincerely, [[Your Signature]]
cy: Yn gywir, [[Your Signature]]

source: INVOICE
cy: ANFONEB

source: Invoice No: {invoice_number}
cy: Rhif yr anfoneb: {invoice_number}

source: Terms: Due Upon Receipt
cy: Telerau: I'w dalu ar ôl derbyn

source: Due Date: {date}
cy: Dyddiad dychwelyd: {date}

source: Bill to:
cy: Bil at:

source: Customer Reference Number: {reference_number}
cy: Cyfeirnod y cwsmer: {reference_number}

source: Balance Due: {currency_symbol}{sale_price}
cy: Balans yn ddyledus: {currency_symbol}{sale_price}

source: Course: {course_name}
cy: Y cwrs: {course_name}

source: Price: {currency_symbol}{course_price} Quantity: {quantity} Sub-Total: {currency_symbol}{sub_total} Discount: {currency_symbol}{discount}
cy: Pris: Swm {currency_symbol}{course_price}: {quantity} Is-gyfanswm: {currency_symbol}{sub_total} Disgownt: {currency_symbol}{discount}

source: Total: {currency_symbol}{sale_price}
cy: Cyfanswm: {currency_symbol}{sale_price}

source: Payment Instructions
cy: Cyfarwyddiadau talu

source: If we do not receive payment, the learner enrollments that use these codes will be canceled and learners will not be able to access course materials. All purchases are final. For more information, see the {site_name} cancellation policy.
cy: Os na fyddwn yn derbyn taliad, bydd y dysgwyr sydd wedi cofrestru gyda'r codau hyn yn cael eu canslo ac ni fydd y dysgwyr yn cael mynediad i ddeunydd y cwrs. Mae pob prynu yn derfynol. Am fwy o wybodaeth, gweler polisi canslo {site_name}.

source: For payment questions, contact {contact_email}
cy: Am gwestiynau ynghylch talu, cysylltwch â {contact_email}

source: We are sorry. Our course staff did not approve your request to change your name from {old_name} to {new_name}. If you need further assistance, please e-mail the course staff at {email}.
cy: Mae'n flin gennym. Ni wnaeth staff ein cwrs gymeradwyo'ch cais i newid eich enw o {old_name} i {new_name}. Os oes angen mwy o gymorth arnoch, e-bostiwch staff cwrs yn {email}.

source: You have been removed as a beta tester for {course_name} at {site_name} by a member of the course staff. The course will remain on your dashboard, but you will no longer be part of the beta testing group.
cy: Tynnwyd chi oddi ar rhestr profwyr beta ar gyfer {course_name} yn {site_name} gan aelod o staff y cwrs. Bydd y cwrs yn parhau ar eich dangosfwrdd, ond ni fyddwch bellach yn rhan o'r grŵp profi beta

source: Your other courses have not been affected.
cy: Nid effeithiwyd ar eich cyrsiau eraill.

source: You have been removed from a beta test for {course_name}
cy: Tynnwyd eich enw oddi ar y rhestr profwyr beta ar gyfer {course_name}

source: We have successfully verified your identity for the {assessment} assessment in the {course_name} course.
cy: Rydym wedi gwirio pwy ydych chi yn llwyddiannus ar gyfer asesiad {assessment} ar gwrs {course_name}.

source: We could not verify your identity for the {assessment} assessment in the {course_name} course. You have used {used_attempts} out of {allowed_attempts} attempts to verify your identity.
cy: Nid oeddem yn gallu gwirio pwy ydych chi ar gyfer asesiad {assessment} ar gwrs {course_name}. Rydych wedi defnyddio {used_attempts} cais allan o {allowed_attempts} i wirio eich hunaniaeth.

source: You must verify your identity before the assessment closes on {due_date}.
cy: Rhaid i chi wirio eich hunaniaeth cyn i'r asesiad gau ar {due_date}.

source: To try to verify your identity again, select the following link:
cy: I geisio gwirio pwy ydych chi unwaith eto, dewiswch y ddolen hon:

source: We could not verify your identity for the {assessment} assessment in the {course_name} course. You have used {used_attempts} out of {allowed_attempts} attempts to verify your identity, and verification is no longer possible.
cy: Nid oeddem yn gallu gwirio pwy ydych chi ar gyfer asesiad {assessment} ar gwrs {course_name}. Rydych wedi defnyddio {used_attempts} cais allan o {allowed_attempts} i wirio eich hunaniaeth, ac ni chewch geisio gwirio eto.

source: To go to the courseware, select the following link:
cy: I fynd i feddalwedd y cwrs, cliciwch ar y ddolen hon:

source: If you have any questions, you can contact student support at {support_link}.
cy: Os oes gennych unrhyw gwestiynau, gallwch gysylltu â chefnogaeth i fyfyrwyr yn {support_link}.

source: Thanks,
cy: Diolch,

source: Dear Student,
cy: Annwyl fyfyriwr,

source: You have been un-enrolled from course {course_name} by a member of the course staff. Please disregard the invitation previously sent.
cy: Cawsoch eich dadgofrestru oddi ar y cwrs {course_name} gan aelod o staff y cwrs. Anwybyddwch unrhyw wahoddiad a anfonwyd atoch eisoes.

source: You have been un-enrolled in {course_name} at {site_name} by a member of the course staff. The course will no longer appear on your {site_name} dashboard.
cy: Cawsoch eich dadgofrestru oddi ar y cwrs {course_name} yn {site_name} gan aelod o staff y cwrs. Ni fydd y cwrs yn ymddangos bellach ar eich dangosfwrdd {site_name}.

source: You have been un-enrolled from {course_name}
cy: Cawsoch eich dadgofrestru o {course_name}

source: This Course Unavailable In Your Country
cy: Nid yw'r cwrs hwn ar gael yn eich gwlad

source: Our system indicates that you are trying to access this {platform_name} course from a country or region in which it is not currently available.
cy: Mae ein system yn dynodi eich bod yn ceisio cael mynediad i gwrs {platform_name} o wlad neu ranbarth lle nad yw ar gael ar hyn o bryd.

source: Our system indicates that you are trying to enroll in this {platform_name} course from a country or region in which it is not currently available.
cy: Mae ein system yn dynodi eich bod yn ceisio cael cofrestru ar gwrs {platform_name} o wlad neu ranbarth lle nad yw ar gael ar hyn o bryd.

source: Enrollment Successful
cy: Cofrestru llwyddiannus

source: Thank you for enrolling in {enrolled_course}. We hope you enjoy the course.
cy: Diolch am gofrestru ar {enrolled_course}. Gobeithiwn y gwnewch chi fwynhau'r cwrs.

source: {platform_name} is a nonprofit bringing high-quality education to everyone, everywhere. Your help allows us to continuously improve the learning experience for millions and make a better future one learner at a time.
cy: Mae {platform_name} nid er elw ac yn cyflwyno addysg ansawdd uchel i bawb, ymhob man. Mae eich cymorth yn caniatáu i ni wella'r profiad dysgu ar gyfer miliynau a chreu dyfodol gwell un dysgwr ar y tro.

source: Donation Actions
cy: Gweithredoedd rhoddi

source: Financial Assistance Application
cy: Cymhwysiad Cymorth Ariannol

source: A Note to Learners
cy: Nodyn i'r dysgwyr

source: Dear edX Learner,
cy: Annwyl ddysgwr edX,

source: EdX Financial Assistance is a program we created to give learners in all financial circumstances a chance to earn a Verified Certificate upon successful completion of an edX course.
cy: Mae Cymorth Ariannol edX yn rhaglen y gwnaethom ei chreu i roi cyfle i bob dysgwr o bob amgylchiadau ariannol i ennill tystysgrif wedi'i gwirio ar ôl cyflawni cwrs edX yn llwyddiannus.

source: If you are interested in working toward a Verified Certificate, but cannot afford to pay the fee, please apply now. Please note that financial assistance is limited and may not be awarded to all eligible candidates.
cy: Os oes gennych ddiddordeb mewn gweithio tuag at dystysgrif wedi'i gwirio, ond yn methu fforddio talu'r ffi, gwnewch gais nawr. Sylwer bod y cymorth ariannol yn gyfyngedig ac mae'n bosib na chaiff ei ddyfarnu i bob ymgeisydd cymwys.

source: In order to be eligible for edX Financial Assistance, you must demonstrate that paying the Verified Certificate fee would cause you economic hardship. To apply, you will be asked to answer a few questions about why you are applying and how the Verified Certificate will benefit you.
cy: Er mwyn bod yn gymwys am Gymorth Ariannol edX, rhaid i chi ddangos y byddai talu'r ffi am y dystysgrif wedi'i gwirio yn achosi caledi economaidd. I wneud cais, bydd gofyn i chi ateb rhai cwestiynau am eich rhesymau dros wneud cais a sut byddai tystysgrif wedi'i gwirio o fudd i chi.

source: If your application is approved, we'll give you instructions for verifying your identity on edx.org so you can start working toward completing your edX course.
cy: Os caiff eich cais ei gymeradwyo, byddwn yn rhoi cyfarwyddiadau i chi ar gyfer gwirio eich hunaniaeth ar edx.org fel y gallwch weithio tuag at gwblhau eich cwrs edX.

source: EdX is committed to making it possible for you to take high quality courses from leading institutions regardless of your financial situation, earn a Verified Certificate, and share your success with others.
cy: Mae edX yn ymroddedig i'w gwneud hi'n bosibl i chi gymryd cyrsiau ansawdd uchel gyda sefydliadau sy'n arwain ni waeth beth yw eich sefyllfa ariannol, ennill tystysgrif wedi'i gwirio a rhannu eich llwyddiant ag eraill.

source: Sincerely, Anant
cy: Yn gywir, Anant

source: Back to Student FAQs
cy: Yn ôl i gwestiynau cyffredin myfyrwyr

source: Apply for Financial Assistance
cy: Gwneud cais am gymorth ariannol

source: Add Coupon Code
cy: Ychwanegu côd cwpon

source: Enter information about the coupon code below.
cy: Rhowch wybodaeth am y côd cwpon isod.

source: Discount Percentage
cy: Canran y disgownt

source: Add expiration date
cy: Ychwanegu dyddiad darfod

source: Example Certificates
cy: Tystysgrifau enghreifftiol

source: Generate example certificates for the course.
cy: Cynhyrchu tystysgrifau enghreifftiol ar gyfer y cwrs.

source: Generate Example Certificates
cy: Cynhyrchu tystysgrifau enghreifftiol

source: Status:
cy: Statws:

source: Generating example {name} certificate
cy: Cynhyrchu tystysgrif {name} enghreifftiol

source: Error generating example {name} certificate: {error}
cy: Gwall wrth gynhyrchu tystysgrif {name} enghreifftiol: {error}

source: View {name} certificate
cy: Gweld tystysgrif {name}

source: Refresh Status
cy: ail-wneud statws

source: Student-Generated Certificates
cy: Tystysgrifau a grëwyd gan y myfyrwyr

source: Disable Student-Generated Certificates
cy: Analluogi tystysgrifau a grëwyd gan y myfyrwyr

source: Enable Student-Generated Certificates
cy: Galluogi tystysgrifau a grëwyd gan y myfyrwyr

source: You must successfully generate example certificates before you enable student-generated certificates.
cy: Rhaid i chi gynhyrchu tystysgrifau enghreifftiol yn llwyddiannus cyn i chi alluogi tystysgrifau a grëwyd gan y myfyrwyr.

source: Generate Certificates
cy: Cynhyrchu tystysgrifau

source: Course certificate generation requires an activated web certificate configuration.
cy: Mae angen ffurfweddiad tystysgrif gwe wedi'i alluogi i gynhyrchu tystysgrif cwrs.

source: When you are ready to generate certificates for your course, click Generate Certificates. You do not need to do this if you have set the certificate mode to on-demand generation.
cy: Pan fyddwch yn barod i gynhyrchu tystysgrif ar gyfer eich cwrs, cliciwch ar Cynhyrchu tystysgrifau. Nid oes angen i chi wneud hwn os ydych wedi gosod modd y dystysgrif i gynhyrchu ar gais.

source: Pending Tasks
cy: Tasgau yn yr arfaeth

source: The status for any active tasks appears in a table below.
cy: Mae statws unrhyw dasg actif yn ymddangos yn y tabl isod.

source: Regenerate Certificates
cy: Ailgynhyrchu tystysgrifau

source: To regenerate certificates for your course, choose the learners who will receive regenerated certificates and click Regenerate Certificates.
cy: I ailgynhyrchu tystysgrifau ar gyfer eich cwrs, dewiswch y dysgwyr a fydd yn derbyn tystysgrifau a ailgynhyrchwyd a chlicio ar Ailgynhyrchu tystysgrifau.

source: Choose learner types for regeneration
cy: Dewiswch y math o ddysgwyr ar gyfer ailgynhyrchu

source: Regenerate for learners who have already received certificates. ({count})
cy: Ailgynhyrchu ar gyfer dysgwyr sydd eisoes wedi derbyn tystysgrifau. ({count})
