Repository: zhulinhai/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: cy

source: Your request is currently being reviewed by {platform_name} staff and should be updated shortly.
cy: Mae eich cais yn cael ei adolygu ar hyn o bryd gan staff {platform_name} a dylai gael ei ddiweddaru'n fuan.

source: (Read-only)
cy: (Darllen yn unig)

source: Were you expecting to see a particular library here?
cy: Oeddech chi'n disgwyl gweld llyfrgell benodol yma?

source: The library creator must give you access to the library. Contact the library creator or administrator for the library you are helping to author.
cy: Rhaid i luniwr y llyfrgell roi mynediad i'r llyfrgell i chi. Cysylltwch â lluniwr y llyfrgell neu weinyddydd y llyfrgell rydych yn helpu i'w awduro.

source: Create Your First Library
cy: Creu eich llyfrgell gyntaf

source: Libraries hold a pool of components that can be re-used across multiple courses. Create your first library with the click of a button!
cy: Mae llyfrgelloedd yn cynnal cronfa o gydrannau y gellir eu hailddefnyddio ar draws sawl cwrs. Crëwch eich llyfrgell gyntaf gyda chlic botwm!

source: New to {studio_name}?
cy: Newydd i {studio_name}?

source: Click Help in the upper-right corner to get more information about the {studio_name} page you are viewing. You can also use the links at the bottom of the page to access our continually updated documentation and other {studio_name} resources.
cy: Cliciwch Help yn y gornel dde uchaf i gael mwy o wybodaeth am y dudalen {studio_name} rydych yn ei wylio. Gallwch hefyd ddefnyddio'r dolenni ar waelod y dudalen i weld ein dogfennaeth a ddiweddarir yn barhaus ac adnoddau {studio_name} eraill.

source: Getting Started with {studio_name}
cy: Dechrau gyda {studio_name}

source: Can I create courses in {studio_name}?
cy: Gallaf i greu cyrsiau yn {studio_name}?

source: In order to create courses in {studio_name}, you must {link_start}contact {platform_name} staff to help you create a course{link_end}.
cy: Er mwyn creu cyrsiau yn {studio_name}, rhaid i chi {link_start}gysylltu â {platform_name} staff i'ch helpu i greu cwrs{link_end}.

source: In order to create courses in {studio_name}, you must have course creator privileges to create your own course.
cy: Er mwyn creu cyrsiau yn {studio_name}, rhaid bod gennych hawliau lluniwr cyrsiau i greu eich cwrs eich hun.

source: Your request to author courses in {studio_name} has been denied. Please {link_start}contact {platform_name} Staff with further questions{link_end}.
cy: Mae eich cais i awduro cyrsiau yn {studio_name} wedi cael ei wrthod. {link_start}Cysylltwch â staff {platform_name} i holi mwy o gwestiynau{link_end}.

source: Thanks for signing up, {name}!
cy: Diolch am gofrestru, {name}!

source: We need to verify your email address
cy: Mae angen i ni wirio eich cyfeiriad e-bost

source: Almost there! In order to complete your sign up we need you to verify your email address ({email}). An activation message and next steps should be waiting for you there.
cy: Bron yna! Er mwyn cwblhau cofrestru mae'n rhaid i chi wirio eich cyfeiriad e-bost ({email}). Dylai neges ysgogi a'r camau nesaf fod yn aros amdanoch yno.

source: Need help?
cy: Angen cymorth arnoch?

source: Please check your Junk or Spam folders in case our email isn't in your INBOX. Still can't find the verification email? Request help via the link below.
cy: Edrychwch yn eich ffolderi Rwtsh neu sbam rhag ofn nad yw ein e-bost yn eich mewnflwch. Yn methu dod o hyd i'r e-bost wirio o hyd? Gofyn am help trwy'r ddolen isod.

source: Content Library
cy: Llyfrgell cynnwys

source: Add Component
cy: Ychwanegu cydran

source: Adding content to your library
cy: Yn ychwanegu cynnwys i'ch llyfrgell

source: Add components to your library for use in courses, using Add New Component at the bottom of this page.
cy: Ychwanegu cydrannau i'r llyfrgell i'w defnyddio yn y cyrsiau, gan ddefnyddio'r botwm Ychwanegu Cydran Newydd ar waelod y dudalen hon.

source: Components are listed in the order in which they are added, with the most recently added at the bottom. Use the pagination arrows to navigate from page to page if you have more than one page of components in your library.
cy: Caiff y cydrannau eu rhestru yn nhrefn eu hychwanegu, gyda'r diweddaraf ar y gwaelod. Defnyddiwch y saethau tudalennu i lywio o dudalen i dudalen os oes gennych fwy nag un tudalen o gydrannau yn eich llyfrgell.

source: Using library content in courses
cy: Yn defnyddio cynnwys llyfrgelloedd mewn cyrsiau

source: Use library content in courses by adding the {em_start}library_content{em_end} policy key to the Advanced Module List in the course's Advanced Settings, then adding a Randomized Content Block to your courseware. In the settings for each Randomized Content Block, select this library as the source library, and specify the number of problems to be randomly selected and displayed to each student.
cy: Defnyddiwch cynnwys llyfrgell mewn cyrsiau drwy ychwanegu'r allwedd polisi {em_start}library_content{em_end} i'r Rhestr modiwl uwch yn y gosodiadau uwch, ac yna ychwanegu bloc-gynnwys ar hap i'ch gwaith cwrs. Yn y gosodiadau ar gyfer pob bloc-gynnwys ar hap, dewiswch y llyfrgell hon fel y llyfrgell ffynhonnell, a nodi nifer y problemau i'w dethol ar hap a'u harddangos i bob myfyriwr.

source: Learn more about content libraries
cy: Dysgu mwy am lyfrgelloedd cynnwys

source: Course Team Settings
cy: Gosodiadau tîm y cwrs

source: New Team Member
cy: Aelod tîm newydd

source: Add a User to Your Course's Team
cy: Ychwanegu defnyddiwr i dîm eich cwrs

source: New Team Member Information
cy: Gwybodaeth am aelod tîm newydd

source: User's Email Address
cy: Cyfeiriad e-bost defnyddiwr

source: Provide the email address of the user you want to add as Staff
cy: Darparu cyfeiriad e-bost y defnyddiwr rydych am ei gynnwys fel staff

source: Add User
cy: Ychwanegu defnyddiwr

source: Add Team Members to This Course
cy: Ychwanegu aelodau tîm i'r cwrs hwn

source: Adding team members makes course authoring collaborative. Users must be signed up for {studio_name} and have an active account.
cy: Mae ychwanegu aelodau tîm yn galluogi awduro cyrsiau ar y cyd. Rhaid i'r defnyddwyr fod wedi cofrestru gyda {studio_name} a chael cyfrif actif.

source: Add a New Team Member
cy: Ychwanegu aelod tîm newydd

source: Course Team Roles
cy: Rolau tîm y cwrs

source: Course team members with the Staff role are course co-authors. They have full writing and editing privileges on all course content.
cy: Mae aelodau tîm y cwrs sydd â rôl staff yn gyd-awduron y cwrs. Mae ganddynt ganiatadau ysgrifennu a golygu llawn ar holl gynnwys y cwrs.

source: Admins are course team members who can add and remove other course team members.
cy: Aelodau tîm y cwrs yw'r gweinyddwyr sy'n gallu ychwanegu neu ddileu aelodau eraill o dîm y cwrs.

source: All course team members can access content in Studio, the LMS, and Insights, but are not automatically enrolled in the course.
cy: Gall pob aelod tîm y cwrs weld cynnwys yn Studio, LMS ac Insights, ond ni chânt eu cofrestru'n awtomatig ar y cwrs.

source: Transferring Ownership
cy: Yn trosglwyddo perchnogaeth

source: Every course must have an Admin. If you are the Admin and you want to transfer ownership of the course, click <strong>Add admin access</strong> to make another user the Admin, then ask that user to remove you from the Course Team list.
cy: Rhaid i bob cwrs gael gweinyddydd. Os taw chi yw'r gweinyddydd ac am drosglwyddo perchnogaeth y cwrs, cliciwch <strong>Add admin access</strong> i wneud defnyddiwr arall yn weinyddydd, yna gofynnwch i'r defnyddiwr hwnnw eich dileu o restr tîm y cwrs.

source: Library User Access
cy: Mynediad i ddefnyddwyr llyfrgell

source: User Access
cy: Mynediad i ddefnyddwyr

source: Grant Access to This Library
cy: Rhoi mynediad i'r llyfrgell hon

source: Provide the email address of the user you want to add
cy: Darparu cyfeiriad e-bost y defnyddiwr rydych am ei gynnwys fel staff

source: Add More Users to This Library
cy: Ychwanegu mwy o ddefnyddwyr i'r llyfrgell hon

source: Grant other members of your course team access to this library. New library users must have an active {studio_name} account.
cy: Rhoi mynediad i aelodau eraill tîm eich cwrs i'r llyfrgell hon. Rhaid i ddefnyddwyr newydd y llyfrgell gael cyfrif {studio_name} actif.

source: Add a New User
cy: Ychwanegu defnyddiwr newydd

source: Library Access Roles
cy: Rolau mynediad i lyfrgell

source: There are three access roles for libraries: User, Staff, and Admin.
cy: Ceir tair rôl mynediad i lyfrgelloedd: Defnyddiwr, staff a gweinyddol.

source: Library Users can view library content and can reference or use library components in their courses, but they cannot edit the contents of a library.
cy: Gall defnyddwyr llyfrgelloedd weld cynnwys llyfrgelloedd a chyfeirio neu ddefnyddio cydrannau llyfrgell yn eu cyrsiau, ond ni allant olygu cynnwys llyfrgell.

source: Library Staff are content co-authors. They have full editing privileges on the contents of a library.
cy: Mae staff llyfrgelloedd yn gyd-awduron cynnwys. Mae ganddynt ganiatadau golygu llawn ar gynnwys llyfrgell.

source: Library Admins have full editing privileges and can also add and remove other team members. There must be at least one user with the Admin role in a library.
cy: Mae gan weinyddwyr llyfrgell ganiatadau golygu llawn a gallant hefyd ychwanegu neu ddileu aelodau eraill o'r tîm. Rhaid bod gan o leiaf un defnyddiwr rôl gweinyddwr mewn llyfrgell.

source: Sign Up
cy: Cofrestru

source: Sign Up for {studio_name}
cy: Cofrestru ar gyfer {studio_name}

source: Already have a {studio_name} Account? Sign in
cy: Gennych gyfrif {studio_name} eisoes? Mewngofnodi

source: Ready to start creating online courses? Sign up below and start creating your first {platform_name} course today.
cy: Barod i ddechrau creu cyrsiau ar-lein? Cofrestrwch isod a dechrau creu eich cwrs {platform_name} cyntaf heddiw.

source: Required Information to Sign Up for {studio_name}
cy: Gwybodaeth ofynnol i gofrestru gyda {studio_name}

source: This will be used in public discussions with your courses and in our edX101 support forums
cy: Defnyddir hyn mewn trafodaethau cyhoeddus gyda'ch cyrsiau ac yn ein fforymau cefnogi edX101

source: Your Location
cy: Eich lleoliad

source: Preferred Language
cy: Eich dewis iaith

source: I agree to the {a_start} Terms of Service {a_end}
cy: Cytunaf i'r {a_start} telerau gwasanaeth {a_end}

source: I agree to the {link_start}Terms of Service and Honor Code{link_end}
cy: Cytunaf i'r {link_start} Telerau Gwasanaeth{link_end}

source: Create My Account &amp; Start Authoring Courses
cy: Creu fy nghyfrif &amp; Dechrau awduro cyrsiau

source: Common {studio_name} Questions
cy: Cwestiynau {studio_name} cyffredin

source: Who is {studio_name} for?
cy: Ar gyfer pwy mae {studio_name}?

source: {studio_name} is for anyone that wants to create online courses that leverage the global {platform_name} platform. Our users are often faculty members, teaching assistants and course staff, and members of instructional technology groups.
cy: Mae {studio_name} ar gyfer unrhyw un sydd am greu cyrsiau ar-lein ar gyfer platfform {platform_name} byd-eang. Mae ein defnyddwyr yn aml yn aelodau cyfadran, yn gynorthwywyr addysgu ac yn staff cyrsiau, ac aelodau grwpiau technoleg cyfarwyddol.

source: How technically savvy do I need to be to create courses in {studio_name}?
cy: Faint o grebwyll technegol sydd ei angen arna i er mwyn creu cyrsiau yn {studio_name}?

source: {studio_name} is designed to be easy to use by almost anyone familiar with common web-based authoring environments (Wordpress, Moodle, etc.). No programming knowledge is required, but for some of the more advanced features, a technical background would be helpful. As always, we are here to help, so don't hesitate to dive right in.
cy: Mae {studio_name} wedi'i ddylunio i fod yn hawdd ei ddefnyddio gan bron unrhyw un sy'n gyfarwydd ag amgylcheddau awduro ar y we cyffredin (Wordpress, Moodle, etc.). Nid oes angen unrhyw wybodaeth rhaglennu, ond ar gyfer rhai o'r nodweddion mwy anodd, byddai cefndir technegol yn ddefnyddiol. Fel arfer, rydym yma i helpu, felly peidiwch ag oedi cyn neidio i'w chanol hi.

source: I've never authored a course online before. Is there help?
cy: Nid wyf erioed wedi awduro cwrs ar-lein o'r blaen. A oes help?

source: Absolutely. We have created an online course, edX101, that describes some best practices: from filming video, creating exercises, to the basics of running an online course. Additionally, we're always here to help, just drop us a note.
cy: Wrth gwrs. Rydym wedi creu cwrs ar-lein, edX101, sy'n disgrifio rhai o'r arferion gorau: o ffilmio fideos, creu ymarferion, i elfennau cynnal cwrs ar-lein. At hynn, rydym yma i'ch helpu o hyd. Anfonwch neges atom.

source: Schedule & Details Settings
cy: Gosodiadau amserlen ac uned

source: Schedule & Details
cy: Amserlen a manylion

source: Basic Information
cy: Gwybodaeth sylfaenol

source: The nuts and bolts of your course
cy: Manylion eich cwrs

source: This field is disabled: this information cannot be changed.
cy: Mae'r maes hwn wedi cael ei analluogi: ni ellir newid yr wybodaeth hon.

source: Course Summary Page
cy: Tudalen crynodeb y cwrs

source: (for student enrollment and access)
cy: (ar gyfer cofrestru myfyrwyr a mynediad)

source: Enroll in {course_display_name}
cy: Cofrestru ar gyfer {course_display_name}

source: The course "{course_display_name}", provided by {platform_name}, is open for enrollment. Please navigate to this course at {link_for_about_page} to enroll.
cy: Mae'r cwrs "{course_display_name}", a ddarperir gan {platform_name}, ar agor ar gyfer cofrestru. Ewch i'r cwrs hwn yn {link_for_about_page} i gofrestru.

source: Send a note to students via email
cy: Anfonwch nodyn at y myfyrwyr ar e-bost

source: Invite your students
cy: Gwahodd eich myfyrwyr

source: Promoting Your Course with {platform_name}
cy: Hyrwyddo eich cwrs gyda {platform_name}

source: Your course summary page will not be viewable until your course has been announced. To provide content for the page and preview it, follow the instructions provided by your Program Manager.
cy: Ni fydd eich tudalen grynodeb i'w gweld hyd nes cyhoeddi eich cwrs. I ddarparu cynnwys ar gyfer y dudalen ac i'w rhagweld, dilynwch y cyfarwyddiadau a ddarparwyd gan eich rheolwr rhaglen.

source: Course Credit Requirements
cy: Gofynion credydau cwrs

source: Steps required to earn course credit
cy: Y camau angenrheidiol i ennill credyd cwrs

source: Minimum Grade
cy: Gradd ofynnol

source: Successful Proctored Exam
cy: Arholiad procter llwyddiannus

source: Proctored Exam {number}
cy: Arholiad procter {number}

source: ID Verification
cy: Gwirio rhif adnabod

source: In-Course Reverification {number}
cy: Ailwirio yn ystod y cwrs {number}

source: Course Schedule
cy: Amserlen y cwrs

source: Dates that control when your course can be viewed
cy: Dyddiadau sy'n rheoli pryd caiff eich cwrs ei weld

source: First day the course begins
cy: Diwrnod cyntaf dechrau'r cwrs

source: Course Start Time
cy: Amser dechrau'r cwrs

source: Last day your course is active
cy: Diwrnod olaf mae eich cwrs yn fyw

source: Course End Time
cy: Amser gorffen eich cwrs

source: Enrollment Start Date
cy: Dyddiad dechrau cofrestru

source: First day students can enroll
cy: Diwrnod cyntaf gall myfyrwyr gofrestru

source: Enrollment Start Time
cy: Amser dechrau cofrestru

source: Enrollment End Date
cy: Dyddiad gorffen cofrestru

source: Last day students can enroll.
cy: Diwrnod olaf gall myfyrwyr gofrestru.

source: Contact your edX partner manager to update these settings.
cy: Cysylltwch â'ch rheolwr partner edX i ddiweddaru'r gosodiadau hyn.

source: Enrollment End Time
cy: Amser gorffen cofrestru

source: These Dates Are Not Used When Promoting Your Course
cy: Ni ddefnyddir y dyddiadau hyn wrth hyrwyddo'ch cwrs

source: These dates impact {strong_start}when your courseware can be viewed{strong_end}, but they are {strong_start}not the dates shown on your course summary page{strong_end}. To provide the course start and registration dates as shown on your course summary page, follow the instructions provided by your Program Manager.
cy: Mae'r dyddiadau hyn yn dod i rym {strong_start}pan gellir gweld eich deunydd cwrs{strong_end}, ond nid {strong_start}dyma'r dyddiadau a welir ar dudalen grynodeb eich cwrs{strong_end}. I roi dyddiadau dechrau a chofrestru eich cwrs fel sydd i'w gweld ar dudalen grynodeb eich cwrs, dilynwch y cyfarwyddiadau a roddir gan reolwr eich rhaglen.

source: Course Details
cy: Manylion y cwrs

source: Provide useful information about your course
cy: Darparu gwybodaeth ddefnyddiol am eich cwrs

source: Introducing Your Course
cy: Cyflwyno eich cwrs

source: Information for prospective students
cy: Gwybodaeth i ddarpar fyfyrwyr

source: Course Title
cy: Teitl y cwrs

source: Displayed as title on the course details page. Limit to 50 characters.
cy: I'w weld fel teitl ar dudalen manylion y cwrs. Cyfyngu i 50 o nodau.

source: Course Subtitle
cy: Is-deitl y cwrs

source: Displayed as subtitle on the course details page. Limit to 150 characters.
cy: I'w weld fel is-deitl ar dudalen manylion y cwrs. Cyfyngu i 150 o nodau.

source: Course Duration
cy: Hyd y cwrs

source: Displayed on the course details page. Limit to 50 characters.
cy: I'w weld ar dudalen manylion y cwrs. Cyfyngu i 50 o nodau.

source: Course Description
cy: Disgrifid o'r cwrs

source: Displayed on the course details page. Limit to 1000 characters.
cy: I'w weld ar dudalen manylion y cwrs. Cyfyngu i 1000 o nodau.

source: Course Short Description
cy: Disgrifiad o'r cwrs byr

source: Appears on the course catalog page when students roll over the course name. Limit to ~150 characters
cy: Yn ymddangos ar dudalen catalog y cwrs pan fydd myfyrwyr yn rholio dros enw'r cwrs. Cyfyngu i ~150 o nodau

source: Course Overview
cy: Trosolwg o'r cwrs

source: HTML Code Editor
cy: Golygydd côd HTML

source: Introductions, prerequisites, FAQs that are used on {a_link_start}your course summary page{a_link_end} (formatted in HTML)
cy: Cyflwyniadau, yr hanfodion, cwestiynau cyffredin a ddefnyddir ar {a_link_start}dudalen grynodeb eich cwrs{a_link_end} (fformatiwyd yn HTML)

source: Course Card Image
cy: Delwedd cerdyn y cwrs

source: You can manage this image along with all of your other {a_link_start}files and uploads{a_link_end}
cy: Gallwch reoli'r ddelwedd hon ynghyd â'ch holl {a_link_start}ffeiliau a llwythiadau i fyny{a_link_end} eraill

source: Your course currently does not have an image. Please upload one (JPEG or PNG format, and minimum suggested dimensions are 375px wide by 200px tall)
cy: Nid oes delwedd gan eich cwrs ar hyn o bryd. Llwythwch un i fyny (fformat JPEG neu PNG, a'r lleiafswm dimensiynau a argymhellir yw 375px o led a 200px uchder)

source: Your course image URL
cy: URL delwedd eich cwrs

source: Please provide a valid path and name to your course image (Note: only JPEG or PNG format supported)
cy: Darparwch lwybr dilys ac enw ar gyfer delwedd eich cwrs (Sylwer: cefnogir fformat JPEG neu PNG yn unig)

source: Upload Course Card Image
cy: Llwytho delwedd cerdyn y cwrs i fyny

source: Your course currently does not have an image. Please upload one (JPEG or PNG format, and minimum suggested dimensions are 1440px wide by 400px tall)
cy: Nid oes delwedd gan eich cwrs ar hyn o bryd. Llwythwch un i fyny (fformat JPEG neu PNG, a'r lleiafswm dimensiynau a argymhellir yw 1440px o led a 400px uchder)

source: Your banner image URL
cy: URL baner eich cwrs

source: Please provide a valid path and name to your banner image (Note: only JPEG or PNG format supported)
cy: Darparwch lwybr dilys ac enw ar gyfer delwedd eich baner (Sylwer: cefnogir fformat JPEG neu PNG yn unig)

source: Upload Course Banner Image
cy: Llwytho delwedd baner y cwrs i fyny

source: Video Thumbnail Image
cy: Cryno ddelwedd fideo

source: Your course currently does not have a video thumbnail image. Please upload one (JPEG or PNG format, and minimum suggested dimensions are 375px wide by 200px tall)
cy: Nid oes cryno ddelwedd fideo gan eich cwrs ar hyn o bryd. Llwythwch un i fyny (fformat JPEG neu PNG, a'r lleiafswm dimensiynau a argymhellir yw 375px o led a 200px uchder)

source: Your video thumbnail image URL
cy: URL eich cryno ddelwedd fideo

source: Please provide a valid path and name to your video thumbnail image (Note: only JPEG or PNG format supported)
cy: Darparwch lwybr dilys ac enw ar gyfer eich cryno ddelwedd fideo (Sylwer: cefnogir fformat JPEG neu PNG yn unig)

source: Upload Video Thumbnail Image
cy: Llwytho cryno ddelwedd fideo i fyny

source: Course Introduction Video
cy: Fideo cyflwyno'r cwrs

source: Delete Current Video
cy: Dilëwch y fideo cyfredol

source: your YouTube video's ID
cy: Rhif adnabod eich fideo YouTube

source: Enter your YouTube video's ID (along with any restriction parameters)
cy: Rhowch rif adnabod eich fideo YouTube (ynghyd ag unrhyw baramedrau cyfyngol)

source: Learning Outcomes
cy: Canlyniadau dysgu

source: Add the learning outcomes for this course
cy: Ychwanegu'r canlyniadau dysgu ar gyfer y cwrs hwn

source: Add Learning Outcome
cy: Ychwanegu canlyniad dysgu

source: Instructors
cy: Hyfforddwyr

source: Add details about the instructors for this course
cy: Ychwanegu manylion am hyfforddwyr y cwrs hwn

source: Add Instructor
cy: Ychwanegu hyfforddwr

source: Expectations of the students taking this course
cy: Disgwyliadau'r myfyrwyr sy'n cymryd y cwrs

source: Hours of Effort per Week
cy: Oriau ymdrech bob wythnos

source: Time spent on all course work
cy: Yr amser a dreuliwyd ar yr holl waith cwrs

source: Prerequisite Course
cy: Cwrs hanfodol

source: Course that students must complete before beginning this course
cy: Cwrs mae'n rhaid i fyfyrwyr ei gwblhau cyn dechrau'r cwrs hwn

source: set pre-requisite course
cy: gosod cwrs hanfodol

source: Require students to pass an exam before beginning the course.
cy: Rhaid i fyfyrwyr lwyddo mewn arholiad cyn dechrau'r cwrs.

source: You can now view and author your course entrance exam from the {link_start}Course Outline{link_end}.
cy: Gallwch nawr weld ac awduro arholiad mynediad eich cwrs drwy {link_start}Amlinelliad y cwrs{link_end}.

source: Grade Requirements
cy: Gofynion gradd

source: Course Pacing
cy: Cyflymder y cwrs

source: Set the pacing for this course
cy: Gosod cyflymder cyflawni'r cwrs hwn

source: Instructor-paced courses progress at the pace that the course author sets. You can configure release dates for course content and due dates for assignments.
cy: Mae cyrsiau cyflymder yr hyfforddwr yn dilyn y cyflymder a osodir gan awdur y cwrs. Gallwch ffurfweddu dyddiadau rhyddhau ar gyfer cynnwys cwrs a dyddiadau disgwyl ar gyfer aseiniadau.

source: Self-paced courses do not have release dates for course content or due dates for assignments. Learners can complete course material at any time before the course end date.
cy: Nid oes gan gyrsiau hunan gyflymder ddyddiadau rhyddhau ar gyfer cynnwys cyrsiau na ddyddiadau disgwyl ar gyfer aseiniadau. Gall dysgwyr gwblhau deunydd cwrs unrhyw bryd cyn dyddiad gorffen y cwrs.

source: Course Content License
cy: Trwydded cynnwys y cwrs

source: Select the default license for course content
cy: Dewis trwydded ddiofyn ar gyfer cynnwys y cwrs

source: How are these settings used?
cy: Sut defnyddir y gosodiadau hyn?

source: Your course's schedule determines when students can enroll in and begin a course.
cy: Mae amserlen eich cwrs yn pennu pryd caiff myfyrwyr gofrestru ar gwrs a'i ddechrau.
