Repository: zhulinhai/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: cy

source: Question {index}
cy: Cwestiwn {index}

source: Correct:
cy: Cywir:

source: Incorrect:
cy: Anghywir:

source: Answer
cy: Ateb

source: Error {err} in evaluating hint function {hintfn}.
cy: Gwall {err} wrth werthuso'r swyddogaeth awgrym {hintfn}.

source: (Source code line unavailable)
cy: (Nid yw'r llinell côd ffynhonnell ar gael)

source: See XML source line {sourcenum}.
cy: Gweler llinell ffynhonnell XML {sourcenum}.

source: Checkboxes
cy: Blychau gwirio

source: Multiple Choice
cy: Amlddewis

source: Do not use shuffle and answer-pool at the same time
cy: Peidiwch â defnyddio shifflo a'r gronfa atebion ar yr un pryd

source: answer-pool value should be an integer
cy: dylai gwerth y gronfa atebion fod yn gyfanrif

source: Choicegroup must include at least 1 correct and 1 incorrect choice
cy: Rhaid i'r grŵp dewis gynnwys o leiaf 1 dewis cywir ac 1 dewis anghywir

source: True/False Choice
cy: Dewis gwir/anwir

source: Dropdown
cy: Cwymplen

source: Numerical Input
cy: Mewnbwn2 rhifiadol

source: There was a problem with the staff answer to this problem.
cy: Roedd problem gydag ateb y staff i'r broblem hon.

source: Could not interpret '{student_answer}' as a number.
cy: Ni fedrwyd dehongli '{student_answer}' fel rhif.

source: Invalid math syntax: '{student_answer}'
cy: Cystrawen mathemateg annilys: '{student_answer}'

source: You may not use complex numbers in range tolerance problems
cy: Ni chewch ddefnyddio rhifau cymhleth gyda phroblemau goddefiant ystod

source: There was a problem with the staff answer to this problem: complex boundary.
cy: Roedd problem gydag ateb y staff i'r broblem hon: ffin gymhleth.

source: There was a problem with the staff answer to this problem: empty boundary.
cy: Roedd problem gydag ateb y staff i'r broblem hon: ffin wag.

source: or
cy: neu

source: Text Input
cy: Mewnbynnu testun

source: error
cy: gwall

source: Custom Evaluated Script
cy: Script a werthuswyd ar fesur

source: error getting student answer from {student_answers}
cy: gwall yn cael ateb myfyriwr gan {student_answers}

source: No answer entered!
cy: Ni roddwyd ateb!

source: CustomResponse: check function returned an invalid dictionary!
cy: CustomResponse: cafwyd geiriadur annilys!

source: Symbolic Math Input
cy: Mewnbwn mathemateg symbolaidd

source: An error occurred with SymbolicResponse. The error was: {error_msg}
cy: Cafwyd gwall gyda SymbolicResponse. Y gwall oedd: {error_msg}

source: Code Input
cy: Mewnbwn côd

source: No answer provided.
cy: Ni roddwyd ateb.

source: Error: No grader has been set up for this problem.
cy: Gwall: Nid oes graddiwr wedi cael ei nodi ar gyfer y broblem hon.

source: Unable to deliver your submission to grader (Reason: {error_msg}). Please try again later.
cy: Ni ellir cyflwyno eich cynnig i'r graddiwr (Rheswm: {error_msg}). Rhowch gynnig arall arni nes ymlaen.

source: Invalid grader reply. Please contact the course staff.
cy: Ymateb annilys gan y graddiwr. Cysylltwch â staff y cwrs.

source: External Grader
cy: Graddiwr allanol

source: Math Expression Input
cy: Mewnbwn mynegiad mathemateg

source: Invalid input: Could not parse '{bad_input}' as a formula.
cy: Mewnbwn annilys: Ni fedrwyd dosrannu '{bad_input}' fel fformiwla.

source: Invalid input: Could not parse '{bad_input}' as a formula
cy: Mewnbwn annilys: Ni fedrwyd dosrannu '{bad_input}' fel fformiwla

source: Circuit Schematic Builder
cy: Adeiladydd sgematig cylched

source: Error in evaluating SchematicResponse. The error was: {error_msg}
cy: Gwall wrth werthuso ymateb sgematig. Y gwall oedd: {error_msg}

source: Image Mapped Input
cy: Mewnbwn mapio delwedd

source: error grading {image_input_id} (input={user_input})
cy: gwall graddio {image_input_id} (input={user_input})

source: Error in problem specification! Cannot parse rectangle in {sr_coords}
cy: Gwall ym manyleb y broblem! Ni ellir dosrannu petryal yn {sr_coords}

source: Annotation Input
cy: Mewnbwn anodiad

source: Checkboxes With Text Input
cy: Blychau ticio gyda mewnbwn testun

source: Answer not provided for {input_type}
cy: Ni ddarparwyd ateb ar gyfer {input_type}

source: The Staff answer could not be interpreted as a number.
cy: Ni ellid dehongli ateb y staff fel rhif.

source: Could not interpret '{given_answer}' as a number.
cy: Ni fedrwyd dehongli '{given_answer}' fel rhif.

source: XML data for the annotation
cy: Data XML ar gyfer yr anodiad

source: The display name for this component.
cy: Yr enw arddangos ar gyfer y gydran hon.

source: Annotation
cy: Anodiad

source: Blank Advanced Problem
cy: Problem uwch wag

source: Number of attempts taken by the student on this problem
cy: Sawl cais gafodd y myfyriwr ar y broblem hon

source: Maximum Attempts
cy: Mwyafswm ceisiadau

source: Defines the number of times a student can try to answer this problem. If the value is not set, infinite attempts are allowed.
cy: Mae'n diffinio sawl gwaith gall myfyriwr geisio ateb y broblem. Os nad yw'r gwerth wedi'i osod, nid oes cyfyngiad ar nifer y ceisiadau.

source: Date that this problem is due by
cy: Dyddiad cau'r broblem hon yw

source: Amount of time after the due date that submissions will be accepted
cy: Hyd yr amser wedi'r dyddiad cau y derbynnir cyflwyniadau

source: Always
cy: Bob tro

source: Never
cy: Byth

source: Past Due
cy: Wedi'r dyddiad dychwelyd

source: Show Answer
cy: Dangos yr ateb

source: Defines when to show the answer to the problem. A default value can be set in Advanced Settings.
cy: Mae'n diffinio pryd i ddangos yr ateb i'r broblem. Gellir gosod gwerth diofyn yn y Gosodiadau Uwch.

source: Answered
cy: Atebwyd

source: Attempted
cy: Ceisiwyd

source: Closed
cy: Wedi'i gau

source: Finished
cy: Wedi'i orffen

source: Correct or Past Due
cy: Cywir neu wedi'r dyddiad dychwelyd

source: Whether to force the save button to appear on the page
cy: A ddylid gorfodi'r botwm cadw i ymddangos ar y dudalen

source: Show Reset Button
cy: Dangos y botwm ailosod

source: Determines whether a 'Reset' button is shown so the user may reset their answer. A default value can be set in Advanced Settings.
cy: Yn pennu a ddangosir botwm 'Ailosod' ai peidio fel y gall defnyddiwr ailosod ei ateb. Gellir gosod gwerth diofyn yn y Gosodiadau Uwch.

source: Randomization
cy: Hapdrefnu

source: Defines when to randomize the variables specified in the associated Python script. For problems that do not randomize values, specify "Never".
cy: Yn diffinio pryd i hapdrefnu newidynnau a nodwyd yn y sgript Python cysylltiedig. Ar gyfer problemau nad ydynt yn hapdrefnu gwerthoedd, nodwch "Byth".

source: On Reset
cy: Wrth ailosod

source: Per Student
cy: Fesul myfyriwr

source: XML data for the problem
cy: Data XML ar gyfer y broblem

source: Dictionary with the correctness of current student answers
cy: Geiriadur gyda chywirdeb atebion myfyrwyr cyfredol

source: Dictionary for maintaining the state of inputtypes
cy: Geiriadur ar gyfer cynnal cyflwr y mathau a fewnbynnir

source: Dictionary with the current student responses
cy: Geiriadur gydag atebion y myfyrwyr cyfredol

source: Whether or not the answers have been saved since last submit
cy: Ni waeth a gafodd yr atebion eu cadw ers y cyflwyno diwethaf ai peidio

source: Whether the student has answered the problem
cy: A yw myfyriwr wedi ateb y broblem

source: Random seed for this student
cy: Hedyn ar hap i'r myfyriwr hwn

source: Last submission time
cy: Amser cyflwyno olaf

source: Timer Between Attempts
cy: Amserydd rhwng ceisiadau

source: Seconds a student must wait between submissions for a problem with multiple attempts.
cy: Yr eiliadau mae'n rhaid i fyfyriwr aros rhwng cyflwyniadau ar gyfer problem lle mae wedi gwneud sawl ymgais.

source: Problem Weight
cy: Pwysoliad y broblem

source: Defines the number of points each problem is worth. If the value is not set, each response field in the problem is worth one point.
cy: Yn diffinio nifer y pwyntiau sydd i bob problem. Os nad yw'r gwerth wedi'i osod, bydd pob maes ymateb yn y broblem werth un pwynt.

source: Markdown source of this module
cy: Ffynhonnell markdown y modiwl hwn

source: Source code for LaTeX and Word problems. This feature is not well-supported.
cy: Côd ffynhonnell ar gyfer problemau LaTeX a Word. Nid yw'r nodwedd hon wedi'i chefnogi'n dda.

source: Enable LaTeX templates?
cy: Galluogi patrymluniau LaTeX?

source: Matlab API key
cy: Allwedd API Matlab

source: Enter the API key provided by MathWorks for accessing the MATLAB Hosted Service. This key is granted for exclusive use by this course for the specified duration. Please do not share the API key with other courses and notify MathWorks immediately if you believe the key is exposed or compromised. To obtain a key for your course, or to report an issue, please contact moocsupport@mathworks.com
cy: Rhowch yr allwedd API a ddarparwyd gan MathWorks ar gyfer gweld MATLAB Hosted Service. Rhoddir yr allwedd hwn i'w ddefnyddio'n unig ar y cwrs hwn am hyd penodol. Peidiwch â rhannu'r allwedd API gyda chyrsiau eraill a rhowch wybod i MathWorks yn syth os credwch bod yr allwedd yn cael ei gamddefnyddio neu ei beryglu. I gael allwedd ar gyfer eich cwrs, neu i adrodd am broblem, cysylltwch â moocsupport@mathworks.com

source: Submit
cy: Cyflwyno

source: Submitting
cy: Yn cyflwyno

source: Warning: The problem has been reset to its initial state!
cy: Rhybudd: Mae'r broblem wedi cael ei hailosod i'w chyflwr gwreiddiol!

source: The problem's state was corrupted by an invalid submission. The submission consisted of:
cy: Cafodd cyflwr y broblem ei lygru gan gyflwyniad annilys. Cyflwynwyd hyn:

source: If this error persists, please contact the course staff.
cy: Os bydd y gwall yn parhau, cysylltwch ag aelod o staff y cwrs.

source: Your answers were previously saved. Click '{button_name}' to grade them.
cy: Cafodd eich atebon eu cadw eisoes. Cliciwch '{button_name}' i'w graddio.

source: Partially Correct
cy: yn rhannol gywir

source: Problem is closed.
cy: Mae'r broblem wedi'i chau.

source: Problem must be reset before it can be submitted again.
cy: Rhaid ailosod problem cyn gellir ei chyflwyno eto.

source: You must wait at least {wait} seconds between submissions.
cy: Rhaid i chi aros o leiaf {wait} eiliad rhwng cyflwyno.

source: You must wait at least {wait_secs} between submissions. {remaining_secs} remaining.
cy: Rhaid i chi aros o leiaf {wait_secs} rhwng cyflwyno. {remaining_secs} yn weddill.

source: Problem needs to be reset prior to save.
cy: Rhaid ailosod y broblem cyn cadw.

source: Your answers have been saved.
cy: Mae eich atebion wedi cael eu cadw.

source: Your answers have been saved but not graded. Click '{button_name}' to grade them.
cy: Mae eich atebion wedi cael eu cadw ond heb eu graddio. Cliciwch '{button_name}' i'w graddio.

source: You cannot select Reset for a problem that is closed.
cy: Ni chewch ddewis Ailosod ar gyfer problem sydd wedi cau.

source: You must submit an answer before you can select Reset.
cy: Rhaid i chi gyflwyno ateb cyn dewis ailosod.

source: Problem's definition does not support rescoring.
cy: Nid yw diffiniad problem yn cefnogi ail-sgorio.

source: Problem must be answered before it can be graded again.
cy: Rhaid ateb problem cyn gellir ei graddio eto.

source: We're sorry, there was an error with processing your request. Please try reloading your page and trying again.
cy: Mae'n flin gennym, cafwyd gwall wrth brosesu'ch archeb. Ceisiwch ail-lwytho'ch tudalen a rhoi cynnig arall arni.

source: The state of this problem has changed since you loaded this page. Please refresh your page.
cy: Mae cyflwr y broblem hon wedi newid ers i chi lwytho'r dudalen hon. Ailwnewch y dudalen.

source: Conditional
cy: Amodol

source: List of urls of children that are references to external modules
cy: Rhestr o url plant sy'n cyfeirio at fodiwlau allanol

source: Source Components
cy: Cydrannau'r ffynhonnell

source: The component location IDs of all source components that are used to determine whether a learner is shown the content of this conditional module. Copy the component location ID of a component from its Settings dialog in Studio.
cy: Rhifau adnabod lleoliad cydrannau yr holl gydrannau ffynhonnell a ddefnyddir i bennu a ddangosir cynnwys y modiwl amodol hwn i ddysgwr. Copïwch rif adnabod lleoliad cydran o'i ddeialog Gosodiadau yn Studio.

source: Conditional Attribute
cy: Priodoledd amodol

source: The attribute of the source components that determines whether a learner is shown the content of this conditional module.
cy: Priodoledd y cydrannau ffynhonnell sy'n pennu a ddangosir cynnwys y modiwl amodol hwn i ddysgwr.

source: Conditional Value
cy: Gwerth amodol

source: The value that the conditional attribute of the source components must match before a learner is shown the content of this conditional module.
cy: Rhaid i werth cydran amodol y cydrannau ffynhonnell gydweddu cyn dangos cynnwys y modiwl amodol hwn i ddysgwr.

source: Blocked Content Message
cy: Neges cynnwys wedi'i rwystro

source: The message that is shown to learners when not all conditions are met to show the content of this conditional module. Include {link} in the text of your message to give learners a direct link to required units. For example, 'You must complete {link} before you can access this unit'.
cy: Y neges a ddangosir i ddysgwyr pan nad yw'r holl amodau wedi'u bodloni er mwyn dangos cynnwys y modiwl amodol hwn. Rhowch {link} yn nhestun eich neges i roi dolen uniongyrchol i fyfyrwyr i'r unedau gofynnol. Er enghraifft, 'Rhaid i chi gwblhau {link} cyn cael mynediad i'r uned hon'.

source: You must complete {link} before you can access this unit.
cy: Rhaid i chi gwblhau {link} cyn cael mynediad i'r uned hon.

source: This component has no source components configured yet.
cy: Nid oes gan y gydran hon gydrannau ffynhonnell wedi'u ffurfweddu eto.

source: Configure list of sources
cy: Ffurfweddu rhestr o ffynonellau

source: LTI Passports
cy: Pasportau LTI

source: Enter the passports for course LTI tools in the following format: "id:client_key:client_secret".
cy: Rhowch y pasportau ar gyfer offer cwrs LTI yn y fformat a ganlyn: "id:client_key:client_secret".

source: List of Textbook objects with (title, url) for textbooks used in this course
cy: Rhestr o wrthrychau'r gwerslyfr (teitl, url) ar gyfer gwerslyfrau a ddefnyddir yn y cwrs hwn

source: Slug that points to the wiki for this course
cy: Slyg sy'n pwyntio ar y wici ar gyfer y cwrs hwn

source: Date that enrollment for this class is opened
cy: Dyddiad agor cofrestru ar gyfer y dosbarth hwn

source: Date that enrollment for this class is closed
cy: Dyddiad cau cofrestru ar gyfer y dosbarth hwn

source: Start time when this module is visible
cy: Amser dechrau pan fydd y modiwl hwn i'w weld

source: Date that this class ends
cy: Dyddiad gorffen y dosbarth hwn

source: Cosmetic Course Display Price
cy: Pris arddangos cwrs cosmetig

source: The cost displayed to students for enrolling in the course. If a paid course registration price is set by an administrator in the database, that price will be displayed instead of this one.
cy: Y gost a ddangosir i fyfyrwyr sy'n cofrestru ar y cwrs. Os yw pris cofrestru ar gwrs â thâl yn cael ei osod gan weinyddwr yn y gronfa ddata, bydd y pris hwnnw yn cael ei arddangos yn lle hwn.

source: Course Advertised Start
cy: Dechrau'r cwrs a hysbysebwyd

source: Enter the text that you want to use as the advertised starting time frame for the course, such as "Winter 2018". If you enter null for this value, the start date that you have set for this course is used.
cy: Rhowch y testun rydych am ei ddefnyddio fel y ffrâm amser dechrau a hysbysebir ar gyfer y cwrs, megis "Gaeaf 2018". Os rhowch ddim ar gyfer y gwerth hwn, defnyddir y dyddiad dechrau rydych wedi'i osod ar gyfer y cwrs.

source: Pre-Requisite Courses
cy: Cyrsiau rhagofynnol

source: Pre-Requisite Course key if this course has a pre-requisite course
cy: Allwedd y cyrsiau rhagofynnol os oes gan y cwrs gwrs rhagofynnol

source: Grading policy definition for this class
cy: Diffiniad y polisi graddio ar gyfer y dosbarth hwn

source: Show Calculator
cy: Dangos cyfrifiannell

source: Enter true or false. When true, students can see the calculator in the course.
cy: Rhowch gwir neu anwir. Pan yn wir, gall y myfyrwyr weld y gyfrifiannell yn y cwrs.

source: Enter the name of the course as it should appear in the edX.org course list.
cy: Rhowch enw'r cwrs fel y dylai ymddangos ar restr cyrsiau edX.org.

source: Course Display Name
cy: Enw arddangos y cwrs

source: Course Editor
cy: Golygydd y cwrs

source: Enter the method by which this course is edited ("XML" or "Studio").
cy: Rhowch y dull a ddefnyddir i olygu'r cwrs ("XML" neu "Studio").

source: Course Survey URL
cy: URL arolwg y cwrs

source: Enter the URL for the end-of-course survey. If your course does not have a survey, enter null.
cy: Rhowch yr URL ar gyfer yr arolwg diwedd cwrs. Os nad oes gan eich cwrs arolwg, rhowch ddim.

source: Discussion Blackout Dates
cy: Dyddiadau cau'r trafodaethau

source: Enter pairs of dates between which students cannot post to discussion forums. Inside the provided brackets, enter an additional set of square brackets surrounding each pair of dates you add. Format each pair of dates as ["YYYY-MM-DD", "YYYY-MM-DD"]. To specify times as well as dates, format each pair as ["YYYY-MM-DDTHH:MM", "YYYY-MM-DDTHH:MM"]. Be sure to include the "T" between the date and time. For example, an entry defining two blackout periods looks like this, including the outer pair of square brackets: [["2015-09-15", "2015-09-21"], ["2015-10-01", "2015-10-08"]]
cy: Rhowch barau dyddiadau ar gyfer cyfnodau lle na chaiff y myfyrwyr bostio ar fforwm trafodaeth. O fewn y cromfachau a ddarperir, rhowch bâr ychwanegol o gromfachau sgwâr o amgylch bob pâr o dyddiadau a ychwanegwch. Fformatiwch bob pâr o ddyddiadau fel ["BBBB-MM-DD", "BBBB-MM-DD"]. I nodi amserau ynghyd â dyddiadau, fformatiwch pob pâr fel ["BBBB-MM-DDTAA:MM", "BBBB-MM-DDTAA:MM"]. Sicrhewch eich bod yn cynnwys y "T" rhwng y dyddiad a'r amser. Er enghraifft, bydd diffinio dau gyfnod caeëdig yn edrych fel hyn, gan gynnwys y pâr allanol o gromfachau sgwâr: [["2015-09-15", "2015-09-21"], ["2015-10-01", "2015-10-08"]]

source: Discussion Topic Mapping
cy: Mapio pynciau trafod

source: Enter discussion categories in the following format: "CategoryName": {"id": "i4x-InstitutionName-CourseNumber-course-CourseRun"}. For example, one discussion category may be "Lydian Mode": {"id": "i4x-UniversityX-MUS101-course-2015_T1"}. The "id" value for each category must be unique. In "id" values, the only special characters that are supported are underscore, hyphen, and period.
cy: rhowch y categorïau trafod yn y fformatau hyn: "CategoryName": {"id": "i4x-InstitutionName-CourseNumber-course-CourseRun"}. Er enghraifft, gall un categori trafod fod yn "Modd Lydiaidd" {"id": "i4x-UniversityX-MUS101-course-2015_T1"}. Rhaid i werth "id" pob categori fod yn unigryw. Gyda gwerthoedd "id", yr unig nodau/gymeriadau arbennig a gefnogir yw tanlinell, cysylltnodau ac atalnodau llawn.

source: Discussion Sorting Alphabetical
cy: Trefnu trafodaethau yn nhrefn yr wyddor

source: Enter true or false. If true, discussion categories and subcategories are sorted alphabetically. If false, they are sorted chronologically by creation date and time.
cy: Rhowch gwir neu anwir. Os gwir, caiff y categorïau a'r is-gategorïau eu trefnu yn nhrefn yr wyddor. Os anwir, cânt eu trefnu'n gronolegol yn ôl dyddiad ac amser creu.

source: Course Announcement Date
cy: Dyddiad cyhoeddi'r cwrs

source: Enter the date to announce your course.
cy: Rhowch ddyddiad ar gyfer cyhoeddi'ch cwrs.

source: Cohort Configuration
cy: Ffurfweddu cohort

source: Enter policy keys and values to enable the cohort feature, define automated student assignment to groups, or identify any course-wide discussion topics as private to cohort members.
cy: Rhowch allweddi a gwerthoedd polisi er mwyn galluogi nodwedd cohort, diffinio aseiniadau myfyrwyr awtomataidd i grwpiau, neu nodi unrhyw bynciau trafod cwrs cyfan yn breifat i aelodau cohort.

source: Course Is New
cy: Mae'r cwrs yn newydd

source: Enter true or false. If true, the course appears in the list of new courses on edx.org, and a New! badge temporarily appears next to the course image.
cy: Rhowch gwir neu anwir. Os gwir, bydd y cwrs yn ymddangos ar y rhestr o gyrsiau newydd ar edx.org, a bathodyn Newydd! yn ymddangos dros dro nesaf at ddelwedd y cwrs.

source: Mobile Course Available
cy: Cwrs symudol ar gael

source: Enter true or false. If true, the course will be available to mobile devices.
cy: Rhowch gwir neu anwir. Os gwir, bydd y cwrs ar gael i'w ddefnyddio ar ddyfeisiau symudol.

source: Video Upload Credentials
cy: Cymwysterau llwytho fideo i fyny

source: Enter the unique identifier for your course's video files provided by edX.
cy: Rhowch ddynodydd unigryw ar gyfer ffeiliau fideo eich cwrs a ddarparwyd gan edX.

source: Course Not Graded
cy: Cwrs heb ei raddio

source: Enter true or false. If true, the course will not be graded.
cy: Rhowch gwir neu anwir. Os gwir, ni chaiff y cwrs ei raddio.

source: Disable Progress Graph
cy: Analluogi graff cynnydd

source: Enter true or false. If true, students cannot view the progress graph.
cy: Rhowch gwir neu anwir. Os gwir, ni all y myfyrwyr weld y graff cynnwys.

source: PDF Textbooks
cy: Gwerslyfrau PDF

source: List of dictionaries containing pdf_textbook configuration
cy: Rhestr o eiriaduron yn cynnwys ffurfweddiad pdf_textbook

source: HTML Textbooks
cy: Gwerslyfrau HTML

source: For HTML textbooks that appear as separate tabs in the course, enter the name of the tab (usually the title of the book) as well as the URLs and titles of each chapter in the book.
cy: Ar gyfer gwerslyfrau HTML sy'n ymddangos fel tabiau ar wahân yn y cwrs, rhowch enw'r tab (fel arfer teitl y llyfr) ynghyd â URL a theitlau pob pennod yn y llyfr.

source: Remote Gradebook
cy: Llyfr graddio pell

source: Enter the remote gradebook mapping. Only use this setting when REMOTE_GRADEBOOK_URL has been specified.
cy: Rhowch fapio'r llyfr graddio pell. Defnyddiwch y gosodiad hwn yn unig pan nodwyd REMOTE_GRADEBOOK_URL.

source: Enable CCX
cy: Galluogi CCX

source: Allow course instructors to assign CCX Coach roles, and allow coaches to manage Custom Courses on edX. When false, Custom Courses cannot be created, but existing Custom Courses will be preserved.
cy: Caniatáu i hyfforddwyr y cwrs aseinio rolau CCX Coach, a chaniatáu iddynt hwy reoli cyrsiau wedi'i teilwra ar edX. Pan yn anwir, ni ellir creu cyrsiau ar fesur, ond cedwir cyrsiau ar fesur sydd eisoes wedi'u creu.

source: CCX Connector URL
cy: URL cysylltydd CCX

source: URL for CCX Connector application for managing creation of CCXs. (optional). Ignored unless 'Enable CCX' is set to 'true'.
cy: URL ar gyfer cymhwysiad CCX Connector i reoli creu CCX (dewisol). Wedi'i anwybyddu oni bai bod 'Galluogi CCX' wedi'i osod fel 'gwir'

source: Allow Anonymous Discussion Posts
cy: Caniatáu postiadau trafodaeth dienw

source: Enter true or false. If true, students can create discussion posts that are anonymous to all users.
cy: Rhowch gwir neu anwir. Os gwir, gall y myfyrwyr greu postiadau trafodaeth sy'n ddienw i bob defnyddiwr.

source: Allow Anonymous Discussion Posts to Peers
cy: Caniatáu postiadau trafodaeth dienw i gyfoedion

source: Enter true or false. If true, students can create discussion posts that are anonymous to other students. This setting does not make posts anonymous to course staff.
cy: Rhowch gwir neu anwir. Os gwir, gall y myfyrwyr greu postiadau trafodaeth sy'n ddienw i fyfyrwyr eraill. Nid yw'r gosodiad hwn yn gwneud postiadau'n ddienw i staff y cwrs.

source: Advanced Module List
cy: Rhestr modiwlau uwch
