Repository: zhulinhai/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: cy

source: Other information from this page appears on the About page for your course. This information includes the course overview, course image, introduction video, and estimated time requirements. Students use About pages to choose new courses to take.
cy: Mae gwybodaeth arall o'r dudalen hon yn ymddangos ar y dudalen Amdano ar gyfer eich cwrs. Mae'r wybodaeth hon yn cynnwys trosolwg o'r cwrs, delwedd y cwrs, fideo cyflwyno ac amcangyfrif o'r gofynion amser. Mae myfyrwyr yn defnyddio tudalennau Amdano i ddewis cyrsiau newydd i'w cymryd.

source: Your policy changes have been saved.
cy: Mae'r newidiadau polisi wedi cael eu cadw.

source: There was an error saving your information. Please see below.
cy: Cafwyd gwall wrth gadw'ch gwybodaeth. Gweler isod.

source: Manual Policy Definition
cy: Diffinio polisi eich hun

source: {strong_start}Warning{strong_end}: Do not modify these policies unless you are familiar with their purpose.
cy: {strong_start}Rhybudd{strong_end}: Peidiwch ag addasu'r polisïau hyn oni bai eich bod yn gyfarwydd â'u diben.

source: Show Deprecated Settings
cy: Dangos gosodiadau anghymeradwy

source: What do advanced settings do?
cy: Beth mae gosodiadau uwch yn ei wneud?

source: Advanced settings control specific course functionality. On this page, you can edit manual policies, which are JSON-based key and value pairs that control specific course settings.
cy: Mae'r gosodiadau uwch yn rheoli ymarferoldeb cwrs penodol. Ar y dudalen hon, gallwch olygu polisïau eich hun, sy'n allwedd seiliedig ar JSON ac yn barau gwerth sy'n rheoli gosodiadau cwrs penodol.

source: Any policies you modify here override all other information you've defined elsewhere in {studio_name}. Do not edit policies unless you are familiar with both their purpose and syntax.
cy: Bydd unrhyw bolisïau a addesir gennych yma yn trechu pob gwybodaeth arall a roesoch rywle arall yn {studio_name}. Peidiwch â golygu'r polisïau hyn oni bai eich bod yn gyfarwydd â'u diben a'u cystrawen.

source: {em_start}Note:{em_end} When you enter strings as policy values, ensure that you use double quotation marks (") around the string. Do not use single quotation marks (').
cy: {em_start}Sylwer:{em_end} Wrth roi llinynnau fel gwerthoedd polisi, sicrhewch eich bod yn defnyddio dyfynodau dwbl (") o amgylch y llinyn. Peidiwch â defnyddio dyfynodau sengl (').

source: Grading Settings
cy: Gosodiadau graddio

source: Overall Grade Range
cy: Ystod graddau gyffredinol

source: Your overall grading scale for student final grades
cy: Eich graddfa raddio gyffredinol ar gyfer graddau terfynol myfyrwyr

source: Add grade
cy: Ychwanegu gradd

source: Credit Eligibility
cy: Cymhwyster i dderbyn credyd

source: Settings for course credit eligibility
cy: Gosodiadau cymhwyster ar gyfer derbyn credyd y cwrs

source: Minimum Credit-Eligible Grade:
cy: Gradd ofynnol i gymhwyso ar gyfer credyd:

source: Must be greater than or equal to the course passing grade
cy: Rhaid iddo fod yn fwy neu fod yn hafal i radd llwyddo'r cwrs

source: Grading Rules &amp; Policies
cy: Rheolau graddio &amp; Polisïau

source: Deadlines, requirements, and logistics around grading student work
cy: Dyddiadau cau, gofynion a logisteg ynghylch gwaith graddio myfyrwyr

source: Grace Period on Deadline:
cy: Cyfnod gras ar gyfer dyddiad cau:

source: Leeway on due dates
cy: Hyblygrwydd ar ddyddiadau cau

source: Assignment Types
cy: Mathau o aseiniadau

source: Categories and labels for any exercises that are gradable
cy: Categorïau a labeli ar gyfer unrhyw ymarferion y gellir eu graddio

source: New Assignment Type
cy: Math newydd o aseiniad

source: What can I do on this page?
cy: Beth gallaf ei wneud ar y dudalen hon?

source: You can use the slider under Overall Grade Range to specify whether your course is pass/fail or graded by letter, and to establish the thresholds for each grade.
cy: Gallwch ddefnyddio'r llithrwr o dan Ystod Graddau Cyffredinol i nodi a gaiff eich cwrs ei basio/methu neu ei raddio â llythyren, ac i osod trothwyon ar gyfer pob gradd.

source: You can specify whether your course offers students a grace period for late assignments.
cy: Gallwch nodi a yw eich cwrs yn cynnig hyblygrwydd i fyfyrwyr ar gyfer aseiniadau hwyr.

source: You can also create assignment types, such as homework, labs, quizzes, and exams, and specify how much of a student's grade each assignment type is worth.
cy: Gallwch hefyd greu mathau o aseiniadau, megis gwaith cartref, labordai, cwisiau ac arholiadau, a nodi gwerth pob math o aseiniad i radd y myfyriwr.

source: Expand or Collapse
cy: Ehangu neu gwympo

source: Visibility Settings
cy: Gosodiadau gwelededd

source: Visibility
cy: Gwelededd

source: This block contains multiple components.
cy: Mae'r bloc hwn yn cynnwys sawl cydran.

source: New Textbook
cy: Gwerslyfr newydd

source: Why should I break my textbook into chapters?
cy: Pam dylwn i dorri fy ngwerslyfr yn benodau?

source: Breaking your textbook into multiple chapters reduces loading times for students, especially those with slow Internet connections. Breaking up textbooks into chapters can also help students more easily find topic-based information.
cy: Mae rhannu eich gwerslyfr yn sawl pennod yn lleihau'r amser llwytho i fyfyrwyr, yn enwedig y rhai â chysylltiad rhyngrwyd araf. Gall torri gwerslyfrau i benodau hefyd yn gallu helpu myfyrwyr i ddod o hyd i wybodaeth bynciol yn haws.

source: What if my book isn't divided into chapters?
cy: Beth os nad yw fy llyfr wedi'i rannu'n benodau?

source: If your textbook doesn't have individual chapters, you can upload the entire text as a single chapter and enter a name of your choice in the Chapter Name field.
cy: Os nad oes gan eich gwerslyfr benodau unigol, gallwch lwytho testun cyfan i fyny fel un bennod a rhoi enw o'ch dewis arno yn y maes Enw'r Bennod.

source: Learn more about textbooks
cy: Dysgu mwy am werslyfrau

source: Video Uploads
cy: Fideos a lwythwyd i fyny

source: Why upload video files?
cy: Pam llwytho ffeiliau fideo i fyny?

source: For a video to play on different devices, it needs to be available in multiple formats. After you upload an original video file in {file_formats} format on this page, an automated process creates those additional formats and stores them for you.
cy: Er mwyn i fideo chwarae ar wahanol ddyfeisiau, mae angen iddo fod ar gael mewn sawl fformat. Wedi i chi lwytho ffeil fideo wreiddiol yn fformat {file_formats} i fyny i'r dudalen hon, bydd proses awtomataidd yn creu y fformatau ychwanegol hynny ac yn eu storio ar eich cyfer.

source: Maximum Video File Size
cy: Mwyafswm maint ffeil fideo

source: The maximum size for each video file that you upload is {em_start}5 GB{em_end}. The upload process fails for larger files.
cy: Y mwyafswm maint ar gyfer pob fideo y byddwch yn ei lwytho i fyny yw {em_start}5 GB{em_end}. Bydd y broses llwytho i fyny'n methu ar gyfer ffeiliau mwy.

source: Monitoring files as they upload
cy: Monitro ffeiliau wrth iddynt lwytho i fyny

source: Each video file that you upload needs to reach the video processing servers successfully before additional work can begin. You can monitor the progress of files as they upload, and try again if the upload fails.
cy: Bydd angen i bob ffeil fideo y byddwch yn ei lwytho i fyny gyrraedd y gweinyddion prosesu fideos yn llwyddiannus cyn gall gwaith ychwanegol ddechrau. Gallwch fonitro cynnydd ffeiliau wrth iddynt lwytho i fyny, a cheisio eto os yw'r llwytho i fyny'n methu.

source: Managing uploaded files
cy: Rheoli ffeiliau a lwythwyd i fyny

source: After a file uploads successfully, automated processing begins. The file is then listed under Previous Uploads as {em_start}In Progress{em_end}. You can add the video to your course as soon as it has a unique video ID and the status is {em_start}Ready{em_end}. Allow 24 hours for file processing at the external video hosting sites to complete.
cy: Wedi i ffeil lwytho i fyny'n llwyddiannus, mae'r prosesu awtomataidd yn dechrau. Yna caiff y ffeil ei rhestru o dan llwythiadau i fyny blaenorol fel {em_start}Ar waith{em_end}. Gallwch ychwanegu'r fideo i'ch cwrs cyn gynted ag y caiff rif adnabod fideo unigryw a'i statws yn {em_start}Barod{em_end}. Caniatewch 24 awr ar gyfer cwblhau prosesu ffeil ar safle lletya fideos allanol.

source: If something goes wrong, the {em_start}Failed{em_end} status message appears. Check for problems in your original file and upload a replacement.
cy: Os aiff rhywbeth o'i le, bydd y neges statws {em_start}Failed{em_end} yn ymddangos. Edrychwch am broblemau yn eich ffeil wreiddiol a llwytho un i fyny yn ei le.

source: How do I get the videos into my course?
cy: Sut mae rhoi'r fideos yn fy nghwrs?

source: When the status for a file is {em_start}Ready{em_end}, you can add that video to a component in your course. Copy the unique video ID. In another browser window, on the Course Outline page, create or locate a video component to play this video. Edit the video component to paste the ID into the Advanced {em_start}Video ID{em_end} field. The video can play in the LMS as soon as its status is {em_start}Ready{em_end}, although processing may not be complete for all encodings and all video hosting sites.
cy: Pan fydd statws ffeil yn {em_start}Barod{em_end}, gallwch ychwanegu'r fideo hwnnw i gydran yn eich cwrs. Copïwch rif adnabod unigryw y fideo. Mewn ffenestr porwr arall, ar dudalen Amlinelliad o'r cwrs, gallwch greu neu leoli cydran fideo i chwarae'n fideo yma. Golygwch y gydran fideo i roi'r rhif adnabod yn y maes {em_start}rhif adnabod y fideo{em_end} uwch. Gall y fideo chwarae yn y LMS cyn gynted ag y bo'i statws yn {em_start}Barod{em_end}, er efallai nad yw'r prosesu'n gyflawn ar gyfer pob amgodiad a phob safle lletya fideo.

source: Manage content groups
cy: Rheoli grwpiau cynnwys

source: Thank you for signing up for {studio_name}! To activate your account, please copy and paste this address into your web browser's address bar:
cy: Diolch am gofrestru ar gyfer {studio_name}! I ysgogi eich cyfrif, copïwch a gludwch y cyfeiriad hwn ar far cyfeiriad eich porwr gwe:

source: If you didn't request this, you don't need to do anything; you won't receive any more email from us. Please do not reply to this e-mail; if you require assistance, check the help section of the {studio_name} web site.
cy: Os na wnaethoch ofyn am hyn, nid oes rhaid i chi wneud unrhyw beth; ni fyddwch yn derbyn mwy o negeseuon e-bost gennym. Peidiwch ag ateb yr e-bost hwn; os oes angen cymorth arnoch, ewch i adran help gwefan {studio_name}.

source: Your account for {studio_name}
cy: Eich cyfrif ar gyfer {studio_name}

source: {email} has requested {studio_name} course creator privileges on edge
cy: Mae {email} wedi gofyn am {studio_name} freintiau lluniwr cwrs

source: User '{user}' with e-mail {email} has requested {studio_name} course creator privileges on edge.
cy: Mae'r defnyddiwr '{user}' gydag e-bost {email} wedi gofyn am freintiau lluniwr cwrs {studio_name}.

source: To grant or deny this request, use the course creator admin table.
cy: I ganiatáu neu wrthod y cais hwn, defnyddiwch fwrdd gweinyddu lluniwr y cwrs.

source: Your request for course creation rights to {studio_name} have been denied. If you believe this was in error, please contact {email}
cy: Mae eich cais am hawl i lunio cwrs gyda {studio_name} wedi cael ei wrthod. Os credwch mae camgymeriad yw hyn, cysylltwch â {email}

source: Your request for course creation rights to {studio_name} have been granted. To create your first course, visit {url}
cy: Mae eich cais am hawl i lunio cwrs gyda {studio_name} wedi cael ei gymeradwyo. I greu eich cwrs cyntaf, ewch i {url}

source: Your course creation rights to {studio_name} have been revoked. If you believe this was in error, please contact {email}
cy: Mae eich hawl i lunio cwrs gyda {studio_name} wedi cael ei ddileu. Os credwch mae camgymeriad yw hyn, cysylltwch â {email}

source: Your course creator status for {studio_name}
cy: Eich statws lluniwr cwrs ar gyfer {studio_name}

source: Required data to force publish course.
cy: Data gofynnol i orfodi cyhoeddi'r cwrs.

source: Reset values
cy: Ailosod gwerthoedd

source: Maintenance Dashboard
cy: Dangosfwrdd cynnal a chadw

source: We've sent an email message to {email} with instructions for activating your account.
cy: Rydym wedi anfon neges e-bost at {email} gyda chyfarwyddiadau ar gyfer ysgogi eich cyfrif.

source: EdX, Open edX, Studio, and the edX and Open edX logos are registered trademarks or trademarks of {link_start}edX Inc.{link_end}
cy: Mae EdX, Open edX, Studio a logos edX a Open EdX yn nodau masnachu cofrestredig neu'n nodau masnachu {link_start}edX Inc.{link_end}

source: Current Course:
cy: Cwrs cyfredol:

source: Course Navigation
cy: Llywio'r cwrs

source: Outline
cy: Amlinelliad

source: Updates
cy: Diweddariadau

source: Import
cy: Mewnforio

source: Export
cy: Allforio

source: Current Library:
cy: Llyfrgell cyfredol:

source: Language preference
cy: Dewis iaith

source: Account Navigation
cy: Llywio'r cyfrif

source: Contextual Online Help
cy: Help cyd-destunol ar-lein

source: Launch Latex Source Compiler
cy: Lansio casglwr ffynhonnell Latex

source: Heading
cy: Pennawd

source: Insert a heading
cy: Mewnosod pennawd

source: Add a multiple choice question
cy: Ychwanegu cwestiwn amlddewis

source: Add a question with checkboxes
cy: Ychwanegu cwestiwn gyda blychau gwirio

source: Insert a text response
cy: Mewnosod ymateb testun

source: Insert a numerical response
cy: Mewnosod ymateb rhifiadol

source: Insert a dropdown response
cy: Mewnosod ymateb cwymplen

source: Explanation
cy: Esboniad

source: Add an explanation for this question
cy: Ychwanegu esboniad ar gyfer y cwestiwn hwn

source: Advanced Editor
cy: Golygu uwch

source: Toggle Cheatsheet
cy: Toglo dalen twyllo

source: Access the Open edX Portal
cy: Hygyrchu Open edX Portal

source: Open edX Portal
cy: Agor edX Portal

source: name
cy: enw

source: Currently signed in as:
cy: Wedi mewngofnodi ar hyn o bryd fel:

source: Maintenance
cy: Cynnal a chadw

source: Initial title of the article. May be overridden with revision titles.
cy: Teitl cychwynnol yr erthygl. Gellir ei newid gyda theitlau adolygiadau.

source: Type in some contents
cy: Teipiwch gynnwys

source: This is just the initial contents of your article. After creating it, you can use more complex features like adding plugins, meta data, related articles etc...
cy: Dyma gynnwys cychwynnol eich erthygl yn unig. Ar ôl ei greu, gallwch ddefnyddio nodweddion mwy cymhleth fel ychwanegu ategion, meta data, erthyglau cysylltiedig ac ati...

source: Contents
cy: Cynnwys

source: Summary
cy: Crynodeb

source: Give a short reason for your edit, which will be stated in the revision log.
cy: Rhowch reswm byr dros olygu, a fydd yn cael ei nodi yn y cofnod adolygu.

source: While you were editing, someone else changed the revision. Your contents have been automatically merged with the new contents. Please review the text below.
cy: Wrth i chi olygu, gwnaeth rhywun arall newid yr adolygiad. Mae eich cynnwys wedi cael ei gyfuno'n awtomatig gyda'r cynnwys newydd. Adolygwch y testun isod.

source: No changes made. Nothing to save.
cy: Ni wnaed newidiadau. Dim i'w gadw.

source: Slug
cy: Slyg

source: This will be the address where your article can be found. Use only alphanumeric characters and - or _. Note that you cannot change the slug after creating the article.
cy: Dyma'r cyfeiriad lle gellir dod o hyd i'r erthygl. Defnyddiwch nodau/gymeriadau alffaniwmerig ac - neu _ yn unig. Sylwer na chewch chi newid y slyg ar ôl creu'r erthygl.

source: Write a brief message for the article's history log.
cy: Ysgrifennwch neges fer ar gyfer cofnod hanes yr erthygl.

source: A slug may not begin with an underscore.
cy: Ni chaiff slyg ddechrau gyda thanlinell.

source: A deleted article with slug "%s" already exists.
cy: Mae erthygl gyda slyg "%s" wedi'i dileu eisoes yn bodoli.

source: A slug named "%s" already exists.
cy: Mae slyg o'r enw "%s" eisoes yn bodoli.

source: Yes, I am sure
cy: Ydw, dwi'n siŵr

source: Purge
cy: Clirio

source: Purge the article: Completely remove it (and all its contents) with no undo. Purging is a good idea if you want to free the slug such that users can create new articles in its place.
cy: Clirio'r erthygl: Ei ddileu (a'i holl gynnwys) yn llwyr heb ddadwneud. Mae clirio yn syniad da os ydych am ryddhau'r slyg fel y gall defnyddwyr greu erthygl newydd yn ei lle.

source: You are not sure enough!
cy: Nid ydych yn gwbl siŵr!

source: While you tried to delete this article, it was modified. TAKE CARE!
cy: Wrth i chi geisio dileu'r erthygl hon, cafodd ei haddasu. GOFAL!

source: Lock article
cy: Cloi'r erthygl

source: Deny all users access to edit this article.
cy: Gwrthod caniatâd i olygu'r erthygl hon i bob defnyddiwr.

source: Permissions
cy: Caniatâd

source: Owner
cy: Perchennog

source: Enter the username of the owner.
cy: Rhowch enw defnyddiwr y perchennog.

source: (none)
cy: (dim)

source: Inherit permissions
cy: Etifeddu caniatadau

source: Check here to apply the above permissions recursively to articles under this one.
cy: Ticiwch yma i gymhwyso'r caniatadau uchod yn ailadroddus i erthyglau o dan hon.

source: Permission settings for the article were updated.
cy: Diweddarwyd gosodiadau caniatadau ar gyfer yr erthygl.

source: Your permission settings were unchanged, so nothing saved.
cy: Ni newidiwyd eich gosodiadau caniatadau, felly dim i'w gadw.

source: No user with that username
cy: Dim defnyddiwr gyda'r enw defnyddiwr hwnnw

source: Article locked for editing
cy: Erthygl wedi'i gloi i'w olygu

source: Article unlocked for editing
cy: Erthygl wedi'i datgloi i'w golygu

source: Settings for plugin
cy: Gosodiadau ar gyfer ategion

source: current revision
cy: adolygiad cyfredol

source: The revision being displayed for this article. If you need to do a roll-back, simply change the value of this field.
cy: Yr adolygiad a ddangosir ar gyfer yr erthygl hon. Os oes angen i chi ddad-wneud, newidiwch y gwerth yn y maes hwn.

source: modified
cy: addaswyd

source: Article properties last modified
cy: Addaswyd priodoleddau'r erthygl ddiwethaf

source: owner
cy: perchennog

source: The owner of the article, usually the creator. The owner always has both read and write access.
cy: Perchennog yr erthygl, fel arfer y lluniwr. Mae gan y perchennog fynediad darllen ac ysgrifennu o hyd.

source: group
cy: grŵp

source: Like in a UNIX file system, permissions can be given to a user according to group membership. Groups are handled through the Django auth system.
cy: Fel gyda system ffeil UNIX, gellir rhoi caniatadau i ddefnyddiwr yn ôl grŵp aelodaeth. Caiff y grwpiau eu trin drwy system Django auth.

source: group read access
cy: mynediad darllen grŵp

source: group write access
cy: mynediad ysgrifennu grŵp

source: others read access
cy: mynediad darllen eraill

source: others write access
cy: mynediad ysgrifennu eraill

source: Article without content (%(id)d)
cy: Erthygl heb gynnwys (%(id)d)

source: content type
cy: math o gynnwys

source: object ID
cy: rhif adnabod gwrthrych

source: Article for object
cy: Erthygl gwrthrych

source: Articles for object
cy: Erthyglau ar gyfer gwrthwynebu

source: revision number
cy: rhif adolygu

source: IP address
cy: cyfeiriad IP

source: user
cy: defnyddiwr

source: locked
cy: wedi'i gloi

source: article
cy: erthygl

source: article contents
cy: cynnwys yr erthygl

source: article title
cy: teitl yr erthygl

source: Each revision contains a title field that must be filled out, even if the title has not changed
cy: Mae pob adolygiad yn cynnwys maes teitl y mae'n rhaid ei gwblhau, hyd yn oed os nad yw'r teitl wedi newid

source: original article
cy: yr erthygl wreiddiol

source: Permissions are inherited from this article
cy: Caiff caniatadau eu hetifeddu o'r erthygl hon

source: A plugin was changed
cy: Newidiwyd ategyn

source: The revision being displayed for this plugin.If you need to do a roll-back, simply change the value of this field.
cy: Yr adolygiad a ddangosir ar gyfer yr ategyn hwn. Os oes angen i chi ddad-wneud, newidiwch y gwerth yn y maes hwn.

source: Cache lookup value for articles
cy: Gwerth edrych storfa (cache) ar gyfer erthyglau

source: slug
cy: slyg

source: (root)
cy: (gwreiddyn)

source: URL path
cy: llwybr URL

source: URL paths
cy: llwybrau URL

source: Sorry but you cannot have a root article with a slug.
cy: Mae'n flin gennym ond ni allwch gael erthygl wraidd gyda slyg.

source: A non-root note must always have a slug.
cy: Rhaid i nodyn nad yw'n wraidd gael slyg bob tro.

source: Articles who lost their parents =============================== The children of this article have had their parents deleted. You should probably find a new home for them.
cy: Erthyglau sydd wedi colli'r rhieni =============================== Mae rhieni plant yr erthygl hon wedi cael eu dileu. Dylech ddod o hyd i gartref newydd iddynt.

source: Lost and found
cy: Eitemau coll

source: A short summary of what the file contains
cy: Crynodeb fer o'r hyn mae'r ffeil yn ei gynnwys

source: Yes I am sure...
cy: Ydw, dwi'n siŵr...

source: Click to download file
cy: Cliciwch i lawrlwytho ffeil

source: The revision of this attachment currently in use (on all articles using the attachment)
cy: Adolygiad yr atodiad hwn a ddefnyddir ar hyn o bryd (ar bob erthygl sy'n defnyddio'r atodiad)

source: original filename
cy: enw gwreiddiol y ffeil

source: attachment
cy: atodiad

source: attachments
cy: atodiadau

source: file
cy: ffeil

source: attachment revision
cy: adolygiad yr atodiadau

source: attachment revisions
cy: adolygiadau'r atodiadau

source: Your file could not be saved: %s
cy: Nid oeddem yn gallu cadw eich ffeil: %s

source: Your file could not be saved, probably because of a permission error on the web server.
cy: Nid oeddem yn gallu cadw eich ffeil, mae'n debyg oherwydd gwall caniatadau ar weinydd y we.

source: Your new file will automatically be renamed to match the file already present. Files with different extensions are not allowed.
cy: Bydd eich ffeil newydd yn cael ei hailenwi'n awtomataidd i gyd-fynd â'r ffeil sydd yno eisoes. Ni chaniateir ffeiliau gydag estyniadau gwahanol.

source: Current revision changed for %s.
cy: Newidiwyd yr adolygiad cyfredol am %s.

source: Added a reference to "%(att)s" from "%(art)s".
cy: Ychwanegwyd cyfeiriad at "%(att)s" o "%(art)s".

source: A file was changed: %s
cy: Newidiwyd ffeil: %s

source: A file was deleted: %s
cy: Dilëwyd ffeil: %s

source: Are you sure?
cy: Ydych chi'n siŵr?

source: image
cy: delwedd

source: images
cy: delweddau

source: Image: %s
cy: Delwedd: %s

source: Current revision not set!!
cy: Nid yw'r adolygiad cyfredol wedi'i osod!!

source: image revision
cy: adolygiad delweddau

source: image revisions
cy: adolygiadau delweddau

source: Image Revsion: %d
cy: Adolygiad delweddau: %d

source: %(file)s has been saved.
cy: Mae %(file)s wedi cael ei gadw.

source: Images
cy: Delweddau

source: An image was added: %s
cy: Ychwanegwyd delwedd: %s

source: Links
cy: Dolenni

source: Notifications
cy: Hysbysiadau

source: When this article is edited
cy: Pan gaiff yr erthygl hon ei golygu

source: Also receive emails about article edits
cy: Derbyn negeseuon e-bost am olygiadau o erthyglau hefyd

source: Your notification settings were updated.
cy: Diweddarwyd eich gosodiadau hysbysu.

source: Your notification settings were unchanged, so nothing saved.
cy: Ni newidiwyd eich gosodiadau hysbysu, felly dim i'w gadw.

source: %(user)s subscribing to %(article)s (%(type)s)
cy: %(user) sy'n tanysgrifio i %(article)s (%(type)s)

source: Article deleted: %s
cy: Dilëwyd yr erthygl: %s

source: Article modified: %s
cy: Erthygl wedi'i addasu: %s

source: New article created: %s
cy: Crëwyd erthygl newydd: %s
