Repository: zhulinhai/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: cy

source: You are now sign up... and now you can sign in!
cy: Rydych nawr wedi mewngofnodi... a nawr gallwch fewngofnodi!

source: You are no longer logged in. Bye bye!
cy: Nid ydych wedi'ch mewngofnodi bellach. Hwyl fawr!

source: You are now logged in! Have fun!
cy: Rydych nawr wedi mewngofnodi! Mwynhewch!

source: New article '%s' created.
cy: Crëwyd erthygl '%s' newydd.

source: There was an error creating this article: %s
cy: Cafwyd gwall wrth greu'r erthygl hon: %s

source: There was an error creating this article.
cy: Cafwyd gwall wrth greu'r erthygl hon.

source: This article cannot be deleted because it has children or is a root article.
cy: Ni ellir dileu'r erthygl hon am fod ganddi blant neu erthygl wraidd.

source: This article together with all its contents are now completely gone! Thanks!
cy: Mae'r erthygl hon ynghyd â'i holl gynnwys bellach wedi mynd! Diolch!

source: The article "%s" is now marked as deleted! Thanks for keeping the site free from unwanted material!
cy: Mae'r erthygl "%s" bellach wedi'i marcio wedi'i dileu! Diolch am gadw'r wefan yn rhydd o ddeunydd dieisiau!

source: Your changes were saved.
cy: Mae eich newidiadau wedi cael eu cadw.

source: A new revision of the article was succesfully added.
cy: Ychwanegwyd diwygiad newydd o'r erthygl yn llwyddiannus.

source: Restoring article
cy: Adfer erthygl

source: The article "%s" and its children are now restored.
cy: Mae'r erthygl "%s" a'i blant bellach wedi'u hadfer.

source: The article %(title)s is now set to display revision #%(revision_number)d
cy: Mae'r erthygl %(title)s bellach wedi'i gosod i ddangos adolygiad #%(revision_number)d

source: New title
cy: Teitl newydd

source: Merge between Revision #%(r1)d and Revision #%(r2)d
cy: Cyfuno rhwng Adolygiad #%(r1)d ac Adolygiad #%(r2)d

source: A new revision was created: Merge between Revision #%(r1)d and Revision #%(r2)d
cy: Crëwyd diwygiad newydd: Cyfuno rhwng Adolygiad #%(r1)d ac Adolygiad #%(r2)d

source: Showing {firstIndex}-{lastIndex} out of {numItems} total
cy: Dangos {firstIndex}-{lastIndex} o gyfanswm o {numItems}

source: Info on course outline page - top right corner (see pic)
cy: Tudalen wybodaeth amlinelliad y cwrs - cornel dde uchaf (gweler llun)

source: Important Course Dates
cy: Dyddiadau pwysig y cwrs

source: Today is {date}
cy: Heddiw yw {date}

source: This website uses cookies to ensure you get the best experience on our website. If you continue browsing this site, we understand that you accept the use of cookies.
cy: Mae'r wefan hon yn defnyddio cwcis i sicrhau eich bod yn cael y profiad gorau ar ein gwefan. Os ydych chi'n parhau i bori'r wefan hon, rydym yn deall eich bod chi'n derbyn y defnydd o gwcis.

source: First time here? Create an Account.
cy: Y tro cyntaf yma? Creu cyfrif.

source: SIGN IN
cy: Mewngofnodi

source: New score for problem, out of the total points available for the problem
cy: Sgôr newydd am broblem, allan o'r cyfanswm pwyntiau sydd ar gael ar gyfer y broblem

source: Upload a comma separated values (.csv) file that contains the usernames or email addresses of learners who have been given exceptions. Include the username or email address in the first comma separated field. You can include an optional note describing the reason for the exception in the second comma separated field.
cy: Llwythwch ffeil gwerthoedd gwahanu coma (.csv) sy'n cynnwys enwau defnyddwyr neu gyfeiriadau e-bost dysgwyr sydd wedi derbyn eithriadau. Cynnwys yr enw defnyddiwr neu gyfeiriad e-bost yn y maes gwahanu coma cyntaf. Gallwch gynnwys nodyn dewisol sy'n disgrifio'r rheswm dros yr eithriad yn yr ail faes gwahanu coma.

source: All users on the Exception list who do not yet have a certificate
cy: Pob defnyddiwr ar y rhestr Eithriadol nad oes ganddynt dystysgrif eto

source: GENERATE EXCEPTION CERTIFICATES
cy: GENERI'R TYSTYSGRIFAU EITHRIO

source: For general questions related to a course, see the Course Support tab within that course.
cy: Am gwestiynau cyffredinol sy'n gysylltiedig â chwrs, gweler y tab Cefnogaeth Cwrs o fewn y cwrs hwnnw.

source: For technical questions, contact the support team directly below:
cy: Am gwestiynau technegol, cysylltwch â'r tîm cefnogi yn uniongyrchol isod:

source: You must consent to data sharing to register.
cy: Rhaid i chi gytuno i rannu data er mwyn cofrestru.

source: Before you sign in, you need to activate your account. We have sent you an email message with instructions for activating your account.
cy: Cyn i chi fewngofnodi, mae angen i chi ysgogi eich cyfrif. Rydym wedi anfon neges e-bost atoch gyda chyfarwyddiadau ar gyfer ysgogi eich cyfrif.

source: I agree to allow {platform_name} to share data about my enrollment, completion and performance in all {platform_name} courses and programs where my enrollment is sponsored by {ec_name}.
cy: Rwy'n cytuno i ganiatáu i {platform_name} rannu data am fy nghofrestriad, fy nghyflawniad a fy mherfformiad ym mhob cwrs a rhaglen {platform_name} lle caiff fy nghofrestriad ei noddi gan {ec_name}.

source: To link your account with {ec_name}, you are required to consent to data sharing.
cy: I gysylltu eich cyfrif gyda {ec_name}, mae angen i chi gytuno i rannu data.

source: You may not use variables ({bad_variables}) in numerical problems.
cy: Ni chewch ddefnyddio newidynnau ({bad_variables}) gyda phroblemau rhifiadol.

source: Invalid input: {bad_input} not permitted in answer.
cy: Mewnbwn annilys: Ni chaniateir {bad_input} yn yr ateb.

source: Error: {msg}
cy: Gwall: {msg}

source: Invalid checkpoint location
cy: Lleoliad man gwirio annilys

source: API Version
cy: Fersiwn yr API

source: Path to authoring app's JS
cy: Llwybr i awduro app JS

source: This value is required in order to enable the Studio authoring interface.
cy: Mae'r gwerth hwn yn ofynnol er mwyn galluogi rhyngwyneb awduro Studio.

source: Path to authoring app's CSS
cy: Llwybr i awduro app CSS

source: Enable Student Dashboard Displays
cy: Galluogi arddangos dangosfwrdd myfyriwr

source: Enable Studio Authoring Interface
cy: Galluogi rhyngwyneb awduro Studio

source: Enable Program Certificate Generation
cy: Galluogi cynhyrchu tystysgrif rhaglen

source: Maximum Certification Retries
cy: Mwyafswm ailgeisiadau ardystio.

source: When making requests to award certificates, make at most this many attempts to retry a failing request.
cy: Wrth wneud ceisiadau i ddyfarnu tystysgrifau, peidiwch â cheisio ail-wneud cais mwy na hyn o weithiau.

source: Do we want to show xseries program advertising
cy: A ydym am ddangos hysbysebion rhaglenni xseries

source: Do we want to show program listing page
cy: A ydym am ddangos tudalen restru rhaglenni

source: Do we want to show program details pages
cy: A ydym am ddangos tudalen manylion rhaglenni

source: Click to remove
cy: Cliciwch i ddileu

source: Click to add
cy: Cliciwch i ychwanegu

source: Submit your answer
cy: Cyflwyno eich ateb

source: I'm learning on {platform_name}:
cy: Rwy'n dysgu ar {platform_name}:

source: Thank you for creating an account with {platform_name}!
cy: Diolch am greu cyfrif gyda {platform_name}!

source: If you didn't create an account, you don't need to do anything; you won't receive any more email from us. If you need assistance, please do not reply to this email message. Check the help section of the {platform_name} website.
cy: Os na wnaethoch greu cyfrif, nid oes rhaid i chi wneud unrhyw beth; ni fyddwch yn derbyn mwy o negeseuon e-bost gennym. Os oes angen cymorth arnoch, peidiwch ag ateb y neges e-bost hon. Cliciwch ar adran help y wefan {platform_name}.

source: No content groups exist
cy: Dim grŵp cynnwys yn bodoli

source: Use content groups to give groups of students access to a specific set of course content. Create one or more content groups, and make specific components visible to them.
cy: Defnyddiwch grwpiau cynnwys i roi mynediad i grwpiau o fyfyrwyr i ddarnau penodol o gynnwys y cwrs. Crëwch un neu fwy o grwpiau cynnwys, a gwneud cydrannau penodol yn weladwy iddynt.

source: Specific Content Groups
cy: Grwpiau cynnwys penodol

source: Deleted Content Group
cy: Grŵp cynnwys wedi'i ddileu

source: Verification Checkpoint
cy: Man gwirio

source: Verification checkpoint to complete
cy: Man gwirio i'w gyflawni

source: Learners who require verification must pass the selected checkpoint to see the content in this component. Learners who do not require verification see this content by default.
cy: Rhaid i'r dysgwyr y mae angen gwiriad arnynt basio'r pwynt gwirio a ddetholwyd i weld cynnwys y gydran hon. Mae dysgwyr nad oes angen gwiriad arnynt yn gweld y cynnwys hwn yn ddiofyn.

source: Filter...
cy: Hidlydd...

source: Cookie Policy
cy: Polisi Cwci

source: Enter your full name. This name will be used on any certificates that you earn.
cy: Rhowch eich enw llawn. Bydd yr enw hwn yn cael ei ddefnyddio ar unrhyw dystysgrifau rydych chi'n eu ennill.

source: Already have an {platform_name} account?
cy: Oes gennych gyfrif {platform_name} eisoes?

source: Enter a valid email address that contains at least 3 characters.
cy: Rhowch gyfeiriad e-bost dilys sy'n cynnwys o leiaf 3 nod.

source: Enter a valid email address that contains at least 3 characters. This is what you will use to login
cy: Rhowch gyfeiriad e-bost dilys sy'n cynnwys o leiaf 3 nod. Dyma beth fyddwch chi'n ei ddefnyddio i fewngofnodi.

source: Enter a valid email address that contains at least {min} characters.
cy: Rhowch gyfeiriad e-bost dilys sy'n cynnwys o leiaf {min} nod.

source: Create an Account
cy: Creu cyfrif

source: This is what you will use to login.
cy: Dyma beth fyddwch chi'n ei ddefnyddio i fewngofnodi.

source: Username must be between {min} and {max} characters long.
cy: Rhaid i'r enw defnyddiwr fod rhwng {min} a {max} cymeriadau yn hir

source: Username must be between {min} and {max} characters long. The name that will identify you in your courses. It cannot be changed later
cy: Rhaid i'r enw defnyddiwr fod rhwng {min} a {max} cymeriadau yn hir Yr enw a fydd yn nodi pwy ydych chi yn eich cyrsiau ni ellir ei newid yn ddiweddarach

source: The name that will identify you in your courses. It cannot be changed later.
cy: Yr enw a fydd yn eich adnabod yn eich cyrsiau. Ni ellir ei newid yn nes ymlaen.

source: Enter a password.
cy: Rhowch gyfrinair.

source: Score Override
cy: sgôr diweddaru

source: Build out your profile to personalize your identity on {platform_name}.
cy: Adeiladu eich proffil i bersonoli'ch hunaniaeth ar {platform_name}

source: You haven't earned any certificates yet.
cy: Nid ydych chi wedi ennill unrhyw dystysgrifau eto.

source: Create Account
cy: Creu cyfrif

source: Welcome to {course_display_name}
cy: Croeso i {course_display_name}

source: Country or Region of Residence (required)!
cy: Gwlad neu Ranbarth Preswyl (gofynnol)!

source: Select your country or region of residence.
cy: Dewiswch eich gwlad neu ranbarth preswylio.

source: Country or Region of Residence
cy: Gwlad neu Ranbarth Preswyl

source: The country or region where you live.
cy: Y wlad neu'r rhanbarth lle rydych chi'n byw.

source: Select your country or region of residence. The country or region where you live.
cy: Dewiswch eich gwlad neu ranbarth preswylio. Y wlad neu'r rhanbarth lle rydych chi'n byw.

source: Or explore other courses
cy: Neu archwilio ar gyrsiau eraill

source: Access courses on the go
cy: cyrsiau Mynediad ar y ewch

source: Download the app and access your courses wherever you are. Sync videos to your device and watch offline, at a time that suits you.
cy: Lawrlwythwch yr app a mynediad eich cyrsiau lle bynnag yr ydych. Sync fideos i'ch dyfais a gwyliwch nhw all-lein, ar amser sy'n addas i chi

source: Learn online with CITB apprenticeships!
cy: Dysgwch-lein gyda phrentisiaethau CITB!

source: Stand out from the crowd - build your skills for a career in construction.
cy: Sefyll allan oddi wrth y dorf - adeiladu eich sgiliau ar gyfer gyrfa yn y diwydiant adeiladu.
