Repository: zhulinhai/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: cy

source: Welcome to {platform_name}. Thank you for using {platform_name}'s Course Discovery API and any additional APIs that we may offer from time to time (collectively, the "APIs"). Please read these Terms of Service prior to accessing or using the APIs. These Terms of Service, any additional terms within accompanying API documentation, and any applicable policies and guidelines that {platform_name} makes available and/or updates from time to time are agreements (collectively, the "Terms") between you and {platform_name}. By accessing or using the APIs, you accept and agree to be legally bound by the Terms, whether or not you are a registered user. If you do not understand or do not wish to be bound by the Terms, you should not use the APIs.
cy: Croeso i {platform_name}. Diolch am ddefnyddio Course Discovery API {platform_name} ac unrhyw API ychwanegol mae'n bosib y byddwn yn eu cynnig o bryd i'w gilydd (gyda'i gilydd, yr "API"). Darllenwch y telerau gwasanaeth hyn cyn agor neu ddefnyddio'r API. Mae'r Telerau Gwasanaeth hyn, ac unrhyw delerau ychwanegol o fewn dogfennaeth API gysylltiol, ac unrhyw bolisïau a chanllawiau cymwys sydd ar gael a/neu a ddiweddarir gan {platform_name} o bryd i'w gilydd yn gytundebau (ar y cyd, y "Telerau") rhyngoch chi a {platform_name}. Trwy agor neu ddefnyddio'r API, rydych yn derbyn ac yn cytuno i fod yn gyfreithiol-rwym i'r Telerau, ni waeth a ydych yn ddefnyddiwr cofrestredig ai peidio. Os nad ydych yn deall neu ddim am fod yn rhwym i'r Telerau, ni ddylech ddefnyddio'r API.

source: API Access
cy: Mynediad i API

source: To access the APIs, you will need to create an {platform_name} user account for your application (not for personal use). This account will provide you with access to our API request page at {request_url}. On that page, you must complete the API request form including a description of your proposed uses for the APIs. Any account and registration information that you provide to {platform_name} must be accurate and up to date, and you agree to inform us promptly of any changes. {platform_name} will review your API request form and, upon approval in {platform_name}'s sole discretion, will provide you with instructions for obtaining your API shared secret and client ID.
cy: I weld yr API, bydd angen i chi greu cyfrif defnyddiwr {platform_name} ar gyfer eich app (nid at ddefnydd personol). Bydd y cyfrif hwn yn rhoi mynediad i chi i'n tudalen cais API yn {request_url}. Ar y dudalen honno, rhaid i chi gwblhau ffurflen gais yr API gan gynnwys disgrifio sut y bwriadwch ddefnyddio'r API. Rhaid i unrhyw wybodaeth cyfrif a chofrestru a rowch i {platform_name} fod yn gywir ac yn ddiweddar, a chytunwch i'n hysbysu ar unwaith am unrhyw newidiadau. Bydd {platform_name} yn adolygu eich ffurflen gais API ac, wedi derbyn cymeradwyaeth fel y mynn {platform_name}, yn rhoi cyfarwyddiadau i chi ar gyfer cael cyfrinach API a rennir a'ch rhif adnabod cleient.

source: Permissible Use
cy: Defnydd a ganiateir

source: You agree to use the APIs solely for the purpose of delivering content that is accessed through the APIs (the "API Content") to your own website, mobile site, app, blog, email distribution list, or social media property or for another commercial use that you described in your request for access and that {platform_name} has approved on a case-by-case basis. {platform_name} may monitor your use of the APIs for compliance with the Terms and may deny your access or shut down your integration if you try to go around or exceed the requirements and limitations set by {platform_name}. Your Application or other approved use of the API or the API Content must not prompt your end users to provide their {platform_name} username, password or other {platform_name} user credentials anywhere other than the {platform_name} website at {platform_url}.
cy: Rydych yn cytuno i ddefnyddio'r API yn unig at ddiben cyflwyno cynnwys a geir mynediad iddo drwy yr API ("Cynnwys API") i'ch gwefan chi, safle symudol, app, blog, restr ddosbarthu e-bost, neu eiddo cyfrwng cymdeithasol neu at ddiben masnachol arall y gwnaethoch ei ddisgrifio yn eich cais am fynediad ac mae {platform_name} wedi'i gymeradwyo fesul cais unigol. Gall{platform_name} fonitro eich defnydd o'r API er cydymffurfiaeth â'r telerau a gall wrthod mynediad neu gaw eich integreiddiad i lawr os ceisiwch osgoi neu ragori ar y gofynion a'r cyfyngiadau a osodwyd gan {platform_name}. Ni chaiff eich cymhwysiad neu ddefnydd cymeradwy arall o'r API neu Gynnwys APU achosi i'ch defnyddwyr roi eu henwau defnyddiwr {platform_name}, eu cyfrineiriau neu eu cymwysterau defnyddiwr {platform_name} eraill unrhyw le heblaw am ar wefan {platform_name} yn {platform_url}.

source: Prohibited Uses and Activities
cy: Defnydd a gweithgarwch a waherddir

source: {platform_name} shall have the sole right to determine whether or not any given use of the APIs is acceptable, and {platform_name} reserves the right to revoke API access for any use that {platform_name} determines at any time, in its sole discretion, does not benefit or serve the best interests of {platform_name}, its users and its partners.
cy: Bydd gan {platform_name} yr hawl cyfan gwbl i bennu a yw unrhyw ddefnydd o'r API yn dderbyniol ai peidio, ac mae {platform_name} yn cadw'r hawl i atal mynediad i API at unrhyw ddefnydd mae {platform_name} yn ei bennu ar unrhyw adeg, y cred yn ei ddisgresiwn cyfan, nad yw o fudd neu er budd gorau {platform_name}, ei ddefnyddwyr a'i bartneriaid.

source: The following activities are not acceptable when using the APIs (this is not an exhaustive list):
cy: Nid yw'r gweithgareddau hyn yn dderbyniol wrth ddefnyddio'r API (nid yw'r rhestr gynhwysfawr):

source: collecting or storing the names, passwords, or other credentials of {platform_name} users;
cy: casglu neu storio enwau, cyfrineiriau neu gymwysterau eraill defnyddwyr {platform_name};

source: scraping or similar techniques to aggregate or otherwise create permanent copies of API Content;
cy: crafu neu dechnegau tebyg i gydgasglu neu fel arall greu copïau parhaol o Gynnwys APi;

source: violating, misappropriating or infringing any copyright, trademark rights, rights of privacy or publicity, confidential information or any other right of any third party;
cy: herio, camddefnyddio neu dorri unrhyw hawlfraint, hawliau nodau masnachu, hawliau preifatrwydd neu gyhoeddusrwydd, gwybodaeth gyfrinachol neu unrhyw hawl arall unrhyw drydydd parti;

source: altering or removing any trademark, copyright or other proprietary or legal notices contained in, or appearing on, the APIs or any API Content;
cy: addasu neu ddileu unrhyw nod masnachu, hawlfraint neu hysbysiad perchnogol neu gyfreithiol arall a gynhwysir yn, neu sy'n ymddangos ar yr API neu unrhyw gynnwys API;

source: altering or editing any content or graphics in the API Content
cy: addasu neu olygu unrhyw gynnwys neu raffeg yn nghynnwys yr API

source: sublicensing, re-distributing, renting, selling or leasing access to the APIs or your client secret to any third party;
cy: is-drwyddedu, ailddosbarthu, rhentu, gwerthu neu lesio mynediad i'r API neu gyfrinach eich cleient i unrhyw drydydd parti;

source: distributing any virus, Trojan horse, spyware, adware, malware, bot, time bomb, worm, or other harmful or malicious component; or
cy: dosbarthu unrhyw feirws, ceffyl Troea, ysbïwedd, hysbyswedd, drwgwedd, bot, bom amser, mwydyn neu gydran niweidiol neu faleisus arall; neu

source: using the APIs for any purpose which or might overburden, impair or disrupt the {platform_name} platform, servers or networks.
cy: ddefnyddio'r API at unrhyw ddiben a fyddai neu a allai orlwytho, amharu neu darfu ar blatfform, gweinyddion neu rhwydweithiau {platform_name}.

source: Usage and Quotas
cy: Defnydd a chwotâu

source: {platform_name} reserves the right, in its discretion, to impose restrictions and limitations on the number and frequency of calls made by you or your Application to the APIs. You must not attempt to circumvent any restrictions or limitations that we impose.
cy: Mae {platform_name} yn cadw'r hawl, yn ôl ei ddisgresiwn, i osod cyfyngiadau ar nifer ac amlder y galwadau a wneir gennych chi neu'ch app i'r API. Ni ddylech geisio osgoi unrhyw gyfyngiadau a osodwn.

source: Compliance
cy: Cydymffurfiad

source: You agree to comply with all applicable law, regulation, and third party rights (including without limitation laws regarding the import or export of data or software, privacy, copyright, and local laws). You will not use the APIs to encourage or promote illegal activity or violation of third party rights. You will not violate any other terms of service with {platform_name}. You will only access (or attempt to access) an API by the means described in the documentation of that API. You will not misrepresent or mask either your identity or yourApplication's identity when using the APIs.
cy: Rydych yn cytuno i gydymffurfio â'r holl gyfraith, rheoliadau a hawliau trydydd parti (gan gynnwys ond heb fod yn gyfyngedig i gyfreithiau ynghylch mewnforio neu allforio data neu feddalwedd, preifatrwydd, hawlfraint a chyfreithiau lleol) sy'n gymwys. Ni chewch ddefnyddio'r API i annog na hybu gweithgarwch anghyfreithlon na thorri hawliau trydydd parti. Ni chewch dorri unrhyw delerau gwasanaeth eraill gyda {platform_name}. Byddwch yn defnyddio (ac yn ceisio defnyddio) API yn ôl y dulliau a ddisgrifiwyd yn nogfennaeth yr API hwnnw yn unig. Ni chewch wyrdroi na chuddio pwy ydych chi na'ch app wrth ddefnyddio'r API.

source: Ownership
cy: Perchnogaeth

source: You acknowledge and agree that the APIs and all API Content contain valuable intellectual property of {platform_name} and its partners. The APIs and all API Content are protected by United States and foreign copyright, trademark, and other laws. All rights in the APIs and the API Content, if not expressly granted, are reserved. By using the APIs or any API Content, you do not acquire ownership of any rights in the APIs or API Content. You must not claim or attempt to claim ownership in the APIs or any API Content or misrepresent yourself or your company or your Application as being the source of any API Content. You may not modify, create derivative works of, or attempt to use, license, or in any way exploit any API Content in whole or in part on your own behalf or on behalf of any third party. You may not distribute or modify the APIs or any API Content (including adaptation, editing, excerpting, or creating derivative works).
cy: Rydych yn cydnabod ac yn cytuno bod yr API a holl Gynnwys API yn cynnwys eiddo deallusol gwerthfawr {platform_name} a'i bartneriaid. Mae'r API a holl gynnwys yr API yn cael eu diogelu gan yr Unol Daleithiau a hawlfraint tramor, nodau masnachu a chyfreithiau eraill. Cedwir pob hawl yr API a chynnwys API, os na roddir fel arall yn ffurfiol. Trwy ddefnyddio API neu unrhyw Gynnwys API, nid ydych yn derbyn perchnogaeth o unrhyw hawliau yn API a Cynnwys API. Ni ddylech hawlio na cheisio hawlio perchnogaeth o'r API nac unrhyw Gynnwys API na gwyrdroi pwy ydych chi neu'ch cwmni neu eich app i fod yn ffynhonnell unrhyw Gynnwys API. Ni chewch addasu, creu gwaith deilliadol o, neu geisio defnyddio, trwyddedu, neu mewn unrhyw fodd gamddefnyddio Cynnwys API yn gyfan neu'n rhannol er eich mwyn eich hun neu ar ran unrhyw drydydd parti. Ni chewch ddosbarthu nac addasu'r API neu unrhyw Gynnwys API (gan gynnwys addasu, golygu, dyfynnu, neu greu gwaith deilliannol).

source: All names, logos and seals ("Trademarks") that appear in the APIs, API Content, or on or through the services made available on or through the APIs, if any, are the property of their respective owners. You may not remove, alter, or obscure any copyright, Trademark, or other proprietary rightrs notices incorporated in or accompanying the API Content. If any third party revokes access to API Content owned or controlled by that third party, including without limitation any Trademarks, you must ensure that all API Content pertaining to that third party is deleted from your app, networks, systems and servers as soon as reasonably possible. If you stop using the APIs altogether or if your API access is revoked, you must delete all API Content in the same way.
cy: Mae'r holl enwau, logos a seliau (nodau masnachu) sy'n ymddangos yn yr API, cynnwys API, ar neu drwy'r gwasanaethau sydd ar gael ar neu drwy'r API, os o gwbl, yn eiddo i'w perchnogion. Ni chewch ddileu, addasu na chuddio hawlfraint, nod masnachu nac unrhyw hysbysiadau o hawliau perchnogol eraill sydd yw cael neu sy'n cyd-fynd â Chynnwys API. Os bydd unrhyw drydydd parti yn dileu mynediad i Gynnwys API sy'n eiddo i'r trydydd parti hwnnw, neu a gaiff ei reoli ganddo, gan gynnwys, heb fod yn gyfyngedig i, unrhyw nodau masnachu, rhaid i chi sicrhau bod yr holl Gynnwys API ynghylch y trydydd parti hwnnw yn cael ei ddileu o'ch app, rhwydweithiau, systemau a gweinyddion cyn gynted ag sy'n rhesymol bosibl. Os byddwch yn gorffen defnyddio'r API yn llwyr neu os gaiff eich mynediad API ei dynnu'n ôl, rhaid i chi ddileu pob API Cynnwys yn yr un modd.

source: To the extent that you submit any content to {platform_name} in connection with your use of the APIs or any API Content, you hereby grant to {platform_name} a worldwide, non-exclusive, transferable, assignable, sub licensable, fully paid-up, royalty-free, perpetual, irrevocable right and license to host, transfer, display, perform, reproduce, modify, distribute, re-distribute, relicense and otherwise use, make available and exploit such content, in whole or in part, in any form and in any media formats and through any media channels (now known or hereafter developed).
cy: I'r graddau y gallwch gyflwyno unrhyw gynnwys i {platform_name} yn gysylltiedig â'ch defnydd o'r API neu Gynnwys API, rydych trwy hyn yn rhoi i {platform_name} hawl a thrwydded diwrthod byd-eang, heb fod yn neilltuedig, trosglwyddadwy, aseiniadwy, y gellir eu is-drwyddedu, wedi'u talu'n llwyr, heb freindaliadau, a pharhaol i gynnal, trosglwyddo, arddangos, perfformio, ail-greu, addasu, dosbarthu, ailddosbarthu, aildrwyddedu ac fel arall ddefnyddio, gwneud ar gael a manteisio'r fath gynnwys, yn gyfan neu'n rhannol, ar unrhyw ffurf ac unrhyw fformat cyfryngau a thrwy unrhyw sianeli cyfryngau (y gwyddys amdanynt nawr neu a ddatblygir o hyn ymlaen).

source: Privacy
cy: Preifatrwydd

source: You agree to comply with all applicable privacy laws and regulations and to be transparent with respect to any collection and use of end user data. You will provide and adhere to a privacy policy for your Application that clearly and accurately describes to your end users what user information you collect and how you may use and share such information (including for advertising) with {platform_name} and other third parties.
cy: Rydych yn cytuno i gydymffurfio â phob cyfraith a rheoliad preifatrwydd perthnasol ac i fod yn agored ynghylch casglu unrhyw ddata defnyddiwr a'r defnydd ohono. Byddwch yn darparu polisi preifatrwydd, ac yn glynu ato, ar gyfer eich app sy'n disgrifio'n glir ac yn gywir i'ch defnyddwyr pa wybodaeth defnyddwyr a gasglwch a sut gallwch ddefnyddio a rhannu'r fath wybodaeth (gan gynnwys hysbysebu) gyda {platform_name} a thrydydd partïon eraill.

source: Right to Charge
cy: Hawl i godi tâl

source: {platform_name} reserves the right to modify the Terms at any time without advance notice. Any changes to the Terms will be effective immediately upon posting on this page, with an updated effective date. By accessing or using the APIs after any changes have been made, you signify your agreement on a prospective basis to the modified Terms and all of the changes. Be sure to return to this page periodically to ensure familiarity with the most current version of the Terms.
cy: Mae {platform_name} yn cadw'r hawl i addasu'r telerau ar unrhyw adeg heb ragrybudd. Bydd unrhyw newidiadau i'r telerau yn dod i rym yn syth ar ôl postio ar y dudalen hon, gyda dyddiad gweithredol wedi'i ddiweddaru. Trwy agor neu ddefnyddio'r API wedi i unrhyw newidiadau gael eu gwneud, rydych yn dynodi eich bod yn cytuno ymlaen llaw i'r telerau a addaswyd a'r holl newidiadau. Sicrhewch eich bod yn dychwelyd i'r dudalen hon o bryd i'w gilydd i sicrhau eich bod yn gyfarwydd â fersiwn ddiweddaraf y telerau.

source: {platform_name} may also update or modify the APIs from time to time without advance notice. These changes may affect your use of the APIs or the way your integration interacts with the API. If we make a change that is unacceptable to you, you should stop using the APIs. Continued use of the APIs means you accept the change.
cy: Gall {platform_name} hefyd ddiweddaru neu addasu'r API o bryd i'w gilydd heb rybudd ymlaen llaw. Gall y newidiadau hyn effeithio ar eich defnydd o'r API neu'r modd mae eich integreiddiad yn ymwneud â'r API. Os gwnawn newid sy'n annerbyniol i chi, dylech roi'r gorau i ddefnyddio'r API. Trwy barhau i ddefnyddio'r API rydych yn derbyn y newid.

source: Confidentiality
cy: Cyfrinachedd

source: Your credentials (such as client secret and IDs) are intended to be used solely by you. You will keep your credentials confidential and discourage others from using your credentials. Your credentials may not be embedded in open source projects.
cy: Bwriedir i'ch cymwysterau (megis cleient cyfrinachol a rhifau adnabod) gael eu defnyddio yn unig gennych chi. Byddwch yn cadw'ch cymwysterau yn gyfrinachol ac yn annog eraill i beidio â defnyddio'ch cymwysterau. Mae'n bosib na fyddai eich cymwysterau'n cael eu plannu mewn prosiectau ffynhonnell agored.

source: In the event that {platform_name} provides you with access to information specific to {platform_name} and/or the APIs that is either marked as "Confidential" or which a reasonable person would assume to be confidential or proprietary given the terms of its disclosure ("Confidential Information"), you agree to use this information only to use and build with the APIs. You may not disclose the Confidential Information to anyone without {platform_name}'s prior written consent, and you agree to protect the Confidential Information from unauthorized use and disclosure in the same way that you would protect your own confidential information. Confidential information does not include information that you independently developed, that was rightfully given to you by a third party without confidentiality obligation, or that becomes public through no fault of your own. You may disclose Confidential Information when compelled to do so by law if you provide {platform_name} with reasonable prior notice, unless a court orders that {platform_name} not receive notice.
cy: Os bydd {platform_name} yn rhoi mynediad i chi i wybodaeth benodol i {platform_name} a/neu'r API sydd naill ai wedi'i nodi yn "Gyfrinachol" neu wybodaeth y byddai person rhesymol yn ei dybio'n gyfrinachol neu'n berchnogol o ystyried telerau ei datgelu ("Gwybodaeth Gyfrinachol"), rydych yn cytuno i ddefnyddio'r wybodaeth hon yn unig i'w defnyddio ac adeiladu gyda API. Ni chewch ddatgleu'r wybodaeth gyfrinachol i unrhyw un heb ganiatâd ysgrifenedig {platform_name} ymlaen llaw, ac rydych yn cytuno i ddiogelu'r wybodaeth gyfrinachol rhag defnydd anawdurdodedig a datgelu yn yr un modd y byddech yn diogelu eich gwybodaeth gyfrinachol eich hun. Nid yw gwybodaeth gyfrinachol yn cynnwys gwybodaeth y gwnaethoch ei datblygu'n annibynnol, a roddwyd yn gyfreithlon i chi gan drydydd parti heb reidrwydd cyfrinachedd, neu sy'n dod yn gyhoeddus heb unrhyw fai arnoch chi. Gallwch ddatgelu gwybodaeth gyfrinachol pan y'ch cymhellir i wneud hynny gan gyfraith os ydych yn darparu rhybudd rhesymol ymlaen llaw i {platform_name}, heblaw bod llys yn gorchymyn y {platform_name} i beidio â derbyn rhybudd.

source: Disclaimer of Warranty / Limitation of Liabilities
cy: Ymwadiad warantî / Cyfyngiad atebolrwydd

source: THE APIS AND ANY INFORMATION, API CONTENT OR SERVICES MADE AVAILABLE ON OR THROUGH THE APIS ARE PROVIDED "AS IS" AND "AS AVAILABLE" WITHOUT WARRANTY OF ANY KIND (EXPRESS, IMPLIED OR OTHERWISE), INCLUDING, WITHOUT LIMITATION, ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT, EXCEPT INSOFAR AS ANY SUCH IMPLIED WARRANTIES MAY NOT BE DISCLAIMED UNDER APPLICABLE LAW.
cy: MAE'R API AC UNRHYW WYBODAETH, CYNNWYS API NEU WASANAETHAU A WNAED AR GAEL AR BEU DRWY YR API YN CAEL EU DARPARU "FEL Y MAENT" AC "AR GAEL" HEB WARANT O UNRHYW FATH (PENDANT, DEALLEDIG NEU FEL ARALL), GAN GYNNWYS, HEB FOD YN GYFYNGEDIG I UNRHYW WARANTAU DEALLEDIG MARCHNADWYEDD, ADDASRWYDD AT DDIBEN PENODOL A THORRI AMODAU, HEBLAW I'R GRADDAU LLE NA CHAIFF UNRHYW WARANTAU DEALLEDIG EU HYMWADU O DAN GYFRAITH GYMWYS.

source: {platform_name} AND THE {platform_name} PARTICIPANTS (AS HERINAFTER DEFINED) DO NOT WARRANT THAT THE APIS WILL OPERATE IN AN UNINTERRUPTED OR ERROR-FREE MANNER, THAT THE APIS ARE FREE OF VIRUSES OR OTHER HARMFUL COMPONENTS, OR THAT THE APIS OR API CONTENT PROVIDED WILL MEET YOUR NEEDS OR EXPECTATIONS. {platform_name} AND THE {platform_name} PARTICIPANTS ALSO MAKE NO WARRANTY ABOUT THE ACCURACY, COMPLETENESS, TIMELINESS, OR QUALITY OF THE APIS OR ANY API CONTENT, OR THAT ANY PARTICULAR API CONTENT WILL CONTINUE TO BE MADE AVAILABLE. "{platform_name} PARTICIPANTS" MEANS MIT, HARVARD, THE OTHER MEMBERS, THE ENTITIES PROVIDING INFORMATION, API CONTENT OR SERVICES FOR THE APIS, THE COURSE INSTRUCTORS AND THEIR STAFFS.
cy: NID YW {platform_name} A CHYFRANOGWYR {platform_name} (FEL Y'U DIFFINIR O HYN YMLAEN) YN GWARANTU Y BYDD YR API YN GWEITHREDU HEB EI DARFU NEU HEB WALL, A BOD YR API HEB FIRYSAU NEU GYDRANNAU NIWEIDIOL ERAILL, NA BOD YR API NEU'R CYNNWYS API A DDARPARWYD YN BODLONI EICH ANGHENION NEU EICH DISGWYLIADAU. NID YW {platform_name} A CHYFRANOGWYR {platform_name} CHWAITH YN GWARANTU CYWIRDEB, CYFLAWNDER, AMSEROLDEB NAC ANSAWDD YR APIS NEU UNRHYW GYNNWYS API, NEU FOD UNRHYW GYNNWYS API YN PARHAU I FOD AR GAEL. MAE "CYFRANOGWYR {platform_name}" YN GOLYGU MIT, HARVARD, YR AELODAU ERAILL, Y SAWL SY'N RHOI GWYBODAETH, CYNNWYS API NEU WASANAETHAU AR GYFER YR API, HYFFORDDWYR Y CWRS A'U STAFF.

source: USE OF THE APIS, AND THE API CONTENT AND ANY SERVICES OBTAINED FROM OR THROUGH THE APIS, IS AT YOUR OWN RISK. YOUR ACCESS TO OR DOWNLOAD OF INFORMATION, MATERIALS OR DATA THROUGH THE APIS IS AT YOUR OWN DISCRETION AND RISK, AND YOU WILL BE SOLELY RESPONSIBLE FOR ANY DAMAGE TO YOUR PROPERTY (INCLUDING YOUR COMPUTER SYSTEM) OR LOSS OF DATA THAT RESULTS FROM THE DOWNLOAD OR USE OF SUCH MATERIAL OR DATA, UNLESS OTHERWISE EXPRESSLY PROVIDED FOR IN THE {platform_name} PRIVACY POLICY.
cy: EICH CYFRIFOLDEB CHI YW'CH DEFNYDD O'R API, CYNNWYS API AC UNRHYW WASANAETHAU A GAFWYD DRWY'R API. EICH CYFRIFOLDEB A'CH DISGRESIWN CHI YW EICH MYNEDIAD I NEU LWYTHO I LAWR WYBODAETH, DEUNYDD NEU DDATA DRWY'R API A BYDDWCH CHI YN YNIG YN GYFRIFOL AM UNRHYW DDIFROD I EIDDO (GAN GYNNWYS EICH SYSTEM GYFRIFIADUROL) NEU GOLLI DATA O GANLYNIAD I LWYTHO I LAWR NEU DDEFNYDDIO'R FATH DDEUNYDD NEU DDATA, ONI DDARPERIR YN BENODOL FEL ARALL YM MHOLISI PREIFATRWYDD {platform_name}.
