Repository: zhulinhai/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: cy

source: By default, students can download an .srt or .txt transcript when you set Download Transcript Allowed to True. If you want to provide a downloadable transcript in a different format, we recommend that you upload a handout by using the Upload a Handout field. If this isn't possible, you can post a transcript file on the Files & Uploads page or on the Internet, and then add the URL for the transcript here. Students see a link to download that transcript below the video.
cy: Yn ddiofyn, gall myfyrwyr lawrlwytho trawsgrifiad .srt neu .txt wrth osod Caniatáu lawrlwytho trawsgrifiad i Gwir. Os ydych am ddarparu trawsgrifiad i'w lwytho i lawr mewn fformat gwahanol, rydym yn argymell eich bod yn llwytho taflen i fyny gan ddefnyddio'r maes Llwytho taflen i fyny. Os nad yw hyn yn bosibl, gallwch osod ffeil trawsgrifiad ar y dudalen Ffeiliau a llwytho i fyny neu ar y rhyngrwyd, ac yna ychwanegu URL ar gyfer y trawsgrifiad yma. Bydd y myfyrwyr yn gweld dolen er mwyn llwytho trawsgrifiad i lawr o dan y fideo.

source: Downloadable Transcript URL
cy: URL trawsgrifiad y gellir ei lawrlwytho

source: Allow students to download the timed transcript. A link to download the file appears below the video. By default, the transcript is an .srt or .txt file. If you want to provide the transcript for download in a different format, upload a file by using the Upload Handout field.
cy: Caniatáu i fyfyrwyr lawrlwytho'r trawsgrifiad wedi'i amseru. Mae dolen i lawrlwytho'r ffeil yn ymddangos islaw'r fideo. Yn ddiofyn, mae'r trawsgrifiad yn ffeil .srt neu .txt. Os ydych am ddarparu trawsgrifiad i'w lwytho i lawr mewn fformat gwahanol, llwythwch daflen i fyny gan ddefnyddio'r maes Llwytho taflen i fyny.

source: Download Transcript Allowed
cy: Caniateir lawrlwytho trawsgrifiad

source: The default transcript for the video, from the Default Timed Transcript field on the Basic tab. This transcript should be in English. You don't have to change this setting.
cy: Y trawsgrifiad diofyn ar gyfer y fideo, o'r maes trawsgrifiad diofyn a amserir ar y tab sylfaenol. Dylai'r trawsgrifiad fod yn Saesneg. Nid oes rhaid i chi newid y gosodiad hwn.

source: Default Timed Transcript
cy: Trawsgrifiad a amserwyd diofyn

source: Specify whether the transcripts appear with the video by default.
cy: Nodwch a ddylai'r trawsgrifiadau ymddangos yn ddiofyn gyda'r fideo.

source: Show Transcript
cy: Dangos y trawsgrifiad

source: Add transcripts in different languages. Click below to specify a language and upload an .srt transcript file for that language.
cy: Ychwanegu trawsgrifiadau mewn ieithoedd gwahanol. Cliciwch isod i nodi iaith a llwytho ffeil trawsgrifiad .srt i fyny ar gyfer yr iaith hon.

source: Transcript Languages
cy: Ieithoedd y trawsgrifiad

source: Preferred language for transcript.
cy: Dewis iaith ar gyfer y trawsgrifiad.

source: Preferred language for transcript
cy: Dewis iaith ar gyfer y trawsgrifiad

source: Transcript file format to download by user.
cy: Fformat y ffeil trawsgrifiad i'w lwytho i lawr gan ddefnyddiwr.

source: SubRip (.srt) file
cy: Ffeil SubRip (.srt)

source: Text (.txt) file
cy: Ffeil testun (.txt)

source: The last speed that the user specified for the video.
cy: Y cyflymder diwethaf a ddewiswyd gan y defnyddiwr ar gyfer y fideo hwnnw.

source: The default speed for the video.
cy: Y cyflymder diofyn ar gyfer y fideo.

source: Specify whether YouTube is available for the user.
cy: Nodwch a yw YouTube ar gael i'r defnyddiwr.

source: Upload a handout to accompany this video. Students can download the handout by clicking Download Handout under the video.
cy: Llwytho taflen i fyny i gyd-fynd â'r fideo hwn Gall myfyrwyr lawrlwytho'r daflen drwy glicio ar lawrlwytho taflen o dan y fideo.

source: Upload Handout
cy: Llwytho taflen i fyny

source: Specify whether access to this video is limited to browsers only, or if it can be accessed from other applications including mobile apps.
cy: Nodwch a yw mynediad i'r fideo hwn yn gyfyngedig i borwyr yn unig, neu os gellir ei weld drwy gymwysiadau eraill gan gynnwys app symudol.

source: Video Available on Web Only
cy: Mae'r fideo ar gael ar y we yn unig

source: If you were assigned a Video ID by edX for the video to play in this component, enter the ID here. In this case, do not enter values in the Default Video URL, the Video File URLs, and the YouTube ID fields. If you were not assigned a Video ID, enter values in those other fields and ignore this field.
cy: Os derbynioch rif adnabod fideo gan edX ar gyfer y fideo i'w chwarae yn y gydran hon, rhowch y rhif adnabod yma. Yn yr achos hwn, peidiwch â rhoi gwerthoedd ym meysydd URL fideo diofyn, URL ffeil y fideo na rhif adnabod YouTube. Os na chawsoch rif adnabod fideo, rhowch werthoedd yn y meysydd eraill ac anwybyddu'r maes hwn.

source: Date of the last view of the bumper
cy: Dyddiad y tro diwethaf gwyliwyd y bympar

source: Do not show bumper again
cy: Peidiwch â dangos y bympar eto

source: Video Annotation
cy: Anodiad fideo

source: The external source URL for the video.
cy: Yr URL ffynhonnell allanol ar gyfer y fideo.

source: Source URL
cy: URL ffynhonnell

source: Poster Image URL
cy: URL delwedd y postiwr

source: Poster URL
cy: URL y postiwr

source: Instructions
cy: Cyfarwyddiadau

source: Add instructions to help learners understand how to use the word cloud. Clear instructions are important, especially for learners who have accessibility requirements.
cy: Ychwanegu cyfarwyddiadau i helpu dysgwyr i ddeall sut i ddefnyddio'r cwmwl geiriau. Mae cyfarwyddiadau eglur yn bwysig, yn enwedig i ddysgwyr sydd â gofynion hygyrchedd.

source: Inputs
cy: Mewnbynnau

source: The number of text boxes available for learners to add words and sentences.
cy: Nifer y blychau testun sydd ar gael i ddysgwyr ychwanegu geiriau a brawddegau.

source: Maximum Words
cy: Mwyafswm geiriau

source: The maximum number of words displayed in the generated word cloud.
cy: Mwyafswm nifer y geiriau i'w gweld yn y cwmwl geiriau a gynhyrchir.

source: Show Percents
cy: Dangos canrannau

source: Statistics are shown for entered words near that word.
cy: Dangosir ystadegau ar gyfer geiriau a roddwyd nesaf at y gair hwnnw.

source: Whether this learner has posted words to the cloud.
cy: A yw'r dysgwr wedi postio geiriau i'r cwmwl.

source: Student answer.
cy: Ateb y myfyriwr.

source: All possible words from all learners.
cy: Pob gair posib gan ddysgwyr.

source: Top num_top_words words for word cloud.
cy: Prif eiriau num_top_words ar gyfer cwmwl geiriau.

source: Completed the course "{course_name}" ({course_mode}, {start_date} - {end_date})
cy: Wedi cwblhau'r cwrs "{course_name}" ({course_mode}, {start_date} - {end_date})

source: Completed the course "{course_name}" ({course_mode})
cy: Wedi cwblhau'r cwrs "{course_name}" ({course_mode})

source: The badge image must be square.
cy: Rhaid i ddelwedd y bathodyn fod yn sgwâr.

source: The badge image file size must be less than 250KB.
cy: Rhaid i faint ffeil delwedd y bathodyn fod yn llai na 250kb.

source: This value must be all lowercase.
cy: Rhaid i'r holl werth fod mewn llythrennau bach.

source: The course mode for this badge image. For example, "verified" or "honor".
cy: Y modd cwrs ar gyfer delwedd y bathodyn hwn. Er enghraifft, "gwiriwyd" neu "anrhydedd".

source: Badge images must be square PNG files. The file size should be under 250KB.
cy: Rhaid i ddelweddau bathodynnau fod yn ffeiliau PNG sgwâr. Dylai maint y ffeil fod o dan 250kb.

source: Set this value to True if you want this image to be the default image for any course modes that do not have a specified badge image. You can have only one default image.
cy: Gosodwch y gwerth yma yn Wir os ydych am i'r ddelwedd hon fod yn ddelwedd ddiofyn ar gyfer unrhyw foddau cwrs nad ydynt wedi derbyn delwedd bathodyn penodol. Un ddelwedd ddiofyn a geir yn unig.

source: There can be only one default image.
cy: Un ddelwedd ddiofyn a geir yn unig.

source: On each line, put the number of completed courses to award a badge for, a comma, and the slug of a badge class you have created that has the issuing component 'openedx__course'. For example: 3,enrolled_3_courses
cy: Ar bob llinell, rhowch nifer y cyrsiau a gwblhawyd y dylid dyfarnu bathodyn ar eu cyfer, atalnod, slyg dosbarth bathodyn rydych wedi'i greu sydd gyda'r gydran dyroddi 'openedx__course'. Er enghraifft: 3,enrolled_3_courses

source: On each line, put the number of enrolled courses to award a badge for, a comma, and the slug of a badge class you have created that has the issuing component 'openedx__course'. For example: 3,enrolled_3_courses
cy: Ar bob llinell, rhowch nifer y cyrsiau cofrestredig y dylid dyfarnu bathodyn ar eu cyfer, atalnod, slyg dosbarth bathodyn rydych wedi'i greu sydd gyda'r gydran dyroddi 'openedx__course'. Er enghraifft: 3,cofrestrwyd ar_3_chwrs

source: Each line is a comma-separated list. The first item in each line is the slug of a badge class you have created that has an issuing component of 'openedx__course'. The remaining items in each line are the course keys the learner needs to complete to be awarded the badge. For example: slug_for_compsci_courses_group_badge,course-v1:CompSci+Course+First,course-v1:CompsSci+Course+Second
cy: Mae pob llinell yn rhestr wedi'i gwahanu ag atalnod. Yr eitem gyntaf ar bob llinell yw slyg dosbarth bathodyn rydych wedi'i greu sydd â chydran dyroddi 'openedx__course'. Mae'r eitemau sy'n weddill ar bob llinell yw allweddi'r cwrs mae angen i'r dysgwyr eu cwblhau er mwyn derbyn y bathodyn. Er enghraifft: slug_for_compsci_courses_group_badge,course-v1:CompSci+Course+First,course-v1:CompsSci+Course+Second

source: Please check the syntax of your entry.
cy: Gwiriwch gystrawen eich cynnig.

source: © {org_name}. All rights reserved except where noted. EdX, Open edX and the edX and Open EdX logos are registered trademarks or trademarks of edX Inc.
cy: © {org_name}. Cedwir pob hawl heblaw lle nodir. Mae EdX, Open edX a logos edX a Open EdX yn nodau masnachu cofrestredig neu'n nodau masnachu edX Inc.

source: Powered by Open edX
cy: Wedi'i bweru gan Open edX

source: {platform_name} for Business
cy: {platform_name} ar gyfer Busnes

source: News
cy: Newyddion

source: Help Center
cy: Canolfan help

source: Contact
cy: Cyswllt

source: Careers
cy: Gyrfaoedd

source: Donate
cy: Rhoddi

source: Terms of Service & Honor Code
cy: Telerau Gwasanaeth a Chôd Anrhydedd

source: Terms of Service & Honour Code
cy: Telerau Gwasanaeth a Chôd Anrhydedd

source: Privacy Policy
cy: Polisi preifatrwydd

source: Accessibility Policy
cy: Polisi Hygyrchedd

source: Sitemap
cy: Map safle

source: Media Kit
cy: Pecyn cyfryngau

source: Terms of Service
cy: Telerau gwasanaeth

source: Download the {platform_name} mobile app from the Apple App Store
cy: Lawrlwythwch app ffôn symudol {platform_name} o Apple App Store

source: Download the {platform_name} mobile app from Google Play
cy: Lawrlwythwch app ffôn symudol {platform_name} o Google Play

source: A CCX can only be created on this course through an external service. Contact a course admin to give you access.
cy: Gellir ond creu CCX ar y cwrs hwn drwy wasanaeth allanol. Cysylltwch â gweinyddwr y cwrs i gael mynediad.

source: The course is full: the limit is {max_student_enrollments_allowed}
cy: Mae'r cwrs yn llawn: y mwyafswm yw {max_student_enrollments_allowed}

source: You must be a CCX Coach to access this view.
cy: Rhaid i chi fod yn CCX Coach i weld hyn.

source: You must be the coach for this ccx to access this view
cy: Rhaid i chi fod yn hyfforddwr ar gyfer y CCX hwn i weld hyn

source: You cannot create a CCX from a course using a deprecated id. Please create a rerun of this course in the studio to allow this action.
cy: Ni chewch greu CCX o gwrs yn defnyddio rhif adnabod anghymeradwy. Crëwch ail-rediad o'r cwrs hwn yn y studio i ganiatáu'r weithred hon.

source: created
cy: wedi'i greu

source: regenerated
cy: ailgynhyrchwyd

source: generated
cy: cynhyrchwyd

source: All learners
cy: Pob dysgwr

source: For exceptions
cy: Ar gyfer eithriadau

source: A human-readable description of the example certificate. For example, 'verified' or 'honor' to differentiate between two types of certificates.
cy: Disgrifiad darllenadwy i bobl o'r dystysgrif enghreifftiol. Er enghraifft, mae 'gwiriwyd' neu 'anrhydedd' yn gwahaniaethu rhwng dau fath o dystysgrif.

source: A unique identifier for the example certificate. This is used when we receive a response from the queue to determine which example certificate was processed.
cy: Dynodydd unigryw ar gyfer y dystysgrif enghreifftiol. Defnyddir hyn wedi i ni dderbyn ymateb o'r ciw i bennu pa dystysgrif enghreifftiol a broseswyd.

source: An access key for the example certificate. This is used when we receive a response from the queue to validate that the sender is the same entity we asked to generate the certificate.
cy: Côd mynediad ar gyfer y dystysgrif enghreifftiol. Defnyddir hyn pan fyddwn yn derbyn ymateb o'r ciw i ddilysu bod yr anfonwr yr un person â'r sawl y gofynnom iddo greu tystysgrif.

source: The full name that will appear on the certificate.
cy: Yr enw llawn a fydd yn ymddangos ar y dystysgrif.

source: The template file to use when generating the certificate.
cy: Ffeil y patrymlun i'w ddefnyddio wrth greu'r dystysgrif.

source: The status of the example certificate.
cy: Statws y dystysgrif enghreifftiol.

source: The reason an error occurred during certificate generation.
cy: Y rheswm dros y gwall wrth gynhyrchu tystysgrif.

source: The download URL for the generated certificate.
cy: Yr URL lawrlwytho ar gyfer y tystysgrif a gynhyrchwyd.

source: Name of template.
cy: Enw'r patrymlun.

source: Description and/or admin notes.
cy: Disgrifiad a/neu nodiadau gweinyddol.

source: Django template HTML.
cy: Patrymlun HTML Django.

source: Organization of template.
cy: Trefn y patrymlun.

source: The course mode for this template.
cy: Y modd cwrs ar gyfer y patrymlun hwn.

source: On/Off switch.
cy: Switsh ymlaen/i ffwrdd.

source: Description of the asset.
cy: Disgrifiad o'r ased.

source: Asset file. It could be an image or css file.
cy: Ffeil yr ased. Gall fod yn ddelwedd neu'n ffeil css.

source: Asset's unique slug. We can reference the asset in templates using this value.
cy: Slyg unigryw'r ased. Gallwch gyfeirio'r ased hwn mewn patrymluniau gan ddefnyddio'r gwerth hwn.

source: user is not given.
cy: ni roddwyd defnyddiwr.

source: user '{user}' does not exist
cy: Nid yw defnyddiwr '{user}' yn bodoli

source: Course id '{course_id}' is not valid
cy: Nid yw rhif adnabod y cwrs '{course_id}' yn ddilys

source: The course does not exist against the given key '{course_key}'
cy: Nid yw'r cwrs yn bodoli yn erbyn yr allwedd a roddwyd '{course_key}'

source: User {username} does not exist
cy: Nid yw defnyddiwr {username} yn bodoli

source: {course_key} is not a valid course key
cy: Nid yw y {course_key} yn allwedd cwrs dilys

source: The course {course_key} does not exist
cy: Nid yw'r cwrs {course_key} yn bodoli

source: User {username} is not enrolled in the course {course_key}
cy: Nid yw'r defnyddiwr {username} wedi cofrestru ar y cwrs {course_key}

source: An unexpected error occurred while regenerating certificates.
cy: Cafwyd gwall annisgwyl wrth ailgynhyrchu tystysgrifau.

source: An {cert_type} certificate signifies that a learner has agreed to abide by the honor code established by {platform_name} and has completed all of the required tasks for this course under its guidelines.
cy: Mae tystysgrif {cert_type} yn dynodi bod dysgwr wedi cytuno i gadw at y côd anrhydedd a grëwyd gan {platform_name} ac mae wedi cwblhau'r holl dasgau gofynnol ar gyfer y cwrs hwn o dan ei ganllawiau.

source: A {cert_type} certificate signifies that a learner has agreed to abide by the honor code established by {platform_name} and has completed all of the required tasks for this course under its guidelines. A {cert_type} certificate also indicates that the identity of the learner has been checked and is valid.
cy: Mae tystysgrif {cert_type} yn dynodi bod dysgwr wedi cytuno i gadw at y côd anrhydedd a grëwyd gan {platform_name} ac mae wedi cwblhau'r holl dasgau gofynnol ar gyfer y cwrs hwn o dan ei ganllawiau. Mae tystysgrif {cert_type} hefyd yn nodi bod pwy yw'r dysgwr wedi cael ei wirio a'i fod yn ddilys.

source: An {cert_type} certificate demonstrates a high level of achievement in a program of study, and includes verification of the student's identity.
cy: Mae tystysgrif {cert_type} yn arddangos lefel uchel o gyflawniad mewn rhaglen astudio, ac yn cynnwys gwiriad o hunaniaeth y myfyriwr.

source: This is a valid {platform_name} certificate for {user_name}, who participated in {partner_short_name} {course_number}
cy: Mae hon yn dystysgrif {platform_name} ar gyfer {user_name}, a fu'n cymryd rhan yn {course_number} {partner_short_name}

source: {partner_short_name} {course_number} Certificate | {platform_name}
cy: {partner_short_name} {course_number} Tystysgrif | {platform_name}

source: successfully completed, received a passing grade, and was awarded this {platform_name} {certificate_type} Certificate of Completion in
cy: wedi'i gwblhau'n llwyddiannus, derbyniwyd gradd llwyddo, a dyfarnwyd {platform_name} {certificate_type} Tystysgrif Cwblhau

source: {platform_name} acknowledges achievements through certificates, which are awarded for course activities that {platform_name} students complete.
cy: Mae {platform_name} yn cydnabod cyflawniadau drwy dystysgrifau, a ddyfernir am weithgareddau cwrs mae myfyrwyr {platform_name} yn eu cwblhau.

source: All rights reserved
cy: Cedwir pob hawl

source: Invalid Certificate
cy: Tystysgrif annilys

source: Terms of Service &amp; Honor Code
cy: Telerau gwasanaeth &amp; Côd anrhydedd

source: Terms of Service &amp; Honour Code
cy: Telerau gwasanaeth &amp; Côd anrhydedd

source: Certificate Validation
cy: Gwiriad tystysgrif

source: About {platform_name} Accomplishments
cy: Am gyflawniadau {platform_name}

source: Issued On:
cy: Rhoddwyd ar:

source: Certificate ID Number
cy: Rhif adnabod y dystysgrif

source: About {platform_name} Certificates
cy: Am dystysgrifau{platform_name}

source: How {platform_name} Validates Student Certificates
cy: Sut mae {platform_name} yn gwirio tystysgrifau myfyrwyr

source: Certificates issued by {platform_name} are signed by a gpg key so that they can be validated independently by anyone with the {platform_name} public key. For independent verification, {platform_name} uses what is called a "detached signature"&quot;".
cy: Mae tystysgrifau a ddyroddir gan {platform_name} yn cael eu llofnodi ag allwedd gpg fel y gellir eu dilysu'n annibynnol gan unrhyw un ag allwedd gyhoeddus {platform_name}. Ar gyfer gwirio annibynnol, mae {platform_name} yn defnyddio'r hyn a elwir yn "detached signature"&quot;".

source: Validate this certificate for yourself
cy: Gwiriwch y dystysgrif hon drosoch eich hun

source: {platform_name} offers interactive online classes and MOOCs.
cy: Mae {platform_name} yn cynnig gwersi ar-lein rhyngweithiol a MOOC.

source: About {platform_name}
cy: Am {platform_name}

source: Learn more about {platform_name}
cy: Dysgu mwy am {platform_name}

source: Learn with {platform_name}
cy: Dysgu gyda {platform_name}

source: Work at {platform_name}
cy: Gweithio yn {platform_name}

source: Contact {platform_name}
cy: Cysylltu â {platform_name}

source: {platform_name} acknowledges the following student accomplishment
cy: Mae {platform_name} yn cydnabod cyflawniad y myfyriwr hwn

source: a course of study offered by {partner_short_name}, an online learning initiative of {partner_long_name}.
cy: cwrs astudio a gynigir gan {partner_short_name}, menter ddysgu ar-lein {partner_long_name}.

source: a course of study offered by {partner_short_name}.
cy: cwrs astudio a gynigir gan {partner_short_name}.

source: I completed the {course_title} course on {platform_name}.
cy: Rwyf wedi cwblhau cwrs {course_title} ar {platform_name}.

source: I completed a course at {platform_name}. Take a look at my certificate.
cy: Rwyf wedi cwblhau cwrs ar {platform_name}. Edrychwch ar fy nhystysgrif.

source: More Information About {user_name}'s Certificate:
cy: Mwy o wybodaeth am dystysgrif {user_name}:

source: {fullname}, you earned a certificate!
cy: {fullname}, rydych wedi ennill tystysgrif!

source: Congratulations! This page summarizes what you accomplished. Show it off to family, friends, and colleagues in your social and professional networks.
cy: Llongyfarchiadau! Mae'r dudalen hon yn crynhoi eich cyflawniadau. Dangoswch hwn i'ch teulu, ffrindiau a chydweithwyr ar rwydweithiau cymdeithasol a phroffesiynol.

source: More about {fullname}'s accomplishment
cy: Mwy am gyflawniadau {fullname}

source: Username
cy: Enw defnyddiwr

source: Grade
cy: Gradd

source: Percent
cy: Canran

source: Opened by this number of students
cy: Agorwyd gan y nifer hwn o fyfyrwyr

source: subsections
cy: is-adrannau

source: Count of Students
cy: Nifer y myfyrwyr

source: Percent of Students
cy: Canran y myfyrwyr

source: Score
cy: Sgôr

source: problems
cy: problemau

source: {course_id} is not a valid course key.
cy: Nid yw {course_id} yn allwedd cwrs dilys.

source: Course {course_id} does not exist.
cy: Nid yw'r cwrs {course_id} yn bodoli.

source: Use the checkout page hosted by the E-Commerce service.
cy: Defnyddiwch y dudalen dalu a gaiff ei lletya gan wasanaeth e-fasnach.

source: Path to single course checkout page hosted by the E-Commerce service.
cy: Llwybr i dudalen dalu cwrs sengl a gaiff ei lletya gan wasanaeth e-fasnach.

source: Cache Time To Live
cy: Amser storio hyd yn fyw

source: Specified in seconds. Enable caching by setting this to a value greater than 0.
cy: Manylwyd mewn eiliadau. Galluogwch storio dros dro drwy osod hwn i werth mwy na 0 iddo.

source: Path to order receipt page.
cy: Llwybr i dudalen archebu derbynneb.

source: Automatically approve valid refund requests, without manual processing
cy: Cymeradwyo ceisiadau dilys am ad-daliadau yn awtomatig, heb brosesu eich hun

source: A refund request has been initiated for {username} ({email}). To process this request, please visit the link(s) below.
cy: Dechreuwyd cais ad-daliad ar gyfer {username} ({email}). I brosesu'r cais hwn, ewch i'r ddolen(dolenni) isod.

source: [Refund] User-Requested Refund
cy: [Ad-daliad] Ad-daliad ar gais y defnyddiwr

source: Receipt
cy: Derbynneb

source: Payment Failed
cy: Methodd y taliad

source: There was a problem with this transaction. You have not been charged.
cy: Cafwyd problem gyda'r trafodyn hyn. Ni chodwyd tâl arnoch.

source: Make sure your information is correct, or try again with a different card or another form of payment.
cy: Sicrhewch bod eich gwybodaeth yn gywir, neu geisiwch eto gyda cherdyn gwahanol neu ffurf arall o dalu.

source: A system error occurred while processing your payment. You have not been charged.
cy: Cafwyd gwall system wrth brosesu'ch taliad. Ni chodwyd tâl arnoch.

source: Please wait a few minutes and then try again.
cy: Arhoswch ychydig funudau ac yna geisio eto.

source: For help, contact {payment_support_link}.
cy: Am gymorth, cysylltwch â {payment_support_link}.

source: An error occurred while creating your receipt.
cy: Cafwyd gwall wrth greu eich derbynneb.

source: If your course does not appear on your dashboard, contact {payment_support_link}.
cy: Os nad yw eich cwrs yn ymddangos ar eich dangosfwrdd, cysylltwch â {payment_support_link}.

source: Wiki
cy: Wici

source: This is the wiki for **{organization}**'s _{course_name}_.
cy: Dyma'r wici ar gyfer _{course_name}_ **{organization}**.

source: Course page automatically created.
cy: Crëwyd tudalen y cwrs yn awtomatig.

source: Welcome to the {platform_name} Wiki
cy: Croeso i {platform_name} Wici
