Repository: zhulinhai/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: cy

source: text_search and order_by cannot be provided together
cy: Ni ellir darparu text_search a order_by gyda'i gilydd

source: The supplied topic id {topic_id} is not valid
cy: Nid yw rhif adnabod y pwnc {topic_id} a roddwyd yn ddilys

source: Error connecting to elasticsearch
cy: Gwall wrth gysylltu ag elasticsearch

source: The ordering {ordering} is not supported
cy: Ni chefnogir archebu {ordering}

source: The supplied course_id {course_id} is not valid.
cy: Nid yw rhif adnabod y cwrs {course_id} a roddwyd yn ddilys.

source: You are already in a team in this course.
cy: Rydych eisoes mewn tîm ar y cwrs hwn.

source: username or team_id must be specified.
cy: Rhaid nodi enw defnyddiwr neu team_id.

source: Username is required.
cy: Mae enw defnyddiwr yn ofynnol.

source: Team id is required.
cy: Mae angen rhif adnabod y tîm.

source: This team is already full.
cy: Mae'r tîm eisoes yn llawn.

source: The user {username} is already a member of a team in this course.
cy: Mae'r defnyddiwr {username} eisoes yn aelod o dîm ar y cwrs hwn.

source: The user {username} is not enrolled in the course associated with this team.
cy: Nid yw'r defnyddiwr {username} wedi cofrestru ar y cwrs sy'n gysylltiedig â'r tîm hwn.

source: Your {platform_name} verification has expired.
cy: Mae eich gwiriad {platform_name} wedi darfod.

source: No photo ID was provided.
cy: Ni ddarparwyd llun adnabod.

source: We couldn't read your name from your photo ID image.
cy: Ni fedrem ddarllen eich enw o ddelwedd eich cerdyn adnabod.

source: The name associated with your account and the name on your ID do not match.
cy: Nid yw'r enw sy'n gysylltiedig â'ch cyfrif a'r enw ar eich rhif adnabod yn cyd-fynd.

source: The image of your face was not clear.
cy: Nid oedd y ddelwedd o'ch wyneb yn glir.

source: Your face was not visible in your self-photo.
cy: Nid oedd eich wyneb i'w weld yn yr hunlun.

source: There was an error verifying your ID photos.
cy: Cafwyd gwall wrth wirio lluniau'ch rhif adnabod.

source: The course for which this deadline applies
cy: Y cwrs mae'r rheol hon yn berthnasol iddo

source: The datetime after which users are no longer allowed to submit photos for verification.
cy: Ni chaiff defnyddwyr bellach gyflwyno lluniau i'w gwirio wedi'r dyddiad/amser hwn.

source: Intro
cy: Rhagarweiniad

source: Make payment
cy: Gwneud taliad

source: Payment confirmation
cy: Cadarnhad talu

source: Take photo
cy: Cymryd llun

source: Take a photo of your ID
cy: Tynnwch lun o'ch cerdyn adnabod

source: Review your info
cy: Adolygu eich gwybodaeth

source: Enrollment confirmation
cy: Cadarnhad cofrestru

source: Selected price is not valid number.
cy: Nid yw'r pris a ddewiswyd yn rhif dilys.

source: This course doesn't support paid certificates
cy: Nid yw'r cwrs hwn yn cefnogi tystysgrifau â thâl.

source: No selected price or selected price is below minimum.
cy: Ni ddewiswyd pris neu mae'r pris a ddewiswyd yn is na'r lleiafswm.

source: Photo ID image is required if the user does not have an initial verification attempt.
cy: Mae angen delwedd llun adnabod os nad oes gan y defnyddiwr gais wirio gychwynnol.

source: Missing required parameter face_image
cy: Paramedr face_image gofynnol ar goll

source: Invalid course key
cy: Allwedd cwrs annilys

source: No profile found for user
cy: Ni chanfuwyd proffil ar gyfer y defnyddiwr

source: Name must be at least {min_length} characters long.
cy: Rhaid i'r enw fod o leiaf {min_length} nod/cymeriad o hyd.

source: Image data is not valid.
cy: Nid yw data'r ddelwedd yn ddilys.

source: Verification photos received
cy: Derbyniwyd lluniau gwirio

source: Like {platform_name} on Facebook
cy: Hoffi {platform_name} ar Facebook

source: Follow {platform_name} on Twitter
cy: Dilyn {platform_name} ar Twitter

source: Follow {platform_name} on LinkedIn
cy: Dilyn {platform_name} ar LinkedIn

source: Follow {platform_name} on Google+
cy: Dilyn {platform_name} ar Google+

source: Subscribe to the {platform_name} subreddit
cy: Tanysgrifio i {platform_name} subreddit

source: Subscribe to the {platform_name} YouTube channel
cy: Tanysgrifio i {platform_name} sianel YouTube

source: Signed Out
cy: Wedi allgofnodi

source: You have signed out.
cy: Rydych wedi allgofnodi.

source: If you are not redirected within 5 seconds, <a href="%(target)s">click here to go to the home page</a>.
cy: Os na chewch eich ailgyfeirio o fewn 5 eiliad, <a href="%(target)s">cliciwch yma i fynd i'r hafan</a>.

source: Skip to main content
cy: Sgipio i'r prif gynnwys

source: Authorize
cy: Awdurdodi

source: The above application requests the following permissions from your account:
cy: Mae'r cymhwysiad uchod yn gofyn am y caniatadau hyn o'ch cyfrif:

source: Please click the 'Allow' button to grant these permissions to the above application. Otherwise, to withhold these permissions, please click the 'Cancel' button.
cy: Cliciwch 'Caniatáu' i roi'r caniatâd hyn i'r app uchod. Fel arall, i beidio â rhoi caniatâd, cliciwch y botwm 'Canslo' uchod.

source: Cancel
cy: Canslo

source: Allow
cy: Caniatáu

source: Error
cy: Gwall

source: You're receiving this e-mail because you requested a password reset for your user account at %(site_name)s.
cy: Rydych yn derbyn yr e-bost hwn am eich bod wedi gofyn am ailosod cyfrinair ar gyfer eich cyfrif defnyddiwr yn %(site_name)s.

source: Please go to the following page and choose a new password:
cy: Ewch i'r dudalen nesaf a dewis cyfrinair newydd:

source: If you didn't request this change, you can disregard this email - we have not yet reset your password.
cy: Os na wnaethoch ofyn am y newid hwn, gallwch anwybyddu'r e-bost hwn - nid ydym wedi ailosod eich cyfrinair eto.

source: Thanks for using our site!
cy: Diolch am ddefnyddio ein safle!

source: Last modified:
cy: Addaswyd ddiwethaf:

source: See all children
cy: Gweld yr holl blant

source: This article was last modified:
cy: Addaswyd yr erthygl hon ddiwethaf:

source: Add new article
cy: Ychwanegu erthygl newydd

source: Create article
cy: Creu erthygl

source: Go back
cy: Yn ôl

source: Delete article
cy: Dileu erthygl

source: Delete
cy: Dileu

source: You cannot delete a root article.
cy: Ni chewch ddileu erthygl graidd.

source: You cannot delete this article because you do not have permission to delete articles with children. Try to remove the children manually one-by-one.
cy: Ni chewch ddileu'r erthygl hon am nad oes gennych ganiatâd i ddileu erthyglau gyda phlant. Ceisiwch ddileu'r plant eich hun un wrth un.

source: You are deleting an article. This means that its children will be deleted as well. If you choose to purge, children will also be purged!
cy: Rydych yn dileu erthygl Golyga hyn y bydd ei blant hefyd yn cael eu dileu. Os dewiswch glirio, bydd y plant hefyd yn cael eu clirio!

source: Articles that will be deleted
cy: Erthyglau a gaiff eu dileu

source: ...and more!
cy: ...a mwy!

source: You are deleting an article. Please confirm.
cy: Rydych yn dileu erthygl Cadarnhewch.

source: Edit
cy: Golygu

source: Save changes
cy: Cadw'r newidiadau

source: Preview
cy: Rhagolwg

source: Close
cy: Cau

source: Wiki Preview
cy: Rhagweld wici

source: window open
cy: ffenestr ar agor

source: Back to editor
cy: Yn ôl i'r golygydd

source: History
cy: Hanes

source: Click each revision to see a list of edited lines. Click the Preview button to see how the article looked at this stage. At the bottom of this page, you can change to a particular revision or merge an old revision with the current one.
cy: Cliciwch ar bob adolygiad i weld rhestr o linellau wedi'u golygu. Cliciwch ar y botwm rhagweld i weld sut olwg sydd ar yr erthygl ar y cam hwn. Ar waelod y dudalen hon gallwch addasu neu un gyfuno hen adolygiad gyda'r un cyfredol

source: (no log message)
cy: (dim neges log)

source: Preview this revision
cy: Rhagweld yr adolygiad

source: Auto log:
cy: Awto-gofnodi:

source: Change
cy: Newid

source: Merge selected with current...
cy: Cyfuno'r hyn a ddewiswyd gyda'r cyfredol...

source: Switch to selected version
cy: Newid i'r fersiwn a ddewiswyd

source: Back to history view
cy: Yn ôl i hanes gwylio

source: Switch to this version
cy: Newid i'r fersiwn hon

source: Merge Revision
cy: Cyfuno'r adolygiad

source: Merge with current
cy: Cyfuno gyda'r cyfredol

source: When you merge a revision with the current, all data will be retained from both versions and merged at its approximate location from each revision.
cy: Pan fyddwch yn cyfuno adolygiad gyda'r cyfredol, bydd yr holl ddata yn cael ei gadw o'r ddwy fersiwn ac yn cael eu cyfuno yn fras yn eu lleoliad o bob adolygiad.

source: After this, it's important to do a manual review.
cy: Wedi hyn, mae'n bwysig cyflawni adolygiad eich hun.

source: Create new merged version
cy: Creu fersiwn gyfunedig newydd

source: You need to <a href="%(login_url)s">log in</a> or <a href="%(signup_url)s">sign up</a> to use this function.
cy: Mae angen i chi <a href="%(login_url)s">log in</a> neu <a href="%(signup_url)s">sign up</a> i ddefnyddio'r swyddogaeth hon.

source: You need to log in or sign up to use this function.
cy: Bydd angen i fi fewngofnodi neu gofrestru i ddefnyddio'r swyddogaeth hon.

source: This wiki uses <strong>Markdown</strong> for styling. There are several useful guides online. See any of the links below for in-depth details:
cy: Mae'r wici hwn yn defnyddio <strong>Markdown</strong> ar gyfer arddullio. Ceir sawl arweiniad defnyddiol ar-lein. Gweler unrhyw rai o'r dolenni isod am fanylion manwl:

source: Markdown: Basics
cy: Markdown: Gwybodaeth sylfaenol

source: Quick Markdown Syntax Guide
cy: Arweiniad Cystrawen Markdown Cyflym

source: Miniature Markdown Guide
cy: Arweiniad Markdown byr

source: To create a new wiki article, create a link to it. Clicking the link gives you the creation page.
cy: I greu erthygl wici newydd, rhaid i chi greu dolen iddi. Trwy glicio ar y ddolen fe gewch y dudalen greu.

source: Math Expression
cy: Mynegiant mathemateg

source: Useful examples:
cy: Enghreifftiau defnyddiol:

source: Huge Header
cy: Pennawd anferth

source: Smaller Header
cy: Pennawd llai

source: **strong** or __strong__
cy: **strong** neu __strong__

source: Unordered List
cy: Rhestr heb drefn

source: Sub Item 1
cy: Is-eitem 1

source: Sub Item 2
cy: Is-eitem 2

source: Ordered
cy: Wedi'i archebu/wedi'u harchebu

source: List
cy: Rhestr

source: Quotes
cy: Dyfyniadau

source: Attachments
cy: Atodiadau

source: Upload new file
cy: Llwytho ffeil newydd i fyny

source: Search and add file
cy: Chwilio ac ychwanegu ffeil

source: Upload File
cy: Llwytho ffeil i fyny

source: Upload file
cy: Llwytho ffeil i fyny

source: Search files and articles
cy: Chwilio ffeiliau ac erthyglau

source: You can reuse files from other articles. These files are subject to updates on other articles which may or may not be a good thing.
cy: Gallwch ailddefnyddio ffeiliau o erthyglau eraill. Mae'r ffeiliau hyn yn amodol ar ddiweddariadau i erthyglau eraill a allai fod yn beth da neu beidio.

source: Search
cy: Chwilio

source: The following files are available for this article. Copy the markdown tag to directly refer to a file from the article text.
cy: Mae'r ffeiliau hyn ar gael ar gyfer yr erthygl hon. Copïwch y tag markdown i gyfeirio'n uniongyrchol at ffeil o destun yr erthygl.

source: Markdown tag
cy: Tag Markdown

source: Uploaded by
cy: Llwythwyd i fyny gan

source: Size
cy: Maint

source: File History
cy: Hanes y ffeil

source: Detach
cy: Datod

source: Replace
cy: Amnewid

source: Restore
cy: Adfer

source: anonymous (IP logged)
cy: Dienw (cofnodwyd yr IP)

source: File history
cy: Hanes y ffeil

source: revisions
cy: adolygiadau

source: There are no attachments for this article.
cy: Nid oes unrhyw atodiadau ar gyfer yr erthygl hon.

source: Previewing revision:
cy: Rhagweld yr adolygiad:

source: Previewing a merge between two revisions:
cy: Rhagweld cyfuno rhwng dau adolygiad:

source: This revision has been deleted.
cy: Mae eich adolygiad wedi cael ei ddileu.

source: Restoring to this revision will mark the article as deleted.
cy: Bydd adfer hwn i'w adolygiad yn marcio'r erthygl wedi'i dileu.

source: Once you have approved this request, go to {catalog_admin_url} to set up a catalog for this user.
cy: Wedi i chi gymeradwyo'r cais hwn, ewch i {catalog_admin_url} i osod catalog ar gyfer y defnyddiwr hwn.

source: Company Address
cy: Cyfeiriad y cwmni

source: Describe what your application does.
cy: Disgrifiwch beth mae eich app yn ei wneud.

source: The URL of your company's website.
cy: URL gwefan eich cwmni.

source: The name of your company.
cy: Enw eich cwmni.

source: The contact address of your company.
cy: Cyfeiriad cyswllt eich cwmni.

source: The following users do not exist: {usernames}.
cy: Nid yw'r defnyddwyr hyn yn bodoli: {usernames}.

source: Comma-separated list of usernames which will be able to view this catalog.
cy: Rhestr, wedi'i rhannu ag atalnodau, o enwau defnyddiwr a fydd yn gallu gweld y catalog hwn.

source: Denied
cy: Gwrthodwyd

source: Approved
cy: Cymeradwywyd

source: Status of this API access request
cy: Statws y cais hwn am fynediad i'r API

source: The URL of the website associated with this API user.
cy: URL y wefan gysylltiedig â'r defnyddiwr API hwn.

source: The reason this user wants to access the API.
cy: Pam fod y defnyddiwr am gael mynediad i'r API.

source: API access request from {company}
cy: Cais mynediad i API gan {company}

source: API access request
cy: Cais mynediad i API

source: An error has occurred. Please try again.
cy: Gwall wedi digwydd. Rhowch gynnig arall arni.

source: No data provided.
cy: Ni ddarparwyd data.

source: Parameter usage_id not provided.
cy: Ni ddarparwyd usage_id paramedr.

source: Invalid usage_id: {usage_id}.
cy: usage_id annilys: {usage_id}.

source: Block with usage_id: {usage_id} not found.
cy: Rhwystr gyda usage_id: Ni ddaethpwyd o hyd i {usage_id}.

source: You can create up to {max_num_bookmarks_per_course} bookmarks. You must remove some bookmarks before you can add new ones.
cy: Gallwch greu hyd at {max_num_bookmarks_per_course} o nodau tudalen. Rhaid i chi ddileu rhai nodau tudalen cyn gallwch ychwanegu rhai newydd.

source: Bookmark with usage_id: {usage_id} does not exist.
cy: Rhoi nod tudalen gyda usage_id: Nid yw {usage_id} yn bodoli.

source: Internal API URL
cy: URL mewnol yr API

source: API root to be used for server-to-server requests (e.g., https://catalog-internal.example.com/api/v1/).
cy: Gwreiddyn API i'w ddefnyddio ar gyfer ceisiadau gweinydd-i-weinydd (e.e., https://catalog-internal.example.com/api/v1/).

source: Specified in seconds. Enable caching of API responses by setting this to a value greater than 0.
cy: Manylwyd mewn eiliadau. Galluogwch storio dros dro ymatebion API drwy osod gwerth mwy na 0 iddo.

source: Username created for Course Catalog Integration, e.g. lms_catalog_service_user.
cy: Crëwyd enw defnyddiwr ar gyfer integreiddio catalog cwrs, e.e. lms_catalog_service_user.

source: List of domains that are allowed to make cross-domain requests to this site. Please list each domain on its own line.
cy: Rhestr o'r parthau sydd â hawl i wneud ceisiadau ar draws parthau i'r safle hwn. Rhestrwch pob parth ar ei linell ei hun.

source: Default Group
cy: Grŵp diofyn

source: You cannot create two cohorts with the same name
cy: Ni allwch greu dau gohort gyda'r un enw

source: There must be one cohort to which students can automatically be assigned.
cy: Mae'n rhaid bod un cohort y gellir rhoi myfyrwyr ynddo yn awtomatig.

source: A cohort with the same name already exists.
cy: Mae cohort gyda'r un enw eisoes yn bodoli.

source: The platform key associates CourseTalk widgets with your platform. Generally, it is the domain name for your platform. For example, if your platform is http://edx.org, the platform key is "edx".
cy: Mae'r allwedd platfform yn cysylltu ategyn CourseTalk gyda'ch platfform. Yn gyffredinol, dyma'r enw parth ar gyfer eich platfform. Er enghraifft, os taw eich platfform yw http://edx.org, allwedd y platfform yw "edx".

source: Internal Service URL
cy: URL Gwasanaeth Mewnol

source: Public Service URL
cy: URL Gwasanaeth Cyhoeddus

source: Enable Learner Issuance
cy: Galluogi dyroddi dysgwyr

source: Enable issuance of credentials via Credential Service.
cy: Galluogi dyroddi cymwysterau drwy Credential Service.

source: Enable Authoring of Credential in Studio
cy: Galluogi awduro cymhwyster yn Studio.

source: Enable authoring of Credential Service credentials in Studio.
cy: Galluogi awduro cymhwyster Credential Service yn Studio.

source: Course Credit Eligibility
cy: Cymhwyster ar gyfer credyd cwrs

source: You are eligible for credit from {providers_string}
cy: Rydych yn gymwys ar gyfer credyd gan {providers_string}

source: {first_provider} and {second_provider}
cy: {first_provider} a {second_provider}

source: [{username}] is not eligible for credit for [{course_key}].
cy: Nid yw [{username}] yn gymwys am gredyd ar gyfer [{course_key}].

source: [{course_key}] is not a valid course key.
cy: Nid yw [{course_key}] yn allwedd cwrs dilys.

source: Unique identifier for this credit provider. Only alphanumeric characters and hyphens (-) are allowed. The identifier is case-sensitive.
cy: Dynodydd unigryw ar gyfer y darparwr credyd hwn. Dim ond nodau alffamerig a chysylltnodau (-) a ganiateir. Mae'r dynodydd yn sensitif i faint llythrennau.

source: Whether the credit provider is currently enabled.
cy: A yw'r darparwr credyd wedi'i alluogi ar hyn o bryd.

source: Name of the credit provider displayed to users
cy: Arddangos enw'r darparwr credyd i'r defnyddwyr

source: When true, automatically notify the credit provider when a user requests credit. In order for this to work, a shared secret key MUST be configured for the credit provider in secure auth settings.
cy: Os yn wir, rhoddir gwybod yn awtomataidd i'r darparwr credyd pan fydd defnyddiwr yn gofyn am gredyd. Er mwyn i hyn weithio, RHAID ffurfweddu allwedd gudd ar gyfer y darparwr credyd o dan gosodiadau awdurdodi diogel.

source: URL of the credit provider. If automatic integration is enabled, this will the the end-point that we POST to to notify the provider of a credit request. Otherwise, the user will be shown a link to this URL, so the user can request credit from the provider directly.
cy: URL y darparwr credyd. Os galluogir integreiddio awtomataidd, hyn fydd y pwynt diwedd rydym yn ei BOSTIO i hysbysu'r darparwr am gais am gredyd. Fel arall bydd y defnyddiwr yn gweld dolen i'r URL hwn, fel y gall y defnyddiwr ofyn am gredyd gan y darparwr yn uniongyrchol.

source: URL from the credit provider where the user can check the status of his or her request for credit. This is displayed to students *after* they have requested credit.
cy: URL gan y darparwr credyd lle gall y defnyddiwr wirio statws ei gredyd/chredyd. Caiff myfyrwyr *weld* hyn ar ôl ceisio am gredyd.

source: Description for the credit provider displayed to users.
cy: Disgrifiad ar gyfer y darparwr credyd i'w arddangos i ddefnyddwyr.

source: Plain text or html content for displaying further steps on receipt page *after* paying for the credit to get credit for a credit course against a credit provider.
cy: Cynnwys testun plaen neu html ar gyfer arddangos camau pellach ar dudalen dderbynneb *wedi* talu am y credyd i gael credyd am gwrs credyd gan ddarparwr credyd.

source: Plain text or html content for displaying custom message inside credit eligibility email content which is sent when user has met all credit eligibility requirements.
cy: Cynnwys testun plaen neu html ar gyfer arddangos neges ar fesur mewn e-bost cymhwyso am gredyd a anfonir pan fydd defnyddiwr wedi bodloni'r holl ofynion cymhwyso am gredyd.

source: Plain text or html content for displaying custom message inside credit receipt email content which is sent *after* paying to get credit for a credit course.
cy: Cynnwys testun plaen neu html ar gyfer arddangos neges ar fesur mewn e-bost derbynneb gredyd a anfonir *ar ôl* talu i gael credyd am gwrs credyd.

source: Thumbnail image url of the credit provider.
cy: Cryno ddelwedd URL y darparwr credyd.

source: Credit requirement statuses
cy: Statws gofynion credyd

source: Deadline for purchasing and requesting credit.
cy: Dyddiad cau ar gyfer prynu a gofyn am gredyd.

source: Preview Language is currently disabled
cy: Mae'r rhagweld iaith wedi'i analluogi ar hyn o bryd

source: Language code not provided
cy: Ni ddarparwyd côd iaith

source: Language set to language code: {preview_language_code}
cy: Iaith wedi'i gosod i gôd iaith: {preview_language_code}

source: Language reset to the default language code
cy: Iaith wedi'i gosod i'r côd iaith diofyn

source: Language reset to user's preference: {preview_language_code}
cy: Ailosod iaith i ddewis y defnyddiwr: {preview_language_code}

source: COURSE NOT FOUND. Please check that the course ID is valid.
cy: NI DDAETHPWYD O HYD I'R CWRS. Gwiriwch fod gan y cwrs rif adnabod dilys.

source: The course key for the restricted course.
cy: Allwedd y cwrs ar gyfer y cwrs cyfyngedig.

source: The message to show when a user is blocked from enrollment.
cy: Y neges i'w dangos pan gaiff defnyddiwr ei atal rhag cofrestru.

source: The message to show when a user is blocked from accessing a course.
cy: Y neges i'w dangos pan gaiff defnyddiwr ei atal rhag cael mynediad i gwrs.

source: Allow users who enrolled in an allowed country to access restricted courses from excluded countries.
cy: Caniatáu i ddysgwyr a gofrestrodd mewn gwlad a ganiateir i gael mynediad cyfyngedig o wledydd a eithrir.

source: Two character ISO country code.
cy: Côd gwlad ISO dau gymeriad

source: Whether to include or exclude the given course. If whitelist countries are specified, then ONLY users from whitelisted countries will be able to access the course. If blacklist countries are specified, then users from blacklisted countries will NOT be able to access the course.
cy: A ddylid cynnwys neu eithrio'r cwrs penodol. Os nodir gwledydd a ganiateir, yna defnyddwyr o'r gwledydd a ganiateir YN UNIG fydd yn cael mynediad i'r cwrs. Os nodir gwledydd a waherddir, yna NI CHAIFF defnyddwyr o'r gwledydd a waherddir fynediad i'r cwrs.

source: The course to which this rule applies.
cy: Y cwrs mae'r rheol yn berthnasol iddo.

source: The country to which this rule applies.
cy: Y wlad mae'r rheol yn berthnasol iddi.

source: Whitelist {country} for {course}
cy: {country} a ganiateir ar gyfer {course}

source: Blacklist {country} for {course}
cy: {country} a waherddir ar gyfer {course}

source: You have already created an account using an external login like WebAuth or Shibboleth. Please contact {tech_support_email} for support.
cy: Rydych eisoes wedi creu cyfrif yn defnyddio mewngofnodi allanol fel WebAuth neu Shibboleth. Cysylltwch â {tech_support_email} am gefnogaeth.

source: Your university identity server did not return your ID information to us. Please try logging in again. (You may need to restart your browser.)
cy: Ni wnaeth gweinydd adnabod eich prifysgol ddychwelyd eich gwybodaeth adnabod atom. Ceisiwch fewngofnodi eto. (Mae'n bosib y bydd angen i chi ailddechrau eich porwr.)

source: The file must be smaller than {image_max_size} in size.
cy: Rhaid i'r ffeil fod yn llai na {image_max_size} mewn maint.

source: The file must be one of the following types: {valid_file_types}.
cy: Rhaid i'r ffeil fod yn un o'r mathau a ganlyn: {valid_file_types}.

source: The Content-Type header for this file does not match the file data. The file may be corrupted.
cy: Nid yw'r pennawd math o gynnwys ar gyfer y ffeil yma yn cyd-fynd â data'r ffeil. Mae'n bosib bod y ffeil wedi'i llygru.
