Repository: zhulinhai/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: cy

source: Click {em_start}New content group{em_end} to add a new content group. To edit the name of a content group, hover over its box and click {em_start}Edit{em_end}. You can delete a content group only if it is not in use by a unit. To delete a content group, hover over its box and click the delete icon.
cy: Cliciwch ar {em_start}grŵp cynnwys newydd{em_end} i ychwanegu grŵp cynnwys newydd. I olygu enw'r grŵp cynnwys, gwnewch i'r cyrchwr hofran dros y blwch a chlicio {em_start}Golygu{em_end}. Gallwch ddileu grŵp cynnwys os nad yw'n cael ei ddefnyddio gan uned. I ddileu grŵp cynnwys, gwnewch i'r cyrchwr hofran dros y blwch a chlicio'r eicon dileu.

source: Click {em_start}New Group Configuration{em_end} to add a new configuration. To edit a configuration, hover over its box and click {em_start}Edit{em_end}. You can delete a group configuration only if it is not in use in an experiment. To delete a configuration, hover over its box and click the delete icon.
cy: Cliciwch ar {em_start}Ffurfweddiad grŵp newydd{em_end} i ychwanegu ffurfweddiad newydd. I olygu ffurfweddiad, gwnewch i'r cyrchwr hofran dros y blwch a chlicio {em_start}Golygu{em_end}. Gallwch ddileu ffurfweddiad grŵp os nad yw'n cael ei ddefnyddio mewn arbrawf. I ddileu ffurfweddiad, gwnewch i'r cyrchwr hofran dros y blwch a chlicio'r eicon dileu.

source: Details & Schedule
cy: Manylion ac amserlen

source: Welcome
cy: Croeso

source: Welcome to {studio_name}
cy: Croeso i {studio_name}

source: {studio_name} helps manage your online courses, so you can focus on teaching them
cy: Mae {studio_name} yn helpu i reoli eich cyrsiau ar-lein, fel y gallwch chi ganolbwyntio ar eu dysgu

source: {studio_name}'s Many Features
cy: Rhai o nodweddion {studio_name}

source: {studio_name} Helps You Keep Your Courses Organized
cy: Mae {studio_name} yn eich helpu i gadw'ch cyrsiau'n drefnus

source: Enlarge image
cy: Mwyhau delwedd

source: Keeping Your Course Organized
cy: Cadw eich cyrsiau'n drefnus

source: The backbone of your course is how it is organized. {studio_name} offers an {strong_start}Outline{strong_end} editor, providing a simple hierarchy and easy drag and drop to help you and your students stay organized.
cy: Cryfder eich cwrs yw sut caiff ei drefnu. Mae {studio_name} yn cynnig golygydd {strong_start}Outline{strong_end}, yn rhoi hierarchaeth syml ac yn llusgo a gollwch i'ch helpu chi a'ch myfyrwyr i fod yn drefnus.

source: Simple Organization For Content
cy: Trefniadaeth syml ar gyfer cynnwys

source: {studio_name} uses a simple hierarchy of {strong_start}sections{strong_end} and {strong_start}subsections{strong_end} to organize your content.
cy: Mae {studio_name} yn defnyddio hierarchaeth syml ar gyfer {strong_start}adrannau{strong_end} ac {strong_start}is-adrannau{strong_end} er mwyn trefnu eich cynnwys.

source: Change Your Mind Anytime
cy: Gallwch newid eich meddwl pryd bynnag

source: Draft your outline and build content anywhere. Simple drag and drop tools let you reorganize quickly.
cy: Gallwch fraslunio'ch amlinelliad ac adeiladu cynnwys unrhyw le. Mae offer llusgo a gollwng yn caniatáu i chi aildrefnu'n gyflym.

source: Go A Week Or A Semester At A Time
cy: Gwnewch gwerth wythnos neu dymor ar y tro

source: Build and release {strong_start}sections{strong_end} to your students incrementally. You don't have to have it all done at once.
cy: Gallwch adeiladu a rhyddhau {strong_start}adrannau {strong_end} i'ch myfyrwyr yn raddol. Nid oes rhaid i chi wneud y cyfan ar yr un pryd.

source: Learning is More than Just Lectures
cy: Mae dysgu yn fwy na darlithoedd

source: {studio_name} lets you weave your content together in a way that reinforces learning. Insert videos, discussions, and a wide variety of exercises with just a few clicks.
cy: Mae {studio_name} yn caniatáu i chi weadu'ch cynnwys mewn modd sy'n atgyfnerthu dysgu. Rhowch fideos, trafodaethau ac amrywiaeth eang o ymarferion i mewn gyda chlic neu ddau.

source: Create Learning Pathways
cy: Creu llwybrau dysgu

source: Help your students understand one concept at a time with multimedia, HTML, and exercises.
cy: Helpwch eich myfyrwyr i ddeall un cysyniad ar y tro gydag adnoddau amlgyfrwng, HTML ac ymarferion.

source: Work Visually, Organize Quickly
cy: Gweithio'n weledol, gweithio'n gyflym

source: Work visually and see exactly what your students will see. Reorganize all your content with drag and drop.
cy: Rydym yn gweithio'n weledol ac yn gweld yn union beth mae'r myfyrwyr yn ei weld. Yn adnabod eich holl gynnwys gyda llusgo a gollwng.

source: A Broad Library of Problem Types
cy: Llyfrgell eang o fathau o broblemau

source: It's more than just multiple choice. {studio_name} supports more than a dozen types of problems to challenge your learners.
cy: Mae'n fwy nag amlddewis. Mae {studio_name} yn cefnogi mwy na dwsin o wahanol broblemau i herio'ch dysgwyr.

source: {studio_name} Gives You Simple, Fast, and Incremental Publishing. With Friends.
cy: Mae {studio_name} yn rhoi cyhoeddi syml, cyflym a chynyddrannol. Gyda ffrindiau.

source: Simple, Fast, and Incremental Publishing. With Friends.
cy: Cyhoeddi syml, cyflym a chynyddrannol. Gyda ffrindiau.

source: {studio_name} works like web applications you already know, yet understands how you build curriculum. Instant publishing to the web when you want it, incremental release when it makes sense. And with co-authors, you can have a whole team building a course, together.
cy: Mae {studio_name} yn gweithio fel cymwysiadau gwe rydych eisoes yn eu hadnabod, ac eto mae'n deall sut mae adeiladu cwricwlwm. Mae'n cyhoeddi uniongyrchol i'r we pan fyddwch yn dymuno, ac yn rhyddhau'n raddol pan yn synhwyrol A gyda chyd-awduron, gallwch gael tîm cyfan yn llunio cwrs gyda'i gilydd.

source: Instant Changes
cy: Newidiadau syth bin

source: Caught a bug? No problem. When you want, your changes go live when you click Save.
cy: Wedi dal byg? Dim problem. Cyhoeddi rhyddhau ar ddiwrnod

source: Release-On Date Publishing
cy: Cyhoeddi rhyddhau ar ddiwrnod

source: When you've finished a {strong_start}section{strong_end}, pick when you want it to go live and {studio_name} takes care of the rest. Build your course incrementally.
cy: Wedi i chi orffen {strong_start}adran{strong_end}, dewiswch pryd hoffech iddo fod yn fyw a bydd {studio_name} yn gofalu am y gweddill. Adeiladwch eich cwrs yn gynyddrannol

source: Work in Teams
cy: Gweithio mewn timau

source: Co-authors have full access to all the same authoring tools. Make your course better through a team effort.
cy: Mae gan gyd-awduron fynediad llawn i'r holl offer awduro. Gwnewch eich cwrs yn well drwy weithio fel tîm.

source: Sign Up for {studio_name} Today!
cy: Cofrestru ar gyfer {studio_name} heddiw!

source: Sign Up & Start Making Your {platform_name} Course
cy: Cofrestru a dechrau creu eich cwrs {platform_name}

source: Already have a {studio_name} Account? Sign In
cy: Gennych gyfrif {studio_name} eisoes? Mewngofnodi

source: Outlining Your Course
cy: Amlinelliad o'ch cwrs

source: Simple two-level outline to organize your course. Drag and drop, and see your course at a glance.
cy: Amlinelliad dwy lefel syml wrth drefnu eich cwrs. Llusgo a gollwng i weld cipolwg ar eich cwrs.

source: More than Just Lectures
cy: Mwy na darlithoedd yn unig

source: Quickly create videos, text snippets, inline discussions, and a variety of problem types.
cy: Ewch ati i greu fideos, pytiau o destun ac amrywiaeth o broblemau gwahanol.

source: Publishing on Date
cy: Yn cyhoeddi ar ddyddiad

source: Simply set the date of a section or subsection, and {studio_name} will publish it to your students for you.
cy: Gosodwch ddyddiad ar gyfer adran neu is-adran a bydd {studio_name} yn ei gyhoeddi i'ch myfyrwyr ar eich rhan.

source: We're having trouble rendering your component
cy: Rydym yn cael trafferth wrth rendro eich cydran.

source: Students will not be able to access this component. Re-edit your component to fix the error.
cy: Ni fydd y myfyrwyr yn gallu cael mynediad i'r gydran hon. Ailolygwch eich cydran i gywiro'r gwall.

source: Library Import
cy: Mewnforio llyfrgell

source: Course Import
cy: Mewnforio cwrs

source: Be sure you want to import a library before continuing. The contents of the imported library will replace the contents of the existing library. {em_start}You cannot undo a library import{em_end}. Before you proceed, we recommend that you export the current library, so that you have a backup copy of it.
cy: Byddwch yn siŵr eich bod am fewnforio llyfrgell cyn parhau. Bydd cynnwys y llyfrgell a gaiff ei mewnforio yn cymryd lle cynnwys llyfrgell sy'n bodoli. {em_start}Ni allwch ddadwneud mewnforio llyfrgell{em_end}. Cyn i chi fwrw ymlaen, argymhellwn eich bod yn allforio'r llyfrgell, fel bod gennych gopi wrth gefn ohoni.

source: The library that you import must be in a .tar.gz file (that is, a .tar file compressed with GNU Zip). This .tar.gz file must contain a library.xml file. It may also contain other files.
cy: Rhaid i'r llyfrgell rydych yn ei mewnforio fod yn ffeil .tar.gz (hynny ydy, ffeil .tar wedi'i chywasgu gyda GNU Zip). Rhaid i'r ffeil .tar.gz hwn gynnwys ffeil llyfrgell .xml. Gall hefyd gynnwys ffeiliau eraill.

source: The import process has five stages. During the first two stages, you must stay on this page. You can leave this page after the Unpacking stage has completed. We recommend, however, that you don't make important changes to your library until the import operation has completed.
cy: Mae gan y broses fewnforio bum cam. Yn ystod y ddau gam cyntaf, rhaid i chi aros ar y dudalen hon. Gallwch adael y dudalen hon ar ôl cwblhau'r cam dadbacio. Rydym yn argymell fodd bynnag, nad ydych yn gwneud newidiadau pwysig i'ch llyfrgell hyd nes bod y broses mewnforio wedi'i chwblhau.

source: Be sure you want to import a course before continuing. The contents of the imported course will replace the contents of the existing course. {em_start}You cannot undo a course import{em_end}. Before you proceed, we recommend that you export the current course, so that you have a backup copy of it.
cy: Byddwch yn siŵr eich bod am fewnforio cwrs cyn parhau. Bydd cynnwys y cwrs a gaiff ei fewnforio yn cymryd lle cynnwys y cwrs sy'n bodoli. {em_start}Ni allwch ddadwneud mewnforio cwrs{em_end}. Cyn i chi fwrw ymlaen, argymhellwn eich bod yn allforio'r cwrs cyfredol, fel bod gennych gopi wrth gefn ohono.

source: The course that you import must be in a .tar.gz file (that is, a .tar file compressed with GNU Zip). This .tar.gz file must contain a course.xml file. It may also contain other files.
cy: Rhaid i'r cwrs rydych yn ei fewnforio fod yn ffeil .tar.gz (hynny ydy, ffeil .tar wedi'i chywasgu gyda GNU Zip). Rhaid i'r ffeil .tar.gz hwn gynnwys ffeil cwrs .xml. Gall hefyd gynnwys ffeiliau eraill.

source: The import process has five stages. During the first two stages, you must stay on this page. You can leave this page after the Unpacking stage has completed. We recommend, however, that you don't make important changes to your course until the import operation has completed.
cy: Mae gan y broses fewnforio bum cam. Yn ystod y ddau gam cyntaf, rhaid i chi aros ar y dudalen hon. Gallwch adael y dudalen hon ar ôl cwblhau'r cam dadbacio. Rydym yn argymell fodd bynnag, nad ydych yn gwneud newidiadau pwysig i'ch y cwrs hyd nes bod y broses mewnforio wedi'i chwblhau.

source: Select a .tar.gz File to Replace Your Library Content
cy: Dewiswch ffeil .tar.gz i amnewid cynnwys eich llyfrgell

source: Select a .tar.gz File to Replace Your Course Content
cy: Dewiswch ffeil .tar.gz i amnewid cynnwys eich cwrs

source: Choose a File to Import
cy: Dewis ffeil i'w mewnforio

source: File Chosen:
cy: Y ffeil a ddewiswyd:

source: Replace my library with the selected file
cy: Amnewid fy llyfrgell gyda'r ffeil a ddewiswyd

source: Replace my course with the selected file
cy: Amnewid fy nghwrs gyda'r ffeil a ddewiswyd

source: Library Import Status
cy: Statws mewnforio'r llyfrgell

source: Course Import Status
cy: Statws mewnforio'r cwrs

source: Transferring your file to our servers
cy: Yn trosglwyddo eich ffeil i'n gweinyddion

source: Unpacking
cy: Dadbacio

source: Expanding and preparing folder/file structure (You can now leave this page safely, but avoid making drastic changes to content until this import is complete)
cy: Ehangu a pharatoi strwythur ffolder/ffeil (Gallwch nawr adael y dudalen hon yn ddiogel, ond ceisiwch osgoi wneud newidiadau sylweddol i'r cynnwys hyd nes bod y mewnforio wedi'i gwblhau)

source: Verifying
cy: Yn gwirio

source: Reviewing semantics, syntax, and required data
cy: Adolygu semanteg, cystrawen a data gofynnol

source: Updating Library
cy: Diweddaru'r llyfrgell

source: Updating Course
cy: Diweddaru'r cwrs

source: Integrating your imported content into this library. This process might take longer with larger libraries.
cy: Ymgyfuno'r cynnwys a fewnforiwyd i mewn i'r llyfrgell hon. Mae'n bosib y bydd y broses hon yn cymryd yn hwy gyda llyfrgelloedd mwy.

source: Integrating your imported content into this course. This process might take longer with larger courses.
cy: Ymgyfuno'r cynnwys a fewnforiwyd i mewn i'r cwrs hwn. Mae'n bosib y bydd y broses hon yn cymryd yn hwy gyda chyrsiau mwy.

source: Your imported content has now been integrated into this library
cy: Mae'r cynnwys a fewnforiwyd bellach wedi'i ymgyfuno yn y llyfrgell hon

source: Your imported content has now been integrated into this course
cy: Mae'r cynnwys a fewnforiwyd bellach wedi'i ymgyfuno yn y cwrs hwn

source: View Updated Library
cy: Gweld y llyfrgell wedi'i diweddaru

source: View Updated Outline
cy: Gweld yr amlinelliad wedi'i ddiweddaru

source: Why import a library?
cy: Pam mewnforio llyfrgell?

source: You might want to update an existing library to a new version, or replace an existing library entirely. You might also have developed a library outside of {studio_name}.
cy: Efallai eich bod am ddiweddaru llyfrgell sydd eisoes yn bodoli gyda fersiwn newydd, neu amnewid llyfrgell yn llwyr. Efallai eich bod hefyd wedi datblygu llyfrgell y tu allan i {studio_name}.

source: Note: Library content is not automatically updated in courses
cy: Sylwer: Nid yw cynnwys llyfrgell yn cael ei ddiweddaru'n awtomataidd gyda chyrsiau

source: If you change and import a library that is referenced by randomized content blocks in one or more courses, those courses do not automatically use the updated content. You must manually refresh the randomized content blocks to bring them up to date with the latest library content.
cy: Os byddwch yn newid ac yn mewnforio llyfrgell a gaiff ei gyfeirio gan flociau cynnwys ar hap mewn un neu fwy o gyrsiau, nid yw'r cyrsiau hynny'n defnyddio'r cynnwys a ddiweddarwyd yn awtomataidd. Rhaid i chi ail-wneud y blociau cynnwys ar hap eich hun i sicrhau eu bod yn gyfoes â chynnwys diweddaraf y llyfrgell.

source: Learn more about importing a library
cy: Dysgu mwy am fewnforio llyfrgell

source: Why import a course?
cy: Pam mewnforio cwrs?

source: You may want to run a new version of an existing course, or replace an existing course altogether. Or, you may have developed a course outside {studio_name}.
cy: Efallai eich bod am gynnal fersiwn newydd o gwrs sydd eisoes yn bodoli, neu amnewid am gwrs arall yn llwyr. Neu, efallai eich bod wedi datblygu cwrs y tu allan i {studio_name}.

source: What content is imported?
cy: Pa gynnwys aiff ei fewnforio?

source: Only the course content and structure (including sections, subsections, and units) are imported. Other data, including student data, grading information, discussion forum data, course settings, and course team information, remains the same as it was in the existing course.
cy: Cynnwys a strwythur y cwrs (gan gynnwys adrannau, is-adrannau ac unedau) yn unig a gaiff eu mewnforio. Mae data arall, gan gynnwys data myfyrwyr, gwybodaeth graddio, data fforymau trafodaeth, gosodiadau cyrsiau a gwybodaeth tîm cyrsiau yn aros yr un fath ag yr oeddent yn y cwrs.

source: Warning: Importing while a course is running
cy: Rhybudd: Mewnforio wrth i gwrs redeg

source: If you perform an import while your course is running, and you change the URL names (or url_name nodes) of any Problem components, the student data associated with those Problem components may be lost. This data includes students' problem scores.
cy: Os byddwch yn mewnforio wrth i gwrs redeg, ac yn newid enwau URL (neu nodau url_name) unrhyw gydran problem, gall data'r myfyrwyr sy'n gysylltiedig â'r gydran honno o'r broblem yn diflannu. Mae'r data hyn yn cynnwys sgoriau problemau myfyrwyr.

source: Learn more about importing a course
cy: Dysgu mwy am fewnforio cwrs

source: {studio_name} Home
cy: Cartref {studio_name}

source: New Course
cy: Cwrs newydd

source: Email staff to create course
cy: E-bostio staff i greu cwrs

source: New Library
cy: Llyfrgell newydd

source: Please correct the highlighted fields below.
cy: Cywirwch y meysydd a amlygwyd uchod.

source: Create a New Course
cy: Creu cwrs newydd

source: Required Information to Create a New Course
cy: Gwybodaeth ofynnol i greu cwrs newydd

source: The public display name for your course. This cannot be changed, but you can set a different display name in Advanced Settings later.
cy: Enw'r cwrs a ddangosir yn gyhoeddus. Ni ellir newid hyn, ond gallwch osod enw arddangos gwahanol trwy'r gosodiadau uwch nes ymlaen.

source: The name of the organization sponsoring the course. {strong_start}Note: The organization name is part of the course URL.{strong_end} This cannot be changed, but you can set a different display name in Advanced Settings later.
cy: Enw'r sefydliad sy'n noddi'r cwrs. {strong_start}Sylwer: Mae enw'r sefydliad yn rhan o URL y cwrs.{strong_end} Ni ellir newid hyn, ond gallwch osod enw arddangos gwahanol trwy'r gosodiadau uwch nes ymlaen.

source: The unique number that identifies your course within your organization. {strong_start}Note: This is part of your course URL, so no spaces or special characters are allowed and it cannot be changed.{strong_end}
cy: Y rhif unigryw sy'n nodi'ch cwrs o fewn sefydliad. {strong_start}Sylwer: Mae hwn yn rhan o URL eich cwrs, felly ni chaniateir unrhyw fylchau neu gymeriadau arbennig ac ni ellir ei newid.{strong_end}

source: The term in which your course will run. {strong_start}Note: This is part of your course URL, so no spaces or special characters are allowed and it cannot be changed.{strong_end}
cy: Y tymor y cynhelir eich cwrs ynddo. {strong_start}Sylwer: Mae hwn yn rhan o URL eich cwrs, felly ni chaniateir unrhyw fylchau neu gymeriadau arbennig ac ni ellir ei newid.{strong_end}

source: Create
cy: Creu

source: Create a New Library
cy: Creu llyfrgell newydd

source: Required Information to Create a New Library
cy: Gwybodaeth ofynnol i greu llyfrgell newydd

source: Library Name
cy: Enw'r llyfrgell

source: e.g. Computer Science Problems
cy: e.e. Problemau cyfrifiadureg

source: The public display name for your library.
cy: Enw'r llyfrgell a ddangosir yn gyhoeddus.

source: The public organization name for your library.
cy: Enw'r sefydliad cyhoeddus ar eich llyfrgell.

source: This cannot be changed.
cy: Ni ellir newid hwn.

source: Library Code
cy: Côd y llyfrgell

source: e.g. CSPROB
cy: e.e. CSPROB

source: The unique code that identifies this library. {strong_start}Note: This is part of your library URL, so no spaces or special characters are allowed.{strong_end} This cannot be changed.
cy: Y côd unigryw sy'n dynodi'r llyfrgell hon. {strong_start}Sylwer: Mae hwn yn rhan o URL eich llyfrgell, felly ni chaniateir unrhyw fylchau neu gymeriadau arbennig.{strong_end} Ni ellir ei newid.

source: Courses Being Processed
cy: Cyrsiau sy'n cael eu prosesu

source: Course Run:
cy: Rhediad y cwrs:

source: This course run is currently being created.
cy: Mae cwrs hwn yn cael ei greu ar hyn o bryd.

source: Configuring as re-run
cy: Ffurfweddu fel ail-rediad

source: The new course will be added to your course list in 5-10 minutes. Return to this page or {link_start}refresh it{link_end} to update the course list. The new course will need some manual configuration.
cy: Bydd y cwrs newydd yn cael ei ychwanegu i restr eich cwrs mewn 5-10 munud. Dychwelyd i'r dudalen hon neu {link_start}ei ailwneud{link_end} i ddiweddaru rhestr y cyrsiau. Bydd angen peth ffurfweddu eich hun ar y cwrs newydd.

source: This re-run processing status:
cy: Statws prosesu'r ail-rediad:

source: Configuration Error
cy: Gwall ffurfweddu

source: A system error occurred while your course was being processed. Please go to the original course to try the re-run again, or contact your PM for assistance.
cy: Cafwyd gwall system wrth brosesu'ch cwrs. Ewch i'r cwrs gwreiddiol i geisio ail-redeg eto, neu gysylltu â'ch PM am gymorth.

source: Libraries
cy: Llyfrgelloedd

source: Re-run Course
cy: Ail-redeg cwrs

source: Are you staff on an existing {studio_name} course?
cy: Ydych chi'n staff ar gwrs {studio_name} eisoes?

source: The course creator must give you access to the course. Contact the course creator or administrator for the course you are helping to author.
cy: Rhaid i luniwr y cwrs rhoi mynediad i'r cwrs i chi. Cysylltwch â lluniwr y cwrs neu weinyddydd y cwrs rydych yn helpu i'w awduro.

source: Create Your First Course
cy: Creu eich cwrs cyntaf

source: Your new course is just a click away!
cy: Mae eich cwrs newydd ond clic i ffwrdd!

source: Becoming a Course Creator in {studio_name}
cy: Dod yn luniwr cyrsiau gyda {studio_name}

source: {studio_name} is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by {platform_name}. Our team will evaluate your request and provide you feedback within 24 hours during the work week.
cy: Datrysiad letyol yw {studio_name} ar gyfer ein partneriaid xConsortium a gwesteion dethol. Mae'r cyrsiau rydych yn aelod tîm ohonynt uchod er mwyn i chi eu golygu, ac mae breintiau creu cwrs yn cael eu rhoi drwy {platform_name}. Bydd ein tîm yn gwerthuso eich cais ac yn rhoi adborth o fewn 24 awr yn ystod yr wythnos waith.

source: Your Course Creator Request Status:
cy: Statws ceisiadau lluniwr eich cwrs:

source: Request the Ability to Create Courses
cy: Gofyn am y gallu i greu cyrsiau

source: Your Course Creator Request Status
cy: Statws ceisiadau lluniwr eich cwrs

source: {studio_name} is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by {platform_name}. Our team is has completed evaluating your request.
cy: Datrysiad letyol yw {studio_name} ar gyfer ein partneriaid xConsortium a gwesteion dethol. Mae'r cyrsiau rydych yn aelod tîm ohonynt uchod er mwyn i chi eu golygu, ac mae breintiau creu cwrs yn cael eu rhoi drwy {platform_name}. Mae ein tîm wedi cwblhau gwerthuso eich cais.

source: Your Course Creator request is:
cy: Cais lluniwr eich cwrs yw:

source: Your request did not meet the criteria/guidelines specified by {platform_name} Staff.
cy: Ni wnaeth eich cais fodloni'r meini prawf/arweiniad a nodwyd gan staff {platform_name}.

source: {studio_name} is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by {platform_name}. Our team is currently evaluating your request.
cy: Datrysiad letyol yw {studio_name} ar gyfer ein partneriaid xConsortium a gwesteion dethol. Mae'r cyrsiau rydych yn aelod tîm ohonynt uchod er mwyn i chi eu golygu, ac mae breintiau creu cwrs yn cael eu rhoi drwy {platform_name}. Mae ein tîm yn gwerthuso eich cais ar hyn o bryd.
