Repository: zhulinhai/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: cy

source: Sorry! Our payment processor sent us back a corrupted message regarding your charge, so we are unable to validate that the message actually came from the payment processor. The specific error message is: {error_message}. We apologize that we cannot verify whether the charge went through and take further action on your order. Your credit card may possibly have been charged. Contact us with payment-specific questions at {email}.
cy: Mae'n flin gennym! Mae ein prosesydd taliadau wedi anfon neges lygredig yn ôl atom ynghylch eich taliad, felly ni allwn ddilysu bod y neges wedi dod gan y prosesydd taliadau. Y neges wall benodol yw: {error_message}. Ymddiheurwn na fedrwn wirio a fu'r taliad yn llwyddiannus felly ni fyddwn yn gweithredu'n bellach gyda'ch archeb. Mae'n bosib y codwyd tâl ar eich cerdyn credyd. Cysylltwch â ni gyda chwestiynau penodol am daliadau yn {email}.

source: Successful transaction.
cy: Trafodyn llwyddiannus.

source: The request is missing one or more required fields.
cy: Mae'r cais gydag un maes gofynnol neu fwy yn wag.

source: One or more fields in the request contains invalid data.
cy: Mae un neu fwy o feysydd yn y cais yn cynnwys data annilys.

source: The merchantReferenceCode sent with this authorization request matches the merchantReferenceCode of another authorization request that you sent in the last 15 minutes. Possible fix: retry the payment after 15 minutes.
cy: Mae'r merchantReferenceCode a anfonwyd gyda'r cais awdurdodi hwn yn cyd-fynd â merchantReferenceCode cais awdurdodi arall a wnaethoch ei anfon yn y 15 munud diwethaf. Cywiriad posib: ailgeisio talu ar ôl 15 munud.

source: Error: General system failure. Possible fix: retry the payment after a few minutes.
cy: Gwall: Y system yn methu'n gyffredinol. Cywiriad posib: ailgeisio talu ar ôl ychydig funudau.

source: Error: The request was received but there was a server timeout. This error does not include timeouts between the client and the server. Possible fix: retry the payment after some time.
cy: Gwall: Derbyniwyd y cais ond daeth amser y gweinydd i ben. Nid yw'r gwall hwn yn cynnwys unrhyw amser a ddaeth i ben rhwng y cleient a'r gweinydd. Cywiriad posib: ailgeisio talu ar ôl peth amser.

source: Error: The request was received, but a service did not finish running in time Possible fix: retry the payment after some time.
cy: Gwall: Derbyniwyd y cais, ond ni wnaeth gwasanaeth orffen rhedeg o fewn yr amser Cywiriad posib: ailgeisio talu ar ôl peth amser.

source: The issuing bank has questions about the request. Possible fix: retry with another form of payment
cy: Mae gan y banc dyroddi gwestiynau ynghylch y cais. Cywiriad posib: ailgeisio talu rywsut arall

source: Expired card. You might also receive this if the expiration date you provided does not match the date the issuing bank has on file. Possible fix: retry with another form of payment
cy: Cerdyn wedi dod i ben. Mae'n bosib y derbyniwch hwn hefyd os yw'r dyddiad terfyn y gwnaethoch ei ddarparu yn cyd-fynd â'r dyddiad sydd gan y banc dyroddi ar gadw. Cywiriad posib: ailgeisio talu rywsut arall

source: General decline of the card. No other information provided by the issuing bank. Possible fix: retry with another form of payment
cy: Gwrthodiad cyffredinol y cerdyn. Ni chafwyd gwybodaeth arall gan y banc dyroddi. Cywiriad posib: ailgeisio talu rywsut arall

source: Insufficient funds in the account. Possible fix: retry with another form of payment
cy: Nid oes digon o arian yn y cyfrif. Cywiriad posib: ailgeisio talu rywsut arall

source: Unknown reason
cy: Rheswm anhysbys

source: Issuing bank unavailable. Possible fix: retry again after a few minutes
cy: Banc dyroddi heb fod ar gael. Cywiriad posib: ceisio eto ar ôl ychydig funudau

source: Inactive card or card not authorized for card-not-present transactions. Possible fix: retry with another form of payment
cy: Cerdyn anactif neu gerdyn heb ei awdurdodi ar gyfer trafodion lle nad yw'r cerdyn yn bresennol. Cywiriad posib: ailgeisio talu rywsut arall

source: The card has reached the credit limit. Possible fix: retry with another form of payment
cy: Mae'r cerdyn wedi cyrraedd ei derfyn credyd. Cywiriad posib: ailgeisio talu rywsut arall

source: Invalid card verification number. Possible fix: retry with another form of payment
cy: Rhif gwirio cerdyn annilys. Cywiriad posib: ailgeisio talu rywsut arall

source: Invalid account number. Possible fix: retry with another form of payment
cy: Rhif cyfrif annilys. Cywiriad posib: ailgeisio talu rywsut arall

source: The card type is not accepted by the payment processor. Possible fix: retry with another form of payment
cy: Nid yw prosesydd y taliad yn derbyn y cerdyn hwn. Cywiriad posib: ailgeisio talu rywsut arall

source: General decline by the processor. Possible fix: retry with another form of payment
cy: Gwrthodiad cyffredinol gan y prosesydd Cywiriad posib: ailgeisio talu rywsut arall

source: There is a problem with our CyberSource merchant configuration. Please let us know at {0}
cy: Ceir problem gyda'n ffurfweddiad masnachwr CyberSource. Rhowch wybod i ni yn {0}

source: The requested amount exceeds the originally authorized amount.
cy: Mae'r swm a ofynnwyd amdano yn fwy na'r swm a awdurdodwyd yn wreiddiol.

source: Processor Failure. Possible fix: retry the payment
cy: Prosesydd wedi methu. Cywiriad posib: ailgeisio talu

source: The authorization has already been captured
cy: Mae'r awdurdodiad eisoes wedi cael ei gipio

source: The requested transaction amount must match the previous transaction amount.
cy: Rhaid i swm y trafodyn a geisir gyd-fynd â swm y trafodyn blaenorol.

source: The card type sent is invalid or does not correlate with the credit card number. Possible fix: retry with the same card or another form of payment
cy: Mae math y cerdyn yn annilys neu nid yw'n cyd-fynd â rhif y cerdyn credyd. Cywiriad posib: ailgeisio gyda'r un cerdyn neu ddull arall o dalu

source: The request ID is invalid.
cy: Mae rhif adnabod y cais yn annilys.

source: You requested a capture through the API, but there is no corresponding, unused authorization record.
cy: Gwnaethoch gais am gipio drwy'r API, ond nid oes unrhyw gofnod o awdurdodiad cyfatebol, heb ei ddefnyddio.

source: The transaction has already been settled or reversed.
cy: Mae'r trafodyn eisoes wedi cael ei setlo neu ei ddychwelyd.

source: The capture or credit is not voidable because the capture or credit information has already been submitted to your processor. Or, you requested a void for a type of transaction that cannot be voided.
cy: Ni ellir dirymu'r cipiad na'r credyd am fod gwybodaeth y cipiad neu'r credyd eisoes wedi cael ei gyflwyno i'ch prosesydd. Neu, gofynnoch am ddirymu math o drafodyn na ellir ei ddirymu.

source: You requested a credit for a capture that was previously voided
cy: Gofynnoch am gredyd am gipiad a ddirymwyd eisoes

source: Error: The request was received, but there was a timeout at the payment processor. Possible fix: retry the payment.
cy: Gwall: Derbyniwyd y cais ond daeth amser y prosesydd taliadau i ben. Cywiriad posib: ailgeisio talu.

source: The authorization request was approved by the issuing bank but declined by CyberSource.' Possible fix: retry with a different form of payment.
cy: cafodd y cais awdurdodi ei gymeradwyo gan y banc dyroddi ond ei wrthod gan CyberSource.' Cywiriad posib: ailgeisio talu rywsut arall.

source: UNKNOWN REASON
cy: RHESWM ANHYSBYS

source: The payment processor did not return a required parameter: {parameter}
cy: Ni wnaeth y prosesydd taliadau ddychwelyd paramedr gofynnol: {parameter}

source: The amount charged by the processor {charged_amount} {charged_amount_currency} is different than the total cost of the order {total_cost} {total_cost_currency}.
cy: Mae'r swm a godwyd gan y prosesydd {charged_amount} {charged_amount_currency} yn wahanol i gyfanswm cost yr archeb {total_cost} {total_cost_currency}.

source: Sorry! Our payment processor did not accept your payment. The decision they returned was {decision}, and the reason was {reason}. You were not charged. Please try a different form of payment. Contact us with payment-related questions at {email}.
cy: Mae'n flin gennym! Ni wnaeth prosesydd ein taliadau dderbyn eich taliad. Y penderfyniad a gafwyd oedd {decision}, a'r rheswm oedd {reason}. Ni chodwyd tâl arnoch. Ceisiwch dalu rhywsut arall. Cysylltwch â ni gyda chwestiynau am daliadau yn {email}.

source: Sorry! Our payment processor sent us back a payment confirmation that had inconsistent data! We apologize that we cannot verify whether the charge went through and take further action on your order. The specific error message is: {msg} Your credit card may possibly have been charged. Contact us with payment-specific questions at {email}.
cy: Mae'n flin gennym! Anfonodd ein prosesydd taliadau gadarnhad talu yn ôl atom a oedd yn cynnwys data anghyson! Ymddiheurwn na fedrwn wirio a fu'r taliad yn llwyddiannus felly ni fyddwn yn gweithredu'n bellach gyda'ch archeb. Y neges wall benodol yw: {msg}Mae'n bosib y codwyd tâl ar eich cerdyn credyd. Cysylltwch â ni gyda chwestiynau penodol am daliadau yn {email}.

source: Sorry! Due to an error your purchase was charged for a different amount than the order total! The specific error message is: {msg}. Your credit card has probably been charged. Contact us with payment-specific questions at {email}.
cy: Mae'n flin gennym! Oherwydd gwall codwyd tâl gwahanol i gyfanswm eich archeb! Y neges wall benodol yw: {msg}. Mwy na thebyg codwyd tâl ar eich cerdyn credyd. Cysylltwch â ni gyda chwestiynau penodol am daliadau yn {email}.

source: Sorry! Our payment processor sent us back a corrupted message regarding your charge, so we are unable to validate that the message actually came from the payment processor. The specific error message is: {msg}. We apologize that we cannot verify whether the charge went through and take further action on your order. Your credit card may possibly have been charged. Contact us with payment-specific questions at {email}.
cy: Mae'n flin gennym! Mae ein prosesydd taliadau wedi anfon neges lygredig yn ôl atom ynghylch eich taliad, felly ni allwn ddilysu bod y neges wedi dod gan y prosesydd taliadau. Y neges wall benodol yw: {msg}. Ymddiheurwn na fedrwn wirio a fu'r taliad yn llwyddiannus felly ni fyddwn yn gweithredu'n bellach gyda'ch archeb. Mae'n bosib y codwyd tâl ar eich cerdyn credyd. Cysylltwch â ni gyda chwestiynau penodol am daliadau yn {email}.

source: Sorry! Our payment processor sent us back a message saying that you have cancelled this transaction. The items in your shopping cart will exist for future purchase. If you feel that this is in error, please contact us with payment-specific questions at {email}.
cy: Mae'n flin gennym! Anfonodd ein prosesydd taliadau neges yn ôl atom yn nodi eich bod wedi canslo'r trafodyn hwn. Bydd yr eitemau yn eich troli siopa yn aros yno i chi eu prynu yn y dyfodol. Os credwch mai gwall yw hyn, cysylltwch â ni gyda chwestiynau penodol am daliadau yn {email}.

source: We're sorry, but this payment was declined. The items in your shopping cart have been saved. If you have any questions about this transaction, please contact us at {email}.
cy: Mae'n flin gennym, ond gwrthodwyd y taliad. Mae'r eitemau yn eich troli siopa wedi cael eu cadw. Os oes gennych unrhyw gwestiynau am y trafodyn hyn, cysylltwch â ni yn {email}.

source: Sorry! Your payment could not be processed because an unexpected exception occurred. Please contact us at {email} for assistance.
cy: Mae'n flin gennym! Nid oedd hi'n bosib prosesu eich taliad oherwydd cafwyd eithriad annisgwyl. Cysylltwch â ni yn {email} am gymorth.

source: The merchant reference code for this authorization request matches the merchant reference code of another authorization request that you sent within the past 15 minutes. Possible action: Resend the request with a unique merchant reference code.
cy: Mae côd cyfeirio'r cais awdurdodi hwn yn cyd-fynd â chôd masnachwr cais awdurdodi arall a wnaethoch ei anfon yn y 15 munud diwethaf. Gweithred bosib: Ail-anfon y cais gyda chôd cyfeirio masnachwr unigryw.

source: Only a partial amount was approved.
cy: Rhan o'r swm yn unig a gymeradwywyd.

source: General system failure.
cy: Y system yn methu'n gyffredinol.

source: The request was received but there was a server timeout. This error does not include timeouts between the client and the server.
cy: Derbyniwyd y cais ond daeth amser y gweinydd i ben. Nid yw'r gwall hwn yn cynnwys unrhyw amser a ddaeth i ben rhwng y cleient a'r gweinydd.

source: The request was received, but a service did not finish running in time.
cy: Derbyniwyd y cais, ond ni wnaeth gwasanaeth orffen rhedeg o fewn yr amser.

source: The authorization request was approved by the issuing bank but declined by CyberSource because it did not pass the Address Verification System (AVS).
cy: Cafodd y cais awdurdodi ei gymeradwyo gan y banc dyroddi ond ei wrthod gan CyberSource am na basiodd y system wirio cyfeiriad (AVS).

source: The issuing bank has questions about the request. You do not receive an authorization code programmatically, but you might receive one verbally by calling the processor. Possible action: retry with another form of payment.
cy: Mae gan y banc dyroddi gwestiynau ynghylch y cais. Nid ydych yn derbyn côd awdurdodi yn rhaglennol, ond gallwch dderbyn un yn llafar drwy alw'r prosesydd. Gweithred bosib: ailgeisio talu rywsut arall.

source: Expired card. You might also receive this if the expiration date you provided does not match the date the issuing bank has on file. Possible action: retry with another form of payment.
cy: Cerdyn wedi dod i ben. Mae'n bosib y derbyniwch hwn hefyd os yw'r dyddiad terfyn y gwnaethoch ei ddarparu yn cyd-fynd â'r dyddiad sydd gan y banc dyroddi ar gadw. Gweithred bosib: ailgeisio talu rywsut arall.

source: General decline of the card. No other information provided by the issuing bank. Possible action: retry with another form of payment.
cy: Gwrthodiad cyffredinol y cerdyn. Ni chafwyd gwybodaeth arall gan y banc dyroddi. Gweithred bosib: ailgeisio talu rywsut arall.

source: Insufficient funds in the account. Possible action: retry with another form of payment.
cy: Nid oes digon o arian yn y cyfrif. Gweithred bosib: ailgeisio talu rywsut arall.

source: Stolen or lost card.
cy: Cerdyn coll neu wedi'i ddwyn.

source: Issuing bank unavailable. Possible action: retry again after a few minutes.
cy: Banc dyroddi heb fod ar gael. Gweithred bosib: ceisio eto ar ôl ychydig funudau.

source: Inactive card or card not authorized for card-not-present transactions. Possible action: retry with another form of payment.
cy: Cerdyn anactif neu gerdyn heb ei awdurdodi ar gyfer trafodion lle nad yw'r cerdyn yn bresennol. Gweithred bosib: ailgeisio talu rywsut arall.

source: CVN did not match.
cy: Nid oedd y rhif CVN yn cyfateb.

source: The card has reached the credit limit. Possible action: retry with another form of payment.
cy: Mae'r cerdyn wedi cyrraedd ei derfyn credyd. Gweithred bosib: ailgeisio talu rywsut arall.

source: Invalid card verification number (CVN). Possible action: retry with another form of payment.
cy: Rhif gwirio cerdyn (CVN) annilys. Gweithred bosib: ailgeisio talu rywsut arall.

source: The customer matched an entry on the processors negative file.
cy: Gwnaeth y cwsmer gyd-fynd â chofnod ar ffeil negyddol y prosesydd.

source: Account frozen. Possible action: retry with another form of payment.
cy: Cyfrif wedi'i rewi. Gweithred bosib: ailgeisio talu rywsut arall.

source: The authorization request was approved by the issuing bank but declined by CyberSource because it did not pass the CVN check. Possible action: retry with another form of payment.
cy: Cafodd y cais awdurdodi ei gymeradwyo gan y banc dyroddi ond ei wrthod gan CyberSource am iddo fethu'r gwiriad CVN. Gweithred bosib: ailgeisio talu rywsut arall.

source: Invalid account number. Possible action: retry with another form of payment.
cy: Rhif cyfrif annilys. Gweithred bosib: ailgeisio talu rywsut arall.

source: The card type is not accepted by the payment processor. Possible action: retry with another form of payment.
cy: Nid yw prosesydd y taliad yn derbyn y cerdyn hwn. Gweithred bosib: ailgeisio talu rywsut arall.

source: General decline by the processor. Possible action: retry with another form of payment.
cy: Gwrthodiad cyffredinol gan y prosesydd Gweithred bosib: ailgeisio talu rywsut arall.

source: There is a problem with the information in your CyberSource account. Please let us know at {0}
cy: Mae problem gyda'r wybodaeth yn eich cyfrif CyberSource. Rhowch wybod i ni yn {0}

source: The requested capture amount exceeds the originally authorized amount.
cy: Mae'r swm a ofynnwyd amdano yn fwy na'r swm a awdurdodwyd yn wreiddiol.

source: Processor Failure. Possible action: retry the payment
cy: Prosesydd wedi methu. Gweithred bosib: ailgeisio talu

source: The authorization has already been reversed.
cy: Mae'r awdurdodiad eisoes wedi cael ei wrthdroi.

source: The authorization has already been captured.
cy: Mae'r awdurdodiad eisoes wedi cael ei gipio.

source: The card type sent is invalid or does not correlate with the credit card number. Possible action: retry with the same card or another form of payment.
cy: Mae math y cerdyn yn annilys neu nid yw'n cyd-fynd â rhif y cerdyn credyd. Gweithred bosib: ailgeisio gyda'r un cerdyn neu ddull arall o dalu.

source: You requested a capture, but there is no corresponding, unused authorization record. Occurs if there was not a previously successful authorization request or if the previously successful authorization has already been used by another capture request.
cy: Gwnaethoch gais am gipio, ond nid oes unrhyw gofnod o awdurdodiad cyfatebol, heb ei ddefnyddio. Yn digwydd os na chafwyd cais awdurdodi llwyddiannus blaenorol neu os yw'r awdurdodiad llwyddiannus blaenorol eisoes wedi cael ei ddefnyddio gan gais cipio arall.

source: Either the capture or credit is not voidable because the capture or credit information has already been submitted to your processor, or you requested a void for a type of transaction that cannot be voided.
cy: Naill ai ni ellir dirymu'r cipiad na'r credyd am fod gwybodaeth y cipiad neu'r credyd eisoes wedi cael ei gyflwyno i'ch prosesydd, neu gofynnoch am ddirymu math o drafodyn na ellir ei ddirymu.

source: You requested a credit for a capture that was previously voided.
cy: Gofynnoch am gredyd am gipiad a ddirymwyd eisoes.

source: The request was received, but there was a timeout at the payment processor.
cy: Derbyniwyd y cais ond daeth amser y prosesydd taliadau i ben.

source: Stand-alone credits are not allowed.
cy: Ni chaniateir credydau annibynnol.

source: The cardholder is enrolled for payer authentication
cy: Mae deilydd y cerdyn wedi cofrestru ar gyfer dilysu talwr

source: Payer authentication could not be authenticated
cy: Ni fedrwyd dilysu'r talwr

source: The authorization request was approved by the issuing bank but declined by CyberSource based on your legacy Smart Authorization settings. Possible action: retry with a different form of payment.
cy: Cafodd y cais awdurdodi ei gymeradwyo gan y banc dyroddi ond ei wrthod gan CyberSource oherwydd eich hen osodiadau awdurdodi Smart. Gweithred bosib: ailgeisio talu rywsut arall.

source: Order Number
cy: Rhif yr archeb

source: Customer Name
cy: Enw'r cwsmer

source: Date of Original Transaction
cy: Dyddiad y trafodyn gwreiddiol

source: Date of Refund
cy: Dyddiad yr ad-daliad

source: Amount of Refund
cy: Swm yr ad-daliad

source: Service Fees (if any)
cy: Ffioedd gwasanaeth (os o gwbl)

source: Purchase Time
cy: Amser prynu

source: Order ID
cy: Rhif yr archeb

source: Unit Cost
cy: Cost yr uned

source: Total Cost
cy: Cyfanswm cost

source: Currency
cy: Arian cyfredol

source: Comments
cy: Sylwadau

source: University
cy: Prifysgol

source: Course Announce Date
cy: Dyddiad cyhoeddi'r cwrs

source: Course Start Date
cy: Dyddiad dechrau'r cwrs

source: Course Registration Close Date
cy: Dyddiad cau cofrestru'r cwrs

source: Course Registration Period
cy: Cyfnod cofrestru'r cwrs

source: Total Enrolled
cy: Cyfanswm sydd wedi cofrestru

source: Audit Enrollment
cy: Cynnal awdit o'r cofrestru

source: Honor Code Enrollment
cy: Cofrestru côd anrhydedd

source: Verified Enrollment
cy: Cofrestru wedi'i wirio

source: Gross Revenue
cy: Refeniw gros

source: Gross Revenue over the Minimum
cy: Refeniw gros dros y lleiafswm

source: Number of Verified Students Contributing More than the Minimum
cy: Nifer y myfyrwyr a wiriwyd yn cyfrannu mwy na'r lleiafswm

source: Number of Refunds
cy: Nifer yr ad-daliadau

source: Dollars Refunded
cy: Y doleri a ad-dalwyd

source: Number of Transactions
cy: Nifer y trafodion

source: Total Payments Collected
cy: Cyfanswm y taliadau a gasglwyd

source: Number of Successful Refunds
cy: Nifer yr ad-daliadau llwyddiannus

source: Total Amount of Refunds
cy: Cyfanswm yr ad-daliadau

source: You must be logged-in to add to a shopping cart
cy: Rhaid eich bod wedi mewngofnodi i ychwanegu i'r troli siopa

source: The course you requested does not exist.
cy: Nid yw'r cwrs y gofynnoch amdano yn bodoli.

source: The course {course_id} is already in your cart.
cy: Mae'r cwrs {course_id} eisoes yn eich troli.

source: You are already registered in course {course_id}.
cy: Rydych eisoes wedi'ch cofrestru ar y cwrs hwn {course_id}.

source: Course added to cart.
cy: Ychwanegwyd y cwrs i'ch troli.

source: Discount does not exist against code '{code}'.
cy: Nid oes disgownt yn bodoli yn erbyn côd '{code}'.

source: This enrollment code ({enrollment_code}) is no longer valid.
cy: Nid yw'r côd cofrestru ({enrollment_code}) hwn bellach yn ddilys.

source: This enrollment code ({enrollment_code}) is not valid.
cy: Nid yw'r côd cofrestru ({enrollment_code}) hwn yn ddilys.

source: Code '{registration_code}' is not valid for any course in the shopping cart.
cy: Nid yw'r côd '{registration_code}' yn ddilys ar gyfer unrhyw gwrs yn y troli siopa.

source: Cart item quantity should not be greater than 1 when applying activation code
cy: Ni ddylai nifer yr eitemau fod yn fwy nag 1 wrth ddefnyddio côd ysgogi

source: Only one coupon redemption is allowed against an order
cy: Dim ond un cwpon gellir ei ddefnyddio yn erbyn archeb

source: success
cy: llwyddiant

source: You do not have permission to view this page.
cy: Nid oes gennych ganiatâd i weld y dudalen hon.

source: No email address provided.
cy: Ni ddarparwyd gyfeiriad e-bost.

source: View and regenerate certificates.
cy: Gweld ac Ail-greu tystysgrifau.

source: Manual Refund
cy: Ad-dalu eich hun

source: Track refunds issued directly through CyberSource.
cy: Olrhain ad-daliadau a roddwyd yn uniongyrchol drwy CyberSource.

source: Enrollment
cy: Cofrestru

source: View and update learner enrollments.
cy: Gweld a diweddaru cofrestriadau dysgwyr.

source: Email Address
cy: Cyfeiriad e-bost

source: Course ID
cy: Rhif adnabod y cwrs

source: User not found
cy: Ni ddaethpwyd o hyd i'r defnyddiwr

source: Course {course_id} not past the refund window.
cy: Nid yw'r cwrs {course_id} heibio'r ffenestr ad-dalu.

source: No order found for {user} in course {course_id}
cy: Ni ddaethpwyd o hyd i {user} ar gwrs {course_id}

source: Unenrolled {user} from {course_id}
cy: Dadgofrestrwyd {user} o {course_id}

source: Refunded {cost} for order id {order_id}
cy: Ad-dalwyd {cost} am archeb rhif {order_id}

source: Optional language the team uses as ISO 639-1 code.
cy: Iaith ddewisol mae'r tîm yn ei defnyddio fel côd ISO 639-1.

source: Teams
cy: Timau

source: The supplied course id {course_id} is not valid.
cy: Nid yw rhif adnabod y cwrs {course_id} a roddwyd yn ddilys.

source: course_id must be provided
cy: rhaid rhoi course_id
