Repository: zhulinhai/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: cy

source: An ORA data report generation task is already in progress. Check the 'Pending Tasks' table for the status of the task. When completed, the report will be available for download in the table below.
cy: Mae tasg creu adroddiad data ORA eisoes ar waith. Gwirio'r tabl 'Tasgau yn yr arfaeth' ar gyfer statws y dasg. Wedi iddo gael ei gwblhau bydd yr adroddiad ar gael i'w lawrlwytho yn y tabl isod.

source: The grade report is being created. To view the status of the report, see Pending Tasks below.
cy: Mae'r adroddiad gradd yn cael ei greu. I weld statws yr adroddiad, gweler tasgau yn yr arfaeth

source: The grade report is currently being created. To view the status of the report, see Pending Tasks below. You will be able to download the report when it is complete.
cy: Mae adroddiad gradd yn cael ei greu ar hyn o bryd. I weld statws yr adroddiad, gweler tasgau yn yr arfaeth. Gallwch lawrlwytho'r adroddiad pan fydd wedi'i gwblhau.

source: The problem grade report is being created. To view the status of the report, see Pending Tasks below.
cy: Mae adroddiad graddio'r broblem yn cael ei greu. I weld statws yr adroddiad, gweler tasgau yn yr arfaeth

source: A problem grade report is already being generated. To view the status of the report, see Pending Tasks below. You will be able to download the report when it is complete.
cy: Mae adroddiad graddio'r broblem yn cael ei greu eisoes. I weld statws yr adroddiad, gweler tasgau yn yr arfaeth. Gallwch lawrlwytho'r adroddiad pan fydd wedi'i gwblhau.

source: Successfully changed due date for student {0} for {1} to {2}
cy: Newidiwyd y dyddiad cau yn llwyddiannus ar gyfer myfyriwr {0} ar gyfer {1} i {2}

source: Successfully removed invalid due date extension (unit has no due date).
cy: Dilëwyd estyniad dyddiad cau annilys yn llwyddiannus (nid oes dyddiad cau gan yr uned).

source: Successfully reset due date for student {0} for {1} to {2}
cy: Ailosodwyd y dyddiad cau yn llwyddiannus ar gyfer myfyriwr {0} ar gyfer {1} i {2}

source: Certificate generation task for all students of this course has been started. You can view the status of the generation task in the "Pending Tasks" section.
cy: Mae tasg cynhyrchu tystysgrif y cwrs hwn wedi'i dechrau ar gyfer yr holl fyfyrwyr. Gallwch weld statws y dasg greu yn adran "Tasgau yn yr arfaeth".

source: Please select one or more certificate statuses that require certificate regeneration.
cy: Dewiswch un neu fwy statws tystysgrif sy'n galw am ailgynhyrchu tystysgrif.

source: Please select certificate statuses from the list only.
cy: Dewiswch statws tystysgrif o'r rhestr yn unig.

source: Certificate regeneration task has been started. You can view the status of the generation task in the "Pending Tasks" section.
cy: Mae'r dasg ailgynhyrchu tystysgrifau wedi dechrau. Gallwch weld statwch y dasg greu yn adran "Tasgau yn yr arfaeth".

source: Student (username/email={user}) already in certificate exception list.
cy: Mae myfyriwr (username/email={user}) eisoes ar y rhestr eithrio tystysgrif.

source: Certificate exception (user={user}) does not exist in certificate white list. Please refresh the page and try again.
cy: Nid yw'r eithriad tystysgrif (defnyddiwr={user}) ar y rhestr tystysgrifau a ganiateir. Adnewyddwch y dudalen a rhowch gynnig arall arni.

source: Student username/email field is required and can not be empty. Kindly fill in username/email and then press "Add to Exception List" button.
cy: Mae'r maes enw defnyddiwr/e-bost y myfyriwr yn ofynnol ac ni all fod yn wag. A wnewch chi gwblhau'r enw defnyddiwr/e-bost ac yna gwasgu'r botwm "Add to Exception List".

source: The record is not in the correct format. Please add a valid username or email address.
cy: Nid yw'r cofnod yn y fformat cywir. Ychwanegwch enw defnyddiwr neu gyfeiriad e-bost dilys.

source: {user} does not exist in the LMS. Please check your spelling and retry.
cy: Nid yw'r {user} defnyddiwr yn bodoli yn y system rheoli dysgu (LMS). Gwiriwch eich sillafu a rhoi cynnig arall arni.

source: {user} is not enrolled in this course. Please check your spelling and retry.
cy: Nid yw {user} wedi cofrestru ar y cwrs hwn. Gwiriwch eich sillafu a rhoi cynnig arall arni.

source: Invalid data, generate_for must be "new" or "all".
cy: Data annilys, rhaid i generate_for fod yn "new" neu'n "all".

source: Certificate generation started for white listed students.
cy: Mae cynhyrchu tystysgrifau wedi dechrau ar gyfer myfyrwyr rhestr a ganiateir.

source: Certificate of {user} has already been invalidated. Please check your spelling and retry.
cy: Mae tystysgrif {user} eisoes wedi cael ei annilysu. Gwiriwch eich sillafu a rhoi cynnig arall arni.

source: Certificate for student {user} is already invalid, kindly verify that certificate was generated for this student and then proceed.
cy: Mae'r dystysgrif ar gyfer myfyriwr {user} eisoes yn annilys, a wnewch chi wirio bod tystysgrif wedi cael ei chynhyrchu ar gyfer y myfyriwr hwn ac yna bwrw ymlaen.

source: Certificate Invalidation does not exist, Please refresh the page and try again.
cy: Nid yw annilysu'r dystysgrif yn bodoli, ailwnewch y dudalen a rhoi cynnig arall arni.

source: Student username/email field is required and can not be empty. Kindly fill in username/email and then press "Invalidate Certificate" button.
cy: Mae'r maes enw defnyddiwr/e-bost y myfyriwr yn ofynnol ac ni all fod yn wag. A wnewch chi gwblhau'r enw defnyddiwr/e-bost ac yna gwasgu'r botwm "Annilysu'r Tystysgrif".

source: The student {student} does not have certificate for the course {course}. Kindly verify student username/email and the selected course are correct and try again.
cy: Nid oes gan y myfyriwr {student} dystysgrif ar gyfer y cwrs {course}. A wnewch chi wirio bod yr enw defnyddiwr/e-bost y myfyriwr a'r cwrs a ddetholwyd yn gywir a rhoi cynnig arall arni.

source: coupon id is None
cy: rhif adnabod y cwpon yw dim

source: coupon with the coupon id ({coupon_id}) DoesNotExist
cy: nid yw'r cwpon â rhif adnabod cwpon ({coupon_id}) yn bodoli

source: coupon with the coupon id ({coupon_id}) is already inactive
cy: mae'r cwpon â rhif adnabod cwpon ({coupon_id}) eisoes yn anactif

source: coupon with the coupon id ({coupon_id}) updated successfully
cy: diweddarwyd y cwpon sydd â rhif adnabod cwpon ({coupon_id}) yn llwyddiannus

source: The code ({code}) that you have tried to define is already in use as a registration code
cy: Mae'r côd ({code}) rydych wedi ceisio'i ddiffinio eisoes yn cael ei ddefnyddio fel côd cofrestru

source: Please Enter the Integer Value for Coupon Discount
cy: Rhowch y gwerth cyfanrif ar gyfer cwpon disgownt.

source: Please Enter the Coupon Discount Value Less than or Equal to 100
cy: Rhowch werth cwpon disgownt sy'n llai na neu'n gyfwerth â 100

source: Please enter the date in this format i-e month/day/year
cy: Rhowch y dyddiad yn y fformat hwn h.y. mis/dyddiad/blwyddyn

source: coupon with the coupon code ({code}) added successfully
cy: ychwanegwyd cwpon côd ({code}) yn llwyddiannus

source: coupon with the coupon code ({code}) already exists for this course
cy: mae'r cwpon côd ({code}) eisoes yn bodoli ar gyfer y cwrs

source: coupon id not found
cy: ni ddaethpwyd o hyd i rif adnabod y cwpon

source: coupon with the coupon id ({coupon_id}) updated Successfully
cy: diweddarwyd y cwpon sydd â rhif adnabod cwpon ({coupon_id}) yn llwyddiannus

source: Instructor
cy: Hyfforddwr

source: To gain insights into student enrollment and participation {link_start}visit {analytics_dashboard_name}, our new course analytics product{link_end}.
cy: I gael cip ar gofrestriad a chyfranogaeth myfyriwr {link_start}ewch i {analytics_dashboard_name}, ein cynnyrch dadansoddi cwrs newydd{link_end}.

source: E-Commerce
cy: e-Fasnach

source: Special Exams
cy: Arholiadau arbennig

source: Certificates
cy: Tystysgrifau

source: Please Enter the numeric value for the course price
cy: Rhowch y gwerth rhifiadol ar gyfer pris y cwrs.

source: CourseMode with the mode slug({mode_slug}) DoesNotExist
cy: Nid yw CourseMode gyda'r slyg({mode_slug}) yn bodoli

source: CourseMode price updated successfully
cy: Diweddarwyd pris Coursemode yn llwyddiannus

source: Course Info
cy: Gwybodaeth am y cwrs

source: Enrollment data is now available in {dashboard_link}.
cy: Mae data cofrestru bellach ar gael yn {dashboard_link}.

source: Membership
cy: Aelodaeth

source: Cohorts
cy: Cohortau

source: Student Admin
cy: Gweinyddu myfyrwyr

source: Extensions
cy: Estyniadau

source: Data Download
cy: Lawrlwytho Data

source: Analytics
cy: Dadansoddeg

source: Metrics
cy: Mydryddiaeth

source: 0 sent
cy: 0 wedi'i anfon/wedi'u hanfon

source: Complete
cy: Cyflawn

source: Incomplete
cy: Anghyflawn

source: The enrollment code ({code}) was not found for the {course_name} course.
cy: Ni ddaethpwyd o hyd i'r côd cofrestru ({code}) ar gyfer y cwrs {course_name}.

source: This enrollment code has been canceled. It can no longer be used.
cy: Mae'r côd cofrestru hwn wedi cael ei ganslo. Ni ellir ei ddefnyddio bellach.

source: This enrollment code has been marked as unused.
cy: Mae'r côd cofrestru hwn wedi cael ei farcio heb ei ddefnyddio.

source: The enrollment code has been restored.
cy: Mae'r côd cofrestru wedi cael ei adfer.

source: The redemption does not exist against enrollment code ({code}).
cy: Nid yw'r adbryniant yn bodoli yn erbyn côd cofrestru ({code}).

source: Could not find student matching identifier: {student_identifier}
cy: Ni fedrwyd canfod dynodydd myfyriwr sy'n cyfateb: {student_identifier}

source: Couldn't find module for url: {0}
cy: Methwyd dod o hyd i fodiwl ar gyfer yr url: {0}

source: Unit {0} has no due date to extend.
cy: Nid oes gan uned {0} ddyddiad terfyn i'w ymestyn.

source: An extended due date must be later than the original due date.
cy: Rhaid i ddyddiad cau estynedig fod yn hwyrach na'r dyddiad cau gwreiddiol.

source: No due date extension is set for that student and unit.
cy: Nid oes estyniad dyddiad cau wedi'i osod ar gyfer y myfyriwr yna na'r uned honno.

source: Full Name
cy: Enw llawn

source: Extended Due Date
cy: Dyddiad cau estynedig

source: Users with due date extensions for {0}
cy: Defnyddwyr gydag estyniadau dyddiad cau ar gyfer {0}

source: Due date extensions for {0} {1} ({2})
cy: Estyniadau dyddiad cau ar gyfer {0} {1} ({2})

source: Not all problems in entrance exam support re-scoring.
cy: Nid yw pob problem yn yr arholiad mynediad yn caniatáu ail-sgorio.

source: rescored
cy: ail-sgoriwyd

source: reset
cy: ailosod

source: deleted
cy: wedi'i ddileu

source: emailed
cy: e-bostiwyd

source: graded
cy: graddiwyd

source: problem distribution graded
cy: graddiwyd dosbarthiad y broblem

source: certificates generated
cy: cynhyrchwyd y tystysgrifau

source: cohorted
cy: mewn cohortau

source: First Name
cy: Enw cyntaf

source: Last Name
cy: Cyfenw

source: Company Name
cy: Enw'r cwmni

source: Title
cy: Teitl

source: Year of Birth
cy: Blwyddyn geni

source: Enrollment Date
cy: Dyddiad cofrestru

source: Currently Enrolled
cy: Wedi'u cofrestru ar hyn o bryd

source: Enrollment Source
cy: Ffynhonnell gofrestru

source: Manual (Un)Enrollment Reason
cy: Rheswm dros (dad)gofrestru eich hun

source: Enrollment Role
cy: Rôl gofrestru

source: List Price
cy: Pris rhestr

source: Payment Amount
cy: Swm y taliad

source: Coupon Codes Used
cy: Codau cwponau a ddefnyddiwyd

source: Registration Code Used
cy: Defnyddiwyd Côd Cofrestru

source: Payment Status
cy: Statws y taliad

source: Transaction Reference Number
cy: Cyfeirnod y trafodyn

source: No status information available
cy: Nid oes gwybodaeth am y statws ar gael

source: No task_output information found for instructor_task {0}
cy: Ni chanfuwyd gwybodaeth task_output ar gyfer instructor_task {0}

source: No parsable task_output information found for instructor_task {0}: {1}
cy: Ni chanfuwyd gwybodaeth task_output y gellir ei dosrannu ar gyfer instructor_task {0}: {1}

source: No parsable status information available
cy: Nid oes gwybodaeth am y statws y gellir ei dosrannu ar gael

source: No message provided
cy: Ni ddarparwyd neges

source: Invalid task_output information found for instructor_task {0}: {1}
cy: Canfuwyd gwybodaeth task_output annilys ar gyfer instructor_task {0}: {1}

source: No progress status information available
cy: Nid oes gwybodaeth am y statws y cynnydd ar gael

source: No parsable task_input information found for instructor_task {0}: {1}
cy: Ni chanfuwyd gwybodaeth task_input y gellir ei dosrannu ar gyfer instructor_task {0}: {1}

source: Progress: {action} {succeeded} of {attempted} so far
cy: Cynnydd: {action} {succeeded} o {attempted} hyd yma

source: Unable to find submission to be {action} for student '{student}'
cy: Yn methu canfod cyflwyniad i'w {action} ar gyfer myfyriwr '{student}'

source: Problem failed to be {action} for student '{student}'
cy: Methodd y broblem â {action} ar gyfer myfyriwr '{student}'

source: Problem successfully {action} for student '{student}'
cy: Llwyddodd y broblem i {action} ar gyfer myfyriwr '{student}'

source: Unable to find entrance exam submission to be {action} for student '{student}'
cy: Yn methu canfod cyflwyniad arholiad mynediad i'w {action} ar gyfer myfyriwr '{student}'

source: Entrance exam successfully {action} for student '{student}'
cy: Llwyddodd yr arholiad mynediad i {action} ar gyfer myfyriwr '{student}'

source: Unable to find any students with submissions to be {action}
cy: Ni fedrwyd ddod o hyd i unrhyw fyfyrwyr gyda chyflwyniadau i'w {action}

source: Problem failed to be {action} for any of {attempted} students
cy: Methodd y broblem i {action} ar gyfer unrhyw rai o'r {attempted} o fyfyrwyr

source: Problem successfully {action} for {attempted} students
cy: Llwyddodd y broblem i {action} ar gyfer {attempted} o fyfyrwyr

source: Problem {action} for {succeeded} of {attempted} students
cy: {action} broblem ar gyfer {succeeded} o {attempted} o fyfyrwyr

source: Unable to find any recipients to be {action}
cy: Ni fedrwyd ddod o hyd i unrhyw dderbynwyr i fod yn {action}

source: Message successfully {action} for {attempted} recipients
cy: {action} y neges yn llwyddiannus ar gyfer {attempted} o dderbynwyr

source: Message {action} for {succeeded} of {attempted} recipients
cy: {action} y neges ar gyfer {succeeded} o {attempted} o dderbynwyr

source: Status: {action} {succeeded} of {attempted}
cy: Statws: {action} {succeeded} o {attempted}

source: Whether to display this module in the table of contents
cy: A ddylid arddangos y modiwl hwn yn y tabl cynnwys

source: What format this module is in (used for deciding which grader to apply, and what to show in the TOC)
cy: Pa fformat mae'r modiwl hwn ynddo (fe'i defnyddir wrth benderfynu pa raddiwr i'w ddefnyddio, a beth i'w ddangos yn y TOC)

source: Course Chrome
cy: Crôm y cwrs

source: Enter the chrome, or navigation tools, to use for the XBlock in the LMS. Valid values are: "chromeless" -- to not use tabs or the accordion; "tabs" -- to use tabs only; "accordion" -- to use the accordion only; or "tabs,accordion" -- to use tabs and the accordion.
cy: Rhowch y crôm, neu'r offer llywio, i'w ddefnyddio ar gyfer yr XBlock yn LMS. Dyma werthoedd dilys: "heb grôm" -- i beidio â defnyddio'r tabiau neu'r acordion; "tabiau" -- i ddefnyddio'r tabiau'n unig; "acordion" -- i ddefnyddio'r acordion yn unig; neu "tabiau,acordion" -- i ddefnyddio tabiau a'r acordion.

source: Default Tab
cy: Tab diofyn

source: Enter the tab that is selected in the XBlock. If not set, the Course tab is selected.
cy: Rhowch y tab sydd wedi'i ddethol yn yr XBlock. Os nad yw wedi'i osod, dewisir tab y cwrs.

source: LaTeX Source File Name
cy: Enw ffeil ffynhonnell LaTeX

source: Enter the source file name for LaTeX.
cy: Rhowch yr enw ffeil ffynhonnell ar gyfer LaTeX.

source: A dictionary that maps which groups can be shown this block. The keys are group configuration ids and the values are a list of group IDs. If there is no key for a group configuration or if the set of group IDs is empty then the block is considered visible to all. Note that this field is ignored if the block is visible_to_staff_only.
cy: Geiriadur sy'n mapio pa grwpiau gellir eu dangos yn y bloc hwn. Mae'r allweddi yn rhifau adnabod ffurfweddiad grŵp ac mae'r gwerthoedd yn rhestr o rifau adnabod grŵp. Os nad oes allwedd ar gyfer ffurfweddiad grŵp neu os yw'r gyfres o rifau adnabod grŵp yn wag, yna ystyrir y bloc yn weladwy i bawb. Sylwer y caiff y maes hwn ei anwybyddu os yw'r bloc yn visible_to_staff_only.

source: My Notes
cy: Fy nodiadau

source: Order Payment Confirmation
cy: Cadarnhad talu am yr archeb

source: Confirmation and Registration Codes for the following courses: {course_name_list}
cy: Cadarnhad a chodau cofrestru ar gyfer y cyrsiau hyn: {course_name_list}

source: Trying to add a different currency into the cart
cy: Yn ceisio ychwanegu arian gwahanol i'r troli

source: Internal reference code for this invoice.
cy: Côd cyfeirio mewnol ar gyfer yr anfoneb hon.

source: Customer's reference code for this invoice.
cy: Côd cyfeirio cwsmer ar gyfer yr anfoneb hon.

source: The amount of the transaction. Use positive amounts for payments and negative amounts for refunds.
cy: Swm y trafodyn. Defnyddiwch symiau cadarnhaol ar gyfer taliadau a symiau negyddol ar gyfer ad-daliadau.

source: Lower-case ISO currency codes
cy: Codau arian ISO llythrennau bach

source: Optional: provide additional information for this transaction
cy: Dewisol: rhowch wybodaeth ychwanegol ar gyfer y trafodyn hwn

source: The status of the payment or refund. 'started' means that payment is expected, but money has not yet been transferred. 'completed' means that the payment or refund was received. 'cancelled' means that payment or refund was expected, but was cancelled before money was transferred.
cy: Statws y taliad neu'r ad-daliad. Mae 'wedi dechrau' yn golygu y disgwylir taliad, ond nad yw'r arian wedi cael ei drosglwyddo eto. Mae 'wedi'i gwblhau' yn golygu y derbyniwyd y taliad neu'r ad-daliad. Mae 'wedi'i ganslo' yn golygu y disgwylir taliad neu ad-daliad, ond y cafodd ei ganslo cyn i'r arian gael ei drosglwyddo.

source: The number of items sold.
cy: Nifer yr eitemau a werthwyd.

source: The price per item sold, including discounts.
cy: Y pris fesul pob eitem a werthit, gan gynnwys disgowntiau.

source: Registration for Course: {course_name}
cy: Cofrestru ar gyfer cwrs: {course_name}

source: Please visit your {link_start}dashboard{link_end} to see your new course.
cy: Ewch i'ch {link_start}dangosfwrdd{link_end} i weld eich cwrs newydd.

source: Enrollment codes for Course: {course_name}
cy: Codau cofrestru ar gyfer cwrs: {course_name}

source: Mode {mode} does not exist for {course_id}
cy: Nid yw modd {mode} yn bodoli ar gyfer {course_id}

source: {mode_name} for course {course}
cy: {mode_name} ar gyfer cwrs {course}

source: If you haven't verified your identity yet, please start the verification process ({verification_url}).
cy: Os nad ydych wedi gwirio pwy ydych chi eto, dechreuwch y broses wirio ({verification_url}).

source: {refund_reminder_msg}To receive your refund, contact {billing_email}. Please include your order number in your email. Please do NOT include your credit card information.
cy: {refund_reminder_msg}I dderbyn eich ad-daliad, cysylltwch â {billing_email}. Rhowch eich rhif archeb yn eich e-bost. PEIDIWCH â chynnwys manylion eich cerdyn credyd.

source: We greatly appreciate this generous contribution and your support of the {platform_name} mission. This receipt was prepared to support charitable contributions for tax purposes. We confirm that neither goods nor services were provided in exchange for this gift.
cy: Rydym yn gwerthfawrogi'r cyfraniad hael hwn yn fawr a'ch cefnogaeth i genhadaeth {platform_name}. Paratowyd y dderbynneb hon i gefnogi cyfraniadau elusennol at ddibenion treth. Rydym yn cadarnhau na roddwyd nwyddau na gwasanaethau yn gyfnewid am y rhodd hwn.

source: Could not find a course with the ID '{course_id}'
cy: Ni fedrwyd dod o hyd i gwrs gyda'r rhif adnabod '{course_id}'

source: Donation for {course}
cy: Rhodd ar gyfer {course}

source: Donation for {platform_name}
cy: Rhodd ar gyfer {platform_name}

source: Page {page_number} of {page_count}
cy: Tudalen {page_number} o {page_count}

source: Invoice
cy: Anfoneb

source: Order
cy: Archeb

source: Date: {date}
cy: Dyddiad: {date}

source: Quantity
cy: Nifer

source: List Price per item
cy: Pris rhestr yr eitem

source: Discount per item
cy: y disgownt yr eitem

source: Amount
cy: Swm

source: Total
cy: Cyfanswm

source: Payment Received
cy: Derbyniwyd y taliad

source: Balance
cy: Balans

source: Billing Address
cy: Y cyfeiriad bilio

source: Disclaimer
cy: Ymwadiad

source: TERMS AND CONDITIONS
cy: AMODAU A THELERAU:

source: The payment processor did not return a required parameter: {0}
cy: Ni wnaeth y prosesydd taliadau ddychwelyd paramedr gofynnol: {0}

source: The payment processor returned a badly-typed value {0} for param {1}.
cy: Dychwelodd y prosesydd taliadau werth wedi'i deipio'n wael {0} ar gyfer param {1}.

source: The payment processor accepted an order whose number is not in our system.
cy: Derbyniodd y prosesydd taliadau archeb ond nid yw ei rif yn ein system.

source: The amount charged by the processor {0} {1} is different than the total cost of the order {2} {3}.
cy: Mae'r swm a godwyd gan y prosesydd {0} {1} yn wahanol i gyfanswm cost yr archeb {2} {3}.

source: Sorry! Our payment processor did not accept your payment. The decision they returned was {decision_text}, and the reason was {reason_text}. You were not charged. Please try a different form of payment. Contact us with payment-related questions at {email}.
cy: Mae'n flin gennym! Ni wnaeth prosesydd ein taliadau dderbyn eich taliad. Y penderfyniad a gafwyd oedd {decision_text}, a'r rheswm oedd {reason_text}. Ni chodwyd tâl arnoch. Ceisiwch dalu rhywsut arall. Cysylltwch â ni gyda chwestiynau am daliadau yn {email}.

source: Sorry! Our payment processor sent us back a payment confirmation that had inconsistent data!We apologize that we cannot verify whether the charge went through and take further action on your order.The specific error message is: {error_message}. Your credit card may possibly have been charged. Contact us with payment-specific questions at {email}.
cy: Mae'n flin gennym! Anfonodd ein prosesydd taliadau gadarnhad talu yn ôl atom a oedd yn cynnwys data anghyson! Ymddiheurwn na fedrwn wirio a fu'r taliad yn llwyddiannus felly ni fyddwn yn gweithredu'n bellach gyda'ch archeb. Y neges wall benodol yw: {error_message}. Mae'n bosib y codwyd tâl ar eich cerdyn credyd. Cysylltwch â ni gyda chwestiynau penodol am daliadau yn {email}.

source: Sorry! Due to an error your purchase was charged for a different amount than the order total! The specific error message is: {error_message}. Your credit card has probably been charged. Contact us with payment-specific questions at {email}.
cy: Mae'n flin gennym! Oherwydd gwall codwyd tâl gwahanol i gyfanswm eich archeb! Y neges wall benodol yw: {error_message}. Mwy na thebyg codwyd tâl ar eich cerdyn credyd. Cysylltwch â ni gyda chwestiynau penodol am daliadau yn {email}.
