Repository: zhulinhai/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: cy

source: Staff cannot modify these lists. To manage course team membership, a course Admin must give you the Admin role to add Staff or Beta Testers, or the Discussion Admin role to add discussion moderators and TAs.
cy: Ni all staff addasu'r rhestrau hyn. I reoli aelodaeth tîm y cwrs, rhaid i weinyddydd y cwrs roi rôl gweinyddydd i chi er mwyn ychwanegu staff neu brofwyr beta, neu'r rôl gweinyddydd trafodaethau er mwyn ychwanegu cymedrolwyr trafodaethau a CD.

source: Course team members with the Staff role help you manage your course. Staff can enroll and unenroll learners, as well as modify their grades and access all course data. Staff also have access to your course in Studio and Insights. You can only give course team roles to enrolled users.
cy: Mae aelodau tîm y cwrs sydd â rôl staff yn eich helpu i reoli'r cwrs. Gall staff gofrestru a dadgofrestru dysgwyr, ynghyd ag addasu graddau a mynediad i holl ddata'r cwrs. Mae gan staff hefyd fynediad i'ch cwrs yn Studio ac Insights. Defnyddwyr a gofrestrwyd yn unig gaiff dderbyn rolau tîm cyrsiau.

source: Add Staff
cy: Ychwanegu staff

source: Admin
cy: Gweinyddol

source: Course team members with the Admin role help you manage your course. They can do all of the tasks that Staff can do, and can also add and remove the Staff and Admin roles, discussion moderation roles, and the beta tester role to manage course team membership. You can only give course team roles to enrolled users.
cy: Mae aelodau tîm y cwrs sydd â rôl gweinyddydd yn eich helpu i reoli'r cwrs. Gallant gyflawni'r holl dasgau mae staff yn gallu eu gwneud, a hefyd ychwanegu neu ddileu rolau staff a gweinyddydd, rolau cymedroli trafodaethau a'r rôl profwr beta i reoli aelodaeth tîm y cwrs. Defnyddwyr a gofrestrwyd yn unig gaiff dderbyn rolau tîm cyrsiau.

source: Add Admin
cy: Ychwanegu gweinyddwr

source: Beta Testers
cy: Profwyr beta

source: Beta Testers can see course content before other learners. They can make sure that the content works, but have no additional privileges. You can only give course team roles to enrolled users.
cy: Gall profwyr beta weld cynnwys cwrs cyn dysgwyr eraill. Gallant sicrhau bod y cynnwys yn gweithio, ond ni chânt freintiau ychwanegol. Defnyddwyr a gofrestrwyd yn unig gaiff dderbyn rolau tîm cyrsiau.

source: Add Beta Tester
cy: Ychwanegu profwr beta

source: Discussion Admins
cy: Gweinyddwyr trafodaethau

source: Discussion Admins can edit or delete any post, clear misuse flags, close and re-open threads, endorse responses, and see posts from all cohorts. Their posts are marked as 'staff'. They can also add and remove the discussion moderation roles to manage course team membership. You can only give course team roles to enrolled users.
cy: Gall gweinyddwyr trafodaethau olygu neu ddileu unrhyw bostiad, clirio fflagiau camddefnydd, cau ac ailagor edefynnau, cymeradwyo ymatebion a gweld postiadau o'r holl gohortau. Mae eu postiadau wedi'u nodi â 'staff'. Gallant hefyd ychwanegu a dileu rolau cymedroli trafodaethau i reoli aelodaeth tîm y cwrs. Defnyddwyr a gofrestrwyd yn unig gaiff dderbyn rolau tîm cyrsiau.

source: Add Discussion Admin
cy: Ychwanegu gweinyddwr i'r drafodaeth

source: Discussion Moderators
cy: Cymedrolwyr trafodaethau

source: Discussion Moderators can edit or delete any post, clear misuse flags, close and re-open threads, endorse responses, and see posts from all cohorts. Their posts are marked as 'staff'. They cannot manage course team membership by adding or removing discussion moderation roles. You can only give course team roles to enrolled users.
cy: Gall cymedrolwyr trafodaethau olygu neu ddileu unrhyw bostiad, clirio fflagiau camddefnydd, cau ac ailagor edefynnau, cymeradwyo ymatebion a gweld postiadau o'r holl gohortau. Mae eu postiadau wedi'u nodi â 'staff'. Nid ydynt yn gallu rheoli aelodaeth tîm y cwrs trwy ychwanegu neu ddileu rolau cymedroli trafodaethau. Defnyddwyr a gofrestrwyd yn unig gaiff dderbyn rolau tîm cyrsiau.

source: Add Moderator
cy: Ychwanegu safonwr

source: Discussion Community TAs
cy: CD y gymuned drafodaeth

source: Community TA's are members of the community whom you deem particularly helpful on the discussion boards. They can edit or delete any post, clear misuse flags, close and re-open threads, endorse responses, and see posts from all cohorts. Their posts are marked as 'Community TA'. You can only give course team roles to enrolled users.
cy: Mae CD cymunedol yn aelodau o'r gymuned y credwch sy'n arbennig o ddefnyddiol ar y byrddau trafod. Gallant olygu neu ddileu unrhyw bostiad, clirio fflagiau camddefnydd, cau ac ailagor edefynnau, cymeradwyo ymatebion a gweld postiadau o'r holl gohortau. Mae eu postiadau wedi'u nodi â 'CD Cymunedol'. Defnyddwyr a gofrestrwyd yn unig gaiff dderbyn rolau tîm cyrsiau.

source: Add Community TA
cy: Ychwanegu CD Cymunedol

source: CCX Coaches
cy: Hyfforddwyr CCX

source: CCX Coaches are able to create their own Custom Courses based on this course, which they can use to provide personalized instruction to their own students based in this course material.
cy: Mae hyfforddwyr CCX yn gallu creu eu cyrsiau o'u dewis yn seiliedig ar y cwrs hwn, a gallant ei ddefnyddio i roi hyfforddiant mwy personol i'w myfyrwyr eu hunain yn seiliedig ar ddeunydd y cwrs.

source: Add CCX Coach
cy: Ychwanegu CCX Coach

source: There is no data available to display at this time.
cy: Nid oes data ar gael i'w arddangos ar hyn o bryd.

source: Use Reload Graphs to refresh the graphs.
cy: Defnyddiwch Ail-lwytho graffiau ai ail-wneud y graffiau.

source: Reload Graphs
cy: Ail-lwytho graffiau

source: Subsection Data
cy: Data'r is-adran

source: Each bar shows the number of students that opened the subsection.
cy: Mae pob bar yn dangos nifer y myfyrwyr a agorodd yr is-adran honno.

source: You can click on any of the bars to list the students that opened the subsection.
cy: Gallwch glicio ar unrhyw rai o'r bariau i weld rhestr o'r myfyrwyr a agorodd yr is-adran honno.

source: You can also download this data as a CSV file.
cy: Gallwch hefyd lawrlwytho'r data hwn fel ffeil CSV.

source: Download Subsection Data for all Subsections as a CSV
cy: Lawrlwytho data is-adran ar gyfer pob is-adran fel CSV

source: Grade Distribution Data
cy: Data dosbarthiad graddau

source: Each bar shows the grade distribution for that problem.
cy: Mae pob bar yn dangos y dosbarthiad graddau ar gyfer y broblem honno.

source: You can click on any of the bars to list the students that attempted the problem, along with the grades they received.
cy: Gallwch glicio ar unrhyw rai o'r bariau i weld rhestr o'r myfyrwyr a roddodd gynnig ar y broblem, ynghyd â'r graddau a gawsant.

source: Download Problem Data for all Problems as a CSV
cy: Lawrlwytho data problem ar gyfer pob problem fel CSV

source: Grade Distribution per Problem
cy: Dosbarthiad graddau fesul problem

source: Download Student Opened as a CSV
cy: Lawrlwytho myfyrwyr a agorodd fel CSV

source: Download Student Grades as a CSV
cy: Lawrlwytho graddau myfyrwyr fel CSV

source: This is a partial list, to view all students download as a csv.
cy: Rhestr rannol yw hon, i weld yr holl fyfyrwyr lawrlwythwch csv.

source: There are no problems in this section.
cy: Nid oes unrhyw broblemau yn yr adran hon.

source: Send to:
cy: Anfon at:

source: Myself
cy: Fy hunan

source: Staff and Administrators
cy: Staff a Gweinyddwyr

source: All Learners
cy: Pob dysgwr

source: (Learners not explicitly assigned to a cohort)
cy: (Dysgwyr heb eu dyrannu'n benodol i gohort)

source: Learners in the {track_name} Track
cy: Dysgwyr ar y trac {track_name}

source: (Maximum 128 characters)
cy: (Mwyafswm nodau/cymeriadau yw 128)

source: Message:
cy: Neges:

source: We recommend sending learners no more than one email message per week. Before you send your email, review the text carefully and send it to yourself first, so that you can preview the formatting and make sure embedded images and links work correctly.
cy: Awgrymwn nad ydych yn anfon mwy nag un e-bost yr wythnos at ddysgwyr. Cyn i chi anfon eich e-bost, adolygwch y testun yn ofalus a'i anfon atoch eich hun yn gyntaf, fel y gallwch weld y fformatio a sicrhau bod y delweddau a'r dolenni a blannwyd yn gweithio'n iawn.

source: CAUTION!
cy: RHYBUDD!

source: When you select Send Email, your email message is added to the queue for sending, and cannot be cancelled.
cy: Wrth ddewis anfon e-bost, bydd eich neges e-bost yn cael ei hychwanegu i'r ciw i'w anfon, ac ni elli ei dileu.

source: Send Email
cy: Anfon e-bost

source: Email actions run in the background. The status for any active tasks - including email tasks - appears in a table below.
cy: Mae gweithgarwch e-bost yn rhedeg yn y cefndir. Mae statws unrhyw dasg actif - gan gynnwys tasgau e-bost - yn ymddangos yn y tabl isod.

source: Email Task History
cy: Hanes tasgau e-bost

source: To see the content of previously sent emails, click this button:
cy: I weld cynnwys negeseuon e-bost a anfonwyd eisoes, cliciwch ar y botwm hwn:

source: Show Sent Email History
cy: Dangos hanes e-bostiau a anfonwyd

source: To read a sent email message, click its subject.
cy: I ddarllen neges e-bost a anfonwyd, cliciwch ar ei bwnc.

source: To see the status for all email tasks submitted for this course, click this button:
cy: I weld statws pob tasg e-bost a gyflwynwyd ar gyfer y cwrs hwn, cliciwch ar y botwm wn:

source: Show Email Task History
cy: Dangos hanes tasgau e-bost

source: Set Course Mode Price
cy: Gosod pris modd y cwrs

source: Please enter Course Mode detail below
cy: Rhowch fanylon modd y cwrs isod

source: Set Price
cy: Gosod pris

source: Allowance Section
cy: Adran Caniatáu

source: Student Special Exam Attempts
cy: Cynigion arholiadau arbennig myfyrwyr

source: View gradebook for enrolled learners
cy: Gweld llyfr graddau ar gyfer dysgwyr a gofrestrwyd

source: Note: This feature is available only to courses with a small number of enrolled learners.
cy: Sylwer: Mae'r nodwedd hon ar gael yn unig i gyrsiau sydd â nifer bychan o ddysgwyr wedi'u cofrestru.

source: View Gradebook
cy: Gweld llyfr graddau

source: View a specific learner's grades and progress
cy: Gweld graddau a chynnydd dysgwr penodol

source: Learner's {platform_name} email address or username *
cy: Cyfeiriad e-bost neu enw defnyddiwr {platform_name} y dysgwr *

source: Learner email address or username
cy: Cyfeiriad e-bost neu enw defnyddiwr y dysgwr

source: View Progress Page
cy: Gweld tudalen broffil

source: Adjust a learner's grade for a specific problem
cy: Addasu gradd dysgwr ar gyfer problem benodol

source: Location of problem in course *
cy: Lleoliad y broblem yn y cwrs *

source: Example
cy: Enghraifft

source: Problem location
cy: Lleoliad y broblem

source: Attempts
cy: Nifer y cynigion

source: Allow a learner who has used up all attempts to work on the problem again.
cy: Caniatáu i ddysgwr sydd wedi defnyddio pob cynnig i weithio ar y broblem eto.

source: Reset Attempts to Zero
cy: Ailosod cynigion i ddim

source: Rescore
cy: ail-sgorio

source: For the specified problem, rescore the learner's responses. The 'Rescore Only If Score Improves' option updates the learner's score only if it improves in the learner's favor.
cy: Ar gyfer y broblem a nodwyd, ail-sgoriwch ymatebion y dysgwyr. Mae'r dewis 'ail-sgorio os yw'r sgôr yn well' yn diweddaru sgôr y dysgwr os yw er budd y dysgwr.

source: Problem History
cy: Hanes y broblem

source: For the specified problem, permanently and completely delete the learner's answers and scores from the database.
cy: Ar gyfer y broblem benodol, dilëwch atebion a sgoriau'r dysgwr yn barhaol ac yn llwyr o'r gronfa ddata.

source: Task Status
cy: Statws y dasg

source: Show the status for the rescoring tasks that you submitted for this learner and problem.
cy: I ddangos statws ail-sgorio tasgau a gyflwynoch ar gyfer y dysgwr hwn a'r broblem hon.

source: Show Task Status
cy: Dangos statws tasg

source: Adjust a learner's entrance exam results
cy: Addasu canlyniadau arholiad mynediad dysgwr

source: Allow the learner to take the exam again.
cy: Caniatáu i'r dysgwr ailsefyll yr arholiad.

source: Allow Skip
cy: Caniatáu neidio

source: Waive the requirement for the learner to take the exam.
cy: Hepgor y gofyniad i'r dysgwr sefyll yr arholiad.

source: Let Learner Skip Entrance Exam
cy: Gadael i'r dysgwr hepgor arholiad mynediad

source: Rescore any responses that have been submitted. The 'Rescore All Problems Only If Score Improves' option updates the learner's scores only if it improves in the learner's favor.
cy: ail-sgorio unrhyw ymatebiona gyflwynwyd. Mae'r dewis 'ail-sgorio pob problem os yw'r sgôr yn well' yn diweddaru sgôr y dysgwr os yw er budd y dysgwr.

source: Rescore All Problems
cy: ail-sgorio pob problem

source: Rescore All Problems Only If Score Improves
cy: ail-sgorio pob problem os yw'r sgôr yn gwella'n unig

source: Entrance Exam History
cy: Hanes arholiad mynediad

source: For the entire entrance exam, permanently and completely delete the learner's answers and scores from the database.
cy: Ar gyfer yr arholiad mynediad cyfan, dilëwch atebion a sgoriau'r dysgwr yn barhaol ac yn llwyr o'r gronfa ddata.

source: Show the status for the rescoring tasks that you submitted for this learner and entrance exam.
cy: I ddangos statws ail-sgorio tasgau a gyflwynoch ar gyfer y dysgwr a'r arholiad mynediad hyn.

source: Adjust all enrolled learners' grades for a specific problem
cy: Addasu graddau dysgwyr cofrestredig ar gyfer problem benodol

source: Allows all learners to work on the problem again.
cy: Caniatáu i'r holl ddysgwyr weithio ar y broblem eto.

source: Rescore submitted responses. The 'Rescore Only If Scores Improve' option updates a learner's score only if it improves in the learner's favor.
cy: ail-sgorio ymatebion a gyflwynwyd. Mae'r dewis 'ail-sgorio os yw'r sgôr yn well' yn diweddaru sgôr y dysgwr os yw er budd y dysgwr.

source: Rescore All Learners' Submissions
cy: ail-sgorio cyflwyniadau pob dysgwr

source: Rescore Only If Scores Improve
cy: ail-sgorio os yw'r sgôr yn gwella'n unig

source: Show the status for the tasks that you submitted for this problem.
cy: I ddangos statws y tasgau a gyflwynoch ar gyfer y broblem hon.

source: My Courses
cy: Fy nghyrsiau

source: Program Details
cy: Manylion rhaglenni

source: Change Preferred Language
cy: Newid eich dewis iaith

source: Please choose your preferred language
cy: Nodwch eich dewis iaith

source: Save Language Settings
cy: Cadw gosodiadau iaith

source: Don't see your preferred language? {link_start}Volunteer to become a translator!{link_end}
cy: Methu gweld eich dewis iaith? {link_start}Gwirfoddolwch i fod yn gyfieithydd!{link_end}

source: Confirm
cy: Cadarnhau

source: modal open
cy: moddol ar agor

source: open
cy: agor

source: {p_tag}You currently do not have any peer grading to do. In order to have peer grading to do: {ul_tag} {li_tag}You need to have submitted a response to a peer grading problem.{end_li_tag} {li_tag}The course team needs to score the essays that are used to help you better understand the grading criteria.{end_li_tag} {li_tag}There must be submissions that are waiting for grading.{end_li_tag} {end_ul_tag} {end_p_tag}
cy: {p_tag}Nid oes gennych unrhyw raddio cyfoedion i'w wneud ar hyn o bryd. Er mwyn cael graddio cyfoedion: {ul_tag} {li_tag}Bydd rhaid i chi gyflwyno ymateb i broblem graddio cyfoedion.{end_li_tag} {li_tag}Bydd angen i dîm y cwrs sgorio traethodau a ddefnyddir i'ch helpu i ddeall y meini prawf graddio'n well .{end_li_tag} {li_tag}Rhaid bod cyflwyniadau yn aros i gael eu graddio.{end_li_tag} {end_ul_tag} {end_p_tag}

source: Peer Grading
cy: Graddio cyfoedion

source: Here is a list of problems that need to be peer graded for this course.
cy: Dyma restr o'r problemau y mae angen eu graddio gan gyfoedion ar gyfer y cwrs hwn.

source: Problem Name
cy: Enw'r broblem

source: Due date
cy: Dyddiad dychwelyd

source: Graded
cy: Graddiwyd

source: Available
cy: Ar gael

source: Required
cy: gofynnol

source: No due date
cy: Dim dyddiad dychwelyd

source: The due date has passed, and peer grading for this problem is closed at this time.
cy: Mae'r dyddiad dychwelyd wedi bod, ac mae'r graddio gan gyfoedion ar gyfer y broblem hon wedi cau ar hyn o bryd.

source: The due date has passed, and peer grading is closed at this time.
cy: Mae'r dyddiad dychwelyd wedi bod, ac mae'r graddio gan gyfoedion wedi cau ar hyn o bryd.

source: Learning to Grade
cy: Dysgu i raddio

source: Hide Question
cy: Cuddio'r cwestiwn

source: Student Response
cy: Ymateb myfyriwr

source: Written Feedback
cy: Adborth ysgrifenedig

source: Please include some written feedback as well.
cy: Cofiwch gynnwys peth adborth ysgrifenedig hefyd.

source: This submission has explicit, offensive, or (I suspect) plagiarized content.
cy: Mae cynnwys y cyflwyniad yn anweddus, yn sarhaus neu (tybiaf) wedi'i lên-ladrata.

source: How did I do?
cy: Sut gwnes i?

source: Continue
cy: Parhau

source: Ready to grade!
cy: Barod i raddio!

source: You have finished learning to grade, which means that you are now ready to start grading.
cy: Rydych wedi gorffen dysgu i raddio, sy'n golygu eich bod nawr yn barod i ddechrau graddio.

source: Start Grading!
cy: Dechrau graddio!

source: Learning to grade
cy: Dysgu i raddio

source: You have not yet finished learning to grade this problem.
cy: Nid ydych wedi gorffen dysgu sut i raddio'r broblem hon eto.

source: You will now be shown a series of instructor-scored essays, and will be asked to score them yourself.
cy: Byddwch nawr yn gweld cyfres o draethodau a sgoriwyd gan hyfforddwr, a gofynnir i chi eu sgorio eich hunan.

source: Once you can score the essays similarly to an instructor, you will be ready to grade your peers.
cy: Pan fyddwch yn sgorio traethodau yn yr un modd â hyfforddwr, yna byddwch yn barod i raddio'ch cyfoedion.

source: Start learning to grade
cy: Dysgu sut i raddio

source: Are you sure that you want to flag this submission?
cy: Ydych chi'n siŵr eich bod am dynnu sylw at y cyflwyniad hwn?

source: You are about to flag a submission. You should only flag a submission that contains explicit, offensive, or (suspected) plagiarized content. If the submission is not addressed to the question or is incorrect, you should give it a score of zero and accompanying feedback instead of flagging it.
cy: Rydych ar fin tynnu sylw at gyflwyniad. Dylech ond dynnu sylw at gyflwyniad sydd â chynnwys anweddus, sarhaus neu (dybiedig) wedi'i lên-ladrata. Os nad yw'r cyflwyniad yn ateb y cwestiwn neu'n anghywir, dylech roi sgôr o ddim iddo a chynnwys adborth yn hytrach na thynnu sylw ato.

source: Remove Flag
cy: Dileu fflag

source: Keep Flag
cy: Cadw fflag

source: Go Back
cy: Yn ôl

source: {start_strong}{application_name}{end_strong} would like to access your data with the following permissions:
cy: Hoffai {start_strong}{application_name}{end_strong} gael mynediad i'ch data gyda'r caniatadau hyn:

source: Read your user ID
cy: Darllen eich rhif adnabod defnyddiwr

source: Read your user profile
cy: Darllen eich proffil defnyddiwr

source: Read your email address
cy: Darllen eich cyfeiriad e-bost

source: Read the list of courses in which you are a staff member.
cy: Darllen rhestr y cyrsiau lle rydych yn aelod staff.

source: Read the list of courses in which you are an instructor.
cy: Darllen rhestr y cyrsiau lle rydych yn hyfforddwr.

source: To see if you are a global staff user
cy: I weld a ydych yn ddefnyddiwr staff byd-eang

source: Manage your data: {permission}
cy: Rheoli eich data: {permission}

source: You're almost there!
cy: Rydych bron yna!

source: There's just one more step: Before you enroll in a course, you need to activate your account. We've sent an email message to {email_start}{email}{email_end} with instructions for activating your account. If you don't receive this message, check your spam folder.
cy: Dim ond un cam arall: Cyn i chi gofrestru ar gwrs, mae angen i chi ysgogi eich cyfrif. Rydym wedi anfon neges e-bost at {email_start}{email}{email_end} gyda chyfarwyddiadau ar gyfer ysgogi eich cyfrif. Os na fyddwch yn derbyn y neges hon, gwiriwch eich ffolder sbam.

source: Account Activated
cy: Cyfrif wedi'i ysgogi

source: Account already active
cy: Cyfrif eisoes wedi'i ysgogi

source: Activation Invalid
cy: Ysgogiad yn annilys

source: Something went wrong. Email programs sometimes split URLs into two lines, so make sure the URL you're using is formatted correctly. If you still have issues, send us an email message at {email_start}{email}{email_end}.
cy: Aeth rhywbeth o'i le. Weithiau mae rhaglenni e-bost yn hollti URL yn ddwy linell, felly sicrhewch bod yr URL rydych yn ei ddefnyddio wedi'i fformatio'n gywir. Os ydych yn parhau i gael problem, anfonwch e-bost atom yn {email_start}{email}{email_end}.

source: Return to the {link_start}home page{link_end}.
cy: Dychwelyd i'r {link_start}hafan{link_end}.

source: Your Password Reset is Complete
cy: Wedi cwblhau ailosod cyfrinair

source: Password Reset Complete
cy: Wedi cwblhau ailosod cyfrinair

source: Your password has been reset. {start_link}Sign-in to your account.{end_link}
cy: Mae eich cyfrinair wedi cael ei ailosod. {start_link}Mewngofnodi i'ch cyfrif.{end_link}

source: Reset Your {platform_name} Password
cy: Ailosod eich cyfrinair {platform_name}

source: Error Resetting Password
cy: Gwall wrth ailosod cyfrinair

source: You must enter and confirm your new password.
cy: Rhaid i chi fewnbynnu a chadarnhau eich cyfrinair newydd.

source: The text in both password fields must match.
cy: Rhaid i'r testun yn y blychau cyfrinair gyd-fynd.

source: Reset Your Password
cy: Ailosod eich cyfrinair

source: Enter and confirm your new password.
cy: Rhowch eich cyfrinair newydd a'i gadarnhau.

source: New Password
cy: Cyfrinair newydd

source: Confirm Password
cy: Cadarnhau'r cyfrinair

source: Invalid Password Reset Link
cy: Dolen ailosod cyfrinair annilys

source: Password reset successful
cy: Ailosodwyd y cyfrinair yn llwyddiannus

source: We've e-mailed you instructions for setting your password to the e-mail address you submitted. You should be receiving it shortly.
cy: Rydym wedi e-bostio cyfarwyddiadau atoch ar gyfer gosod eich cyfrinair at y cyfeiriad e-bost a roesoch. Dylech eu derbyn cyn hir.

source: Billing Details
cy: Manylion bilio

source: You can proceed to payment at any point in time. Any additional information you provide will be included in your receipt.
cy: Gallwch fynd ymlaen i dalu ar unrhyw adeg Bydd unrhyw wybodaeth ychwanegol a ddarparwch yn cael ei gynnwys yn eich derbynneb.

source: Purchasing Organizational Details
cy: Manylion trefniadol yr archeb

source: Purchasing organization
cy: Y sefydliad sy'n prynu

source: Purchase order number (if any)
cy: Rhif yr archeb (os o gwbl)

source: email@example.com
cy: ebost@enghraifft.com

source: Additional Receipt Recipient
cy: Derbynnydd derbynneb ychwanegol

source: If no additional billing details are populated the payment confirmation will be sent to the user making the purchase.
cy: Os na roddir manylion bilio ychwanegol bydd y cadarnhad talu yn cael ei anfon at y defnyddiwr sy'n archebu.

source: Payment processing occurs on a separate secure site.
cy: Mae'r taliad yn cael ei brosesu ar safle diogel ar wahân.

source: Your Shopping cart is currently empty.
cy: Mae eich troli siop yn wag ar hyn o bryd.

source: View Courses
cy: Gweld y cyrsiau

source: Payment
cy: Taliad

source: Download CSV Reports
cy: Lawrlwytho adroddiadau CSV

source: Download CSV Data
cy: Lawrlwytho data CSV

source: There was an error in your date input. It should be formatted as YYYY-MM-DD
cy: Roedd gwall yn y dyddiad a roesoch. Dylai gael ei fformatio BBBB-MM-DD

source: These reports are delimited by start and end dates.
cy: Mae'r adroddiadau hyn wedi'u amffinio gan ddyddiadau dechrau a gorffen.
