Repository: zhulinhai/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: cy

source: TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, YOU AGREE THAT NEITHER {platform_name} NOR ANY OF THE {platform_name} PARTICIPANTS WILL BE LIABLE TO YOU FOR ANY LOSS OR DAMAGES, EITHER ACTUAL OR CONSEQUENTIAL, ARISING OUT OF OR RELATING TO THESE TERMS, OR YOUR (OR ANY THIRD PARTY'S) USE OF OR INABILITY TO USE THE APIS OR ANY API CONTENT, OR YOUR RELIANCE UPON INFORMATION OBTAINED FROM OR THROUGH THE APIS, WHETHER YOUR CLAIM IS BASED IN CONTRACT, TORT, STATUTORY OR OTHER LAW.
cy: I'R GRADDAU EITHAF A GANIATEIR DRWY GYFRAITH BERTHNASOL, RYDYCH YN CYTUNO NA FYDD {platform_name} NAC UNRHYW RAI O GYFRANOGWYR {platform_name} YN ATEBOL I CHI AM UNRHYW GOLLED NEU DDIFROD, NAILL AI GWIRIONEDDOL NEU GANLYNIADOL YN CODI O'R TELERAU HYN NEU'N YMWNEUD Â HWY, NEU EICH DEFNYDD CHI (NEU UNRHYW DRYDYDD PARTI) O'R API NEU UNRHYW GYNNWYS API NEU ANALLU I'W DEFNYDDIO, NEU EICH DIBYNIAETH AR WYBODAETH A GAFWYD O'R API NEU DRWYDDYNT, BOED EICH HAWLIAD YN SEILIEDIG MEWN CONTRACT, CAMWEDD, STATUD NEU GYFRAITH ARALL.

source: IN PARTICULAR, TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, NEITHER {platform_name} NOR ANY OF THE {platform_name} PARTICIPANTS WILL HAVE ANY LIABILITY FOR ANY CONSEQUENTIAL, INDIRECT, PUNITIVE, SPECIAL, EXEMPLARY OR INCIDENTAL DAMAGES, WHETHER FORESEEABLE OR UNFORESEEABLE AND WHETHER OR NOT {platform_name} OR ANY OF THE {platform_name} PARTICIPANTS HAS BEEN NEGLIGENT OR OTHERWISE AT FAULT (INCLUDING, BUT NOT LIMITED TO, CLAIMS FOR DEFAMATION, ERRORS, LOSS OF PROFITS, LOSS OF DATA OR INTERRUPTION IN AVAILABILITY OF DATA).
cy: YN BENODOL, I'R GRADDAU EITHAF A GANIATEIR GAN GYFRAITH BERTHNASOL, NI FYDD {platform_name} NAC UNRHYW RAI O GYFRANOGWYR {platform_name} YN ATEBOL AM UNRHYW DDIFROD GANLYNIADOL, ANUNIONGYCHOL, COSBOL, ARBENNIG, IAWNDAL COSBEDIGAETHOL NEU DDAMWEINIOL, BOED YN RHAGWELADWY NEU'N ANRHAGWELADWY AC NI WAETH A FU {platform_name} NEU UNRHYW RAI O GYFRANOGWYR Y{platform_name} YN ESGEULUS NEU FEL ARALL AR FAI (GAN GYNNWYS, OND HEB FOD YN GYFYNGEDIG I, HAWLIADAU AM DDIFENWI, GWALLAU, COLLI ELW, COLLI DATA NEU DORIAD YN ARGAELEDD DATA.

source: CERTAIN STATE LAWS DO NOT ALLOW LIMITATIONS ON IMPLIED WARRANTIES OR THE EXCLUSION OR LIMITATION OF CERTAIN DAMAGES. IF THESE LAWS APPLY TO YOU, SOME OR ALL OF THE ABOVE DISCLAIMERS, EXCLUSIONS, OR LIMITATIONS MAY NOT APPLY TO YOU, AND YOU MIGHT HAVE ADDITIONAL RIGHTS.
cy: NID YW RHAI CYFREITHIAU GWLADWRIAETHAU YN CANIATÁU CYFYNGIADAU AR WARANTIAU DEALLEDIG NAC EITHRIO NEU GYFYNGU AR NIWED PENODOL. OS YW'R CYFREITHIAU HYN YN GYMWYS I CHI, MAE'N BOSIB NAD YW POB UN NEU'R HOLL YMWADIADAU, EITHRIADAU NEU GYFYNGIADAU UCHOD YN BERTHNASOL I CHI, AC MAE'N BOSIB BOD GENNYCH HAWLIAU YCHWANEGOL.

source: The APIs and API Content may include hyperlinks to sites maintained or controlled by others. {platform_name} and the {platform_name} Participants are not responsible for and do not routinely screen, approve, review or endorse the contents of or use of any of the products or services that may be offered at these sites. If you decide to access linked third-party websites, you do so at your own risk.
cy: Gall yr API a Chynnwys API gynnwys hyperddolen i safleoedd a gynhelir ac a reolir gan eraill. Nid yw {platform_name} a chyfranogwyr {platform_name} yn gyfrifol am nac yn rheolaidd yn sgrinio, cymeradwyo, adolygu neu gadarnhau cynnwys neu'r defnydd unrhyw rai o'ch cynnyrch neu wasanaethau a all fod yn cael eu cynnig gan y safleoedd hyn. Os byddwch yn penderfynu cael mynediad i wefannau trydydd parti, eich cyfrifoldeb chi yw hynny.

source: To the maximum extent permitted by applicable law, you agree to defend, hold harmless and indemnify {platform_name} and the {platform_name} Participants, and their respective subsidiaries, affiliates, officers, faculty, students, fellows, governing board members, agents and employees from and against any third-party claims, actions or demands arising out of, resulting from or in any way related to your use of the APIs and any API Content, including any liability or expense arising from any and all claims, losses, damages (actual and consequential), suits, judgments, litigation costs and attorneys' fees, of every kind and nature. In such a case, {platform_name} or one of the {platform_name} Participants will provide you with written notice of such claim, suit or action.
cy: I'r graddau eithaf a ganiateir gan gyfraith berthnasol, rydych yn cytuno i amddiffyn, cynnal yn ddiniwed ac indemnio {platform_name} a chyfranogwyr {platform_name}, a'u his-gwmnïau, cysylltiadau, swyddogion, cyfadrannau, myfyrwyr, cymrodorion, aelodau bwrdd llywodraethu, asiantau a gweithwyr am ac yn erbyn unrhyw hawliadau, gweithredoedd neu alwadau trydydd parti yn codi o neu yn gysylltiedig mewn unrhyw fodd i'ch defnydd o'r API neu unrhyw Gynnwys API, gan gynnwys unrhyw atebolrwydd neu dreuliau yn cosi o unrhyw a'r holl hawliadau, colledion, niweidiau (gwirioneddol a chanlyniadol), achosion, dedfrydau, costau mynd i gyfraith a ffioedd atwrnai, o bob math a natur. Yn y fath achos, bydd {platform_name} neu un o gyfranogwyr {platform_name} yn eich darparu â rhybudd ysgrifenedig y fath hawliad, achos neu weithred.

source: General Legal Terms
cy: Termau cyfreithiol cyffredinol

source: The Terms constitute the entire agreement between you and {platform_name} with respect to your use of the APIs and API Content, superseding any prior agreements between you and {platform_name} regarding your use of the APIs and API Content. The failure of {platform_name} to exercise or enforce any right or provision of the Terms shall not constitute a waiver of such right or provision. If any provision of the Terms is found by a court of competent jurisdiction to be invalid, the parties nevertheless agree that the court should endeavor to give effect to the parties' intentions as reflected in the provision and the other provisions of the Terms shall remain in full force and effect. The Terms do not create any third party beneficiary rights or any agency, partnership, or joint venture. For any notice provided to you by {platform_name} under these Terms, {platform_name} may notify you via the email address associated with your {platform_name} account.
cy: Mae'r telerau'n creu cytundeb cyfan rhyngoch chi a {platform_name} ynghylch eich defnydd o API a Chynnwys API, gan ddisodli unrhyw gytundebau blaenorol rhyngoch chi a {platform_name} ynghylch eich defnydd o'r API a Chynnwys API. Ni fydd methiant {platform_name} i arfer neu orfodi unrhyw hawl neu ddarpariaeth y telerau yn golygu ildio'r fath hawl neu ddarpariaeth. Os canfyddir unrhyw ddarpariaeth telerau yn annilys gan lys o awdurdodaeth gymwys, mae'r partïon serch hynny yn cytuno y dylai'r llys geisio gweithredu bwriadau'r partïon fel y'u hadlewyrchir yn y ddarpariaeth a bydd darpariaethau eraill y telerau yn parhau mewn grym ac effaith yn llawn. Nid yw'r telerau yn creu unrhyw hawliau buddiolwyr trydydd parti neu asiantaeth, partneriaeth neu gyd-fenter. Ar gyfer unrhyw rybudd a ddarperir i chi gan {platform_name} o dan y telerau hyn, gall {platform_name} eich hysbysu drwy'r cyfeiriad e-bost cysylltiedig â'ch cyfeiriad {platform_name}.

source: You agree that the Terms, the APIs, and any claim or dispute arising out of or relating to the Terms or the APIs will be governed by the laws of the Commonwealth of Massachusetts, excluding its conflicts of law provisions. You agree that all such claims and disputes will be heard and resolved exclusively in the federal or state courts located in and serving Cambridge, Massachusetts, U.S.A. You consent to the personal jurisdiction of those courts over you for this purpose, and you waive and agree not to assert any objection to such proceedings in those courts (including any defense or objection of lack of proper jurisdiction or venue or inconvenience of forum). Notwithstanding the foregoing, you agree that {platform_name} shall still be allowed to apply to injunctive remedies (or an equivalent type of urgent legal relief) in any jursdiction.
cy: Rydych yn cytuno bod telerau, API, ac unrhyw hawl neu ddadl sy'n codi o'r telerau neu'n ymwneud â hwy neu bydd yr API yn cael eu llywodraethu gan gyfreithiau gwladwriaeth Massachusetts, ac eithrio wrth wrthdaro â darpariaethau'r gyfraith. Rydych yn cytuno bod yr holl hawliau a'r gwrthdaro yn cael gwrandawiad ac yn cael eu datrys yn unig mewn llysoedd ffederal a thaleithiol wedi'u lleoli ac yn gweinyddu yn Cambridge, Massachusetts, U.S.A. Rydych yn cytuno i awdurdodaeth bersonol y llysoedd hynny drosoch chi at y diben hwn, ac rydych yn ildio ac yn cytuno i beidio â datgan unrhyw wrthwynebiad i'r fath weithrediadau yn y llysoedd hynny (gan gynnwys unrhyw amddiffyniad neu wrthwynebiad i ddiffyg awdurdodaeth neu leoliad gywir neu anghyfleustra fforwm). Er gwaethaf yr uchod, rydych yn cytuno y bydd {platform_name} yn parhau i gael ei ganiatáu i geisio am gywiriadau gwaharddol (neu fath cyfwerth o gymorth cyfreithiol brys) mewn unrhyw awdurdodaeth.

source: Termination
cy: Terfyniad

source: You may stop using the APIs at any time. You agree that {platform_name}, in its sole discretion and at any time, may terminate your use of the APIs or any API Content for any reason or no reason, without prior notice or liabiliy.
cy: Gallwch orffen defnyddio'r API ar unrhyw adeg. Rydych yn cytuno y gall {platform_name}, gyda'i ddisgresiwn llwyr ac ar unrhyw adeg, derfynu eich defnydd o'r API neu unrhyw Gynnwys API am unrhyw reswm neu heb reswm, heb ragrybudd neu atebolrwydd.

source: {platform_name} and the {platform_name} Participants reserve the right at any time in their sole discretion to cancel, delay, reschedule or alter the format of any API or API Content offered through {platform_name}, or to cease providing any part or all of the APIs or API Content or related services, and you agree that neither {platform_name} nor any of the {platform_name} Participants will have any liability to you for such an action.
cy: Mae {platform_name} a chyfranogwyr {platform_name} yn cadw'r hawl ar unrhyw adeg yn eu disgresiwn llwyr i ganslo, gohirio, ailamserlenni neu newid fformat unrhyw API neu Gynnwys API a gynigir drwy {platform_name}, neu i orffen darparu unrhyw ran neu'r cyfan o'r API neu Gynnwys API neu wasanaethau perthynol, ac rydych yn cytuno na fydd naill ai {platform_name} nac unrhyw rai o gyfranogwyr {platform_name} yn atebol i chi am unrhyw fath weithred.

source: Upon any termination of the Terms or discontinuation of your access to an API for any reason, your right to use any API and API Content will immediately cease. You will immediately stop using the APIs and delete any cached or stored API Content. All provisions of the Terms that by their nature should survive termination shall survive termination, including, without limitation, ownership provisions, warranty disclaimers, and limitation of liability. Termination of your access to and use of the APIs and API Content shall not relieve you of any obligations arising or accrusing prior to such termination or limit any liability that you otherwise may have to {platform_name}, including without limitation any indemnification obligations contained herein.
cy: Wrth derfynu'r telerau neu ddod â'ch mynediad i API i ben am unrhyw reswm, bydd eich hawl i ddefnyddio unrhyw API neu Gynnwys API yn dod i ben yn syth. Byddwch yn gorffen defnyddio' API yn syth ac yn dileu unrhyw Gynnwys API a storiwyd. Bydd holl ddarpariaethau'r telerau, a ddylai yn ôl eu natur oroesi terfynu, yn goroesi terfynu, gan gynnwys, heb fod yn gyfyngedig i, ddarpariaethau perchnogaeth, ymwadiad warantïau, a chyfyngiadau atebolrwydd. Nid yw terfynu eich mynediad i API a Chynnwys API, a'ch defnydd ohonynt, yn eich rhyddhau o unrhyw rwymedigaethau sy'n codi neu'n digwydd cyn y fath derfynu neu gyfyngu unrhyw atebolrwydd a fyddai gennych i {platform_name}, gan gynnwys ond heb fod yn gyfyngedig i unrhyw rwymedigaethau digolledu a gynhwysir yn hyn.

source: Edit {catalog_name}
cy: Golygu {catalog_name}

source: Download CSV
cy: Lawrlwytho CSV

source: Delete this catalog
cy: Dileu'r catalog

source: Update Catalog
cy: Diweddaru'r catalog

source: Catalogs for {username}
cy: Catalogau ar gyfer {username}

source: Create new catalog:
cy: Creu catalog newydd:

source: Create Catalog
cy: Creu catalog

source: Catalog search
cy: Chwilio'r catalog

source: Catalog Search
cy: Chwilio'r catalog

source: Enter a username to view catalogs belonging to that user.
cy: Rhowch enw defnyddiwr i weld y catalogau sy'n perthyn i'r defnyddiwr hwnnw.

source: Open Calculator
cy: Agor cyfrifiannell

source: Enter equation
cy: Rhowch hafaliad

source: Calculator Input Field
cy: Maes mewnbynnu cyfrifiannell

source: Hints
cy: Awgrymiadau

source: Use the arrow keys to navigate the tips or use the tab key to return to the calculator
cy: Defnyddiwch y saethau i lywio'r awgrymiadau neu ddefnyddio'r botwm tab i ddychwelyd i'r cyfrifiannell

source: For detailed information, see {math_link_start}Entering Mathematical and Scientific Expressions{math_link_end} in the {guide_link_start}edX Guide for Students{guide_link_end}.
cy: Am wybodaeth fanwl, gweler {math_link_start}Entering Mathematical and Scientific Expressions{math_link_end} yn {guide_link_start}edX Guide for Students{guide_link_end}.

source: Tips
cy: Awgrymiadau

source: Use parentheses () to make expressions clear. You can use parentheses inside other parentheses.
cy: Defnyddiwch gromfachau () i wneud mynegiadau'n glir. Gallwch ddefnyddio cromfachau o fewn cromfachau eraill.

source: Do not use spaces in expressions.
cy: Peidiwch a defnyddio bylchau mewn mynegiadau.

source: For constants, indicate multiplication explicitly (example: 5*c).
cy: Ar gyfer cysonion, nodwch y lluosi'n bendant (enghraifft: 5*c).

source: For affixes, type the number and affix without a space (example: 5c).
cy: Ar gyfer atodiadau, nodwch y rhif ac atodi heb fwlch (enghraifft: 5c).

source: For functions, type the name of the function, then the expression in parentheses.
cy: Ar gyfer swyddogaethau, nodwch enw'r swyddogaeth, yna'r mynegiad mewn cromfachau.

source: To Use
cy: I'w ddefnyddio

source: Type
cy: Math

source: Examples
cy: Enghreifftiau

source: Numbers
cy: Rhifau

source: Integers
cy: Cyfanrifau

source: Fractions
cy: Ffracsiynau

source: Decimals
cy: Degolion

source: Operators
cy: Gweithredwyr

source: + - * / (add, subtract, multiply, divide)
cy: #ERROR!

source: ^ (raise to a power)
cy: ^ (codi i bŵer)

source: Constants
cy: Cysonion

source: Affixes
cy: Ychwanegiadau

source: Percent sign (%) and metric affixes (d, c, m, u, n, p, k, M, G, T)
cy: Arwydd canran (%) ac atodiadau metrig (d, c, m, u, n, p, k, M, G, T)

source: Basic functions
cy: Swyddogaethau sylfaenol

source: Trigonometric functions
cy: Swyddogaethau trigonometrig

source: Scientific notation
cy: Nodiant gwyddonol

source: 10^ and the exponent
cy: 10^ a'r mynegrif

source: e notation
cy: e-nodiant

source: 1e and the exponent
cy: 1e a'r mynegrif

source: Calculate
cy: Cyfrifwch

source: Result
cy: Canlyniad

source: CCX Coach Dashboard
cy: Dangosfwrdd CCX Coach

source: Name your CCX
cy: Enwch eich CCX

source: Create a new Custom Course for edX
cy: Creu cwrs ar fesur newydd ar gyfer edX

source: Schedule
cy: Amserlen

source: Grading Policy
cy: Polisi graddio

source: Batch Enrollment
cy: Swp-gofrestru

source: Student Grades
cy: Graddau myfyrwyr

source: Please enter a valid CCX name.
cy: Rhowch enw CCX dilys.

source: Email Addresses/Usernames
cy: Cyfeiriadau e-bost/enwau defnyddwyr

source: Enter email addresses and/or usernames separated by new lines or commas.
cy: Rhowch gyfeiriadau e-bost a/neu enwau defnyddiwr wedi'u gwahanu gan linellau newydd neu atalnod.

source: You will not get notification for emails that bounce, so please double-check spelling.
cy: Ni chewch eich hysbysu os bydd e-bostiau'n bownsio, felly gwiriwch eich sillafu.

source: Auto Enroll
cy: Awto-gofrestru

source: If this option is {em_start}checked{em_end}, users who have not yet registered for {platform_name} will be automatically enrolled.
cy: Os yw'r dewis hwn wedi'i {em_start}nodi â thic{em_end}, bydd y defnyddwyr sydd hyd yma heb gofrestru ar gyfer {platform_name} yn cael eu cofrestru'n awtomataidd.

source: If this option is left {em_start}unchecked{em_end}, users who have not yet registered for {platform_name} will not be enrolled, but will be allowed to enroll once they make an account.
cy: Os bydd y dewi hwn yn cael ei adael {em_start}yn wag{em_end}, ni fydd y defnyddwyr sydd heb gofrestru eto ar gyfer {platform_name} yn cael eu cofrestru, ond byddan yn cael cofrestr wedi iddynt greu cyfrif.

source: Checking this box has no effect if 'Unenroll' is selected.
cy: Wrth roi tic yn y blwch yma ni chaiff effaith os yw 'Dadgofrestru' wedi'i ddewis.

source: Notify users by email
cy: Hysbysu defnyddwyr drwy e-bost

source: If this option is {em_start}checked{em_end}, users will receive an email notification.
cy: Os yw'r dewis hwn wedi'i {em_start}nodi â thic{em_end}, bydd y defnyddwyr yn derbyn hysbysiad e-bost.

source: Student List Management
cy: Rheoli rhestr myfyrwyr

source: CCX student list management response message
cy: Neges ymateb rheoli rhestr myfyrwyr CCX

source: Revoke access
cy: Diddymu caniatâd

source: Enter username or email
cy: Rhowch enw ddefnyddiwr neu e-bost

source: Checking this box has no effect if 'Revoke' is clicked.
cy: Wrth roi tic yn y blwch yma ni chaiff effaith os yw 'Diddymu' wedi'i ddewis.

source: WARNING
cy: RHYBUDD

source: For advanced users only. Errors in the grading policy can lead to the course failing to display. This form does not check the validity of the policy before saving.
cy: Ar gyfer defnyddwyr uwch yn unig. Gall gwallau yn y polisi graddio achosi i'r cwrs fethu ymddangos. Nid yw'r ffurflen hon yn gwirio dilysrwydd y polisi cyn cadw.

source: Most coaches should not need to make changes to the grading policy.
cy: Ni ddylai'r mwyafrif o hyfforddwyr orfod gwneud newidiadau i'r polisi graddio.

source: Save Grading Policy
cy: Cadw'r polisi graddio

source: Date format four digit year dash two digit month dash two digit day
cy: Fformat dyddiad blwyddyn pedwar digid cysylltnod mis dau ddigid cysylltnod diwrnod dau ddigid

source: Time format two digit hours colon two digit minutes
cy: Fformat amser awr dau ddigid colon munudau dau ddigid

source: Time
cy: Amser

source: Set date
cy: Gosod dyddiad

source: You have unsaved changes.
cy: Nid ydych wedi cadw eich newidiadau.

source: There was an error saving changes.
cy: Cafwyd gwall wrth gadw'r newidiadau.

source: Schedule a Unit
cy: Amserlennu uned

source: Start Date
cy: Dyddiad dechrau

source: format four digit year dash two digit month dash two digit day
cy: Fformat blwyddyn pedwar digid cysylltnod mis dau ddigid cysylltnod diwrnod dau ddigid

source: yyyy-mm-dd
cy: bbb-mm-dd

source: Start time format two digit hours colon two digit minutes
cy: Fformat amser dechrau awr dau ddigid colon munudau dau ddigid

source: time
cy: amser

source: (Optional)
cy: (DEWISOL)

source: Due Time format two digit hours colon two digit minutes
cy: Fformat amser disgwyl awr dau ddigid colon munudau dau ddigid

source: Add Unit
cy: Ychwanegu uned

source: Add All Units
cy: Ychwanegu pob uned

source: All units have been added.
cy: Mae'r holl unedau wedi cael eu hychwanegu.

source: View gradebook
cy: Gweld llyfr graddau

source: Download student grades
cy: Lawrlwytho graddau myfyrwyr

source: Print or share your certificate:
cy: Argraffwch neu rannwch eich tystysgrif:

source: Click the link to see my certificate.
cy: Cliciwch ar y ddolen i weld fy nhystysgrif.

source: Post on Facebook
cy: Postio ar Facebook

source: Share on Twitter
cy: Rhannu ar Twitter

source: Tweet this Accomplishment. Pop up window.
cy: Trydarwch am eich cyflawniad. Ffenestr naid.

source: Add to LinkedIn Profile
cy: Ychwanegu at broffil LinkedIn

source: Add to Mozilla Backpack
cy: Ychwanegu at Mozilla Backpack

source: Print Certificate
cy: Argraffu'r dystysgrif

source: {platform_name} Home
cy: {platform_name} Cartref

source: Noted by
cy: Nodwyd gan

source: Supported by the following organizations
cy: Cefnogwyd gan y sefydliadau hyn

source: Cannot Find Certificate
cy: Yn methu dod o hyd i dystysgrif

source: We cannot find a certificate with this URL or ID number. If you are trying to validate a certificate, make sure that the URL or ID number is correct. If you are sure that the URL or ID number is correct, contact support.
cy: Ni allwn ddod o hyd i dystysgrif gyda'r URL neu'r rhif adnabod hwn. Os ydych yn ceisio gwirio tystysgrif, sicrhewch bod yr URL neu'r rhif adnabod yn gywir. Os ydych yn siŵr bod yr URL neu'r rhif adnabod yn gywir, cysylltwch â chefnogaeth.

source: Invalid Certificate Configuration.
cy: Ffurfweddiad tystysgrif annilys.

source: There is a problem with this certificate.
cy: Ceir problem gyda'r dystysgrif hon.

source: To resolve the problem, your partner manager should verify that the following information is correct.
cy: I ddatrys y broblem, dylai eich rheolwr partner wirio bod yr wybodaeth yn gywir.

source: The institution&#39;s logo.
cy: Logo'r institution&#39;s.

source: The institution that is linked to the course.
cy: Y sefydliad sy'n gysylltiedig â'r cwrs.

source: The course information in the Course Administration tool.
cy: Yr wybodaeth cwrs yn yr offer Gweinyddu'r Cwrs.

source: If all of the information is correct and the problem persists, contact technical support.
cy: Os yw'r holl wybodaeth yn gywir a'r broblem yn parhau, cysylltwch â chefnogaeth dechnegol.

source: Checkout Cancelled
cy: Canslwyd y talu

source: Your transaction has been cancelled. If you feel an error has occurred, contact {email}.
cy: Cafodd eich trafodyn ei ganslo. Os teimlwch fod gwall wedi digwydd, cysylltwch â {email}.

source: Checkout Error
cy: Gwall wrth dalu

source: An error has occurred with your payment. <b>You have not been charged.</b> Please try to submit your payment again. If this problem persists, contact {email}.
cy: Cafwyd gwall gyda'ch taliad. <b>Ni chodwyd tâl arnoch.</b> Ceisiwch gyflwyno eich taliad eto. Os bydd y broblem yn parhau, cysylltwch â {email}.

source: Loading Order Data...
cy: Llwytho data'r archeb...

source: Please wait while we retrieve your order details.
cy: Arhoswch wrth i ni ganfod manylion eich archeb.

source: Enroll In {course_name} | Choose Your Track
cy: Cofrestru ar {course_name} | Dewiswch eich llwybr

source: Sorry, there was an error when trying to enroll you
cy: Mae'n flin gennym, ond cafwyd gwall wrth geisio'ch cofrestru

source: Pursue Academic Credit with a Verified Certificate
cy: Dilyn credyd academaidd gyda thystysgrif a wiriwyd

source: Become eligible for academic credit and highlight your new skills and knowledge with a verified certificate. Use this valuable credential to qualify for academic credit, advance your career, or strengthen your school applications.
cy: Dewch yn gymwys am gredyd academaidd ac amlygwch eich sgiliau a'ch gwybodaeth newydd gyda thystysgrif wedi'i gwirio. Defnyddiwch y cymhwyster gwerthfawr hwn i gymhwyso ar gyfer credyd academaidd, i ddatblygu eich gyrfa neu i gryfhau eich ceisiadau i golegau.

source: Benefits of a Verified Certificate
cy: Buddion tystysgrif wedi'i gwirio

source: {b_start}Eligible for credit:{b_end} Receive academic credit after successfully completing the course
cy: {b_start}Yn gymwys am gredyd:{b_end} Derbyniwch gredyd academaidd am gwblhau'r cwrs yn llwyddiannus

source: {b_start}Official:{b_end} Receive an instructor-signed certificate with the institution's logo
cy: {b_start}Swyddogol:{b_end} Derbyniwch dystysgrif wedi'i llofnodi gan yr hyfforddwr a chyda logo'r sefydliad
