Repository: zhulinhai/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: cy

source: {b_start}Easily shareable:{b_end} Add the certificate to your CV or resume, or post it directly on LinkedIn
cy: {b_start}Yn hawdd ei rhannu:{b_end} Ychwanegwch eich dewis o dystysgrif i'ch CV neu grynodeb waith, neu ei phostio'n uniongyrchol ar LinkedIn

source: Pursue a Verified Certificate
cy: Dilyn tystysgrif a wiriwyd

source: Highlight your new knowledge and skills with a verified certificate. Use this valuable credential to improve your job prospects and advance your career, or highlight your certificate in school applications.
cy: Amlygu eich gwybodaeth a'ch sgiliau newydd gyda thystysgrif wedi'i gwirio. Defnyddiwch y cymhwyster gwerthfawr hwn i wella eich rhagolygon gwaith a datblygu eich gyrfa neu i gryfhau eich ceisiadau i golegau.

source: {b_start}Official: {b_end}Receive an instructor-signed certificate with the institution's logo
cy: {b_start}Swyddogol: {b_end}Derbyniwch dystysgrif wedi'i llofnodi gan yr hyfforddwr a chyda logo'r sefydliad

source: {b_start}Easily shareable: {b_end}Add the certificate to your CV or resume, or post it directly on LinkedIn
cy: {b_start}Yn hawdd ei rhannu: {b_end}Ychwanegu'r dystysgrif i'ch CV neu grynodeb waith, neu ei phostio'n uniongyrchol ar LinkedIn

source: {b_start}Motivating: {b_end}Give yourself an additional incentive to complete the course
cy: {b_start}Ysgogol: {b_end}Rhowch ysgogiad ychwanegol i'ch hunan i gwblhau'r cwrs

source: Audit This Course
cy: Cynnal awdit o'r cwrs

source: Audit this course for free and have complete access to all the course material, activities, tests, and forums.
cy: Cynhaliwch awdit o'r cwrs hwn am ddim a chael mynediad llawn i holl ddeunydd, gweithgareddau, profion a fforymau'r cwrs.

source: Audit This Course (No Certificate)
cy: Cynnal awdit o'r cwrs (Dim Tystysgrif)

source: Audit this course for free and have complete access to all the course material, activities, tests, and forums. {b_start}Please note that this track does not offer a certificate for learners who earn a passing grade.{b_end}
cy: Cynhaliwch awdit o'r cwrs hwn am ddim a chael mynediad llawn i holl ddeunydd, gweithgareddau, profion a fforymau'r cwrs. {b_start}Sylwer nad yw'r llwybr hwn yn cynnig tystysgrif i ddysgwyr sy'n ennill gradd llwyddo.{b_end}

source: {chapter} current chapter
cy: Y bennod gyfredol {chapter}

source: due {date}
cy: erbyn {date}

source: {section_format} due {{date}}
cy: {section_format} erbyn {{date}}

source: This content is graded
cy: Caiff y cynnwys hwn ei raddio

source: An error occurred. Please try again later.
cy: Gwall wedi digwydd. Rhowch gynnig arall arni nes ymlaen.

source: The currently logged-in user account does not have permission to enroll in this course. You may need to {start_logout_tag}log out{end_tag} then try the enroll button again. Please visit the {start_help_tag}help page{end_tag} for a possible solution.
cy: Nid oes gan y defnyddiwr sydd wedi mewngofnodi ar hyn o bryd hawl i gofrestru ar y cwrs hwn. Mae'n bosib bod angen i chi {start_logout_tag}allgofnodi{end_tag} ac yna geisio'r botwm cofrestru eto. Ewch i'r {start_help_tag}dudalen help {end_tag} am ddatrysiad posib.

source: You are enrolled in this course
cy: Rydych wedi'ch cofrestru ar y cwrs hwn

source: View Course
cy: Gweld y cwrs

source: This course is in your <a href="{cart_link}">cart</a>.
cy: Mae' cwrs hwn yn eich <a href="{cart_link}">cart</a>.

source: Course is full
cy: Mae'r cwrs yn llawn

source: Enrollment in this course is by invitation only
cy: Gellir ond cofrestru ar y cwrs hwn drwy wahoddiad yn unig

source: Enrollment is Closed
cy: Mae cofrestru wedi cau

source: Add {course_name} to Cart <span>({price} USD)</span>
cy: Ychwanegu {course_name} i'r troli <span>({price} USD)</span>

source: Enroll in {course_name}
cy: Cofrestru ar gyfer {course_name}

source: View About Page in studio
cy: Gweld y dudalen Amdano yn studio

source: Classes Start
cy: Dosbarthiadau'n dechrau

source: Classes End
cy: Dosbarthiadau'n gorffen

source: Estimated Effort
cy: Ymdrech a amcangyfrifir

source: Prerequisites
cy: Rhagofynion

source: You must successfully complete {link_start}{prc_display}{link_end} before you begin this course.
cy: Mae'n rhaid i chi gwblhau {link_start}{prc_display}{link_end} yn llwyddiannus cyn i chi ddechrau'r cwrs hwn.

source: Additional Resources
cy: Adnoddau ychwanegol

source: enroll
cy: cofrestru

source: Share with friends and family!
cy: Rhannu gyda chyfeillion a theulu!

source: I just enrolled in {number} {title} through {account}: {url}
cy: Dwi newydd gofrestru yn {number} {title} trwy {account}: {url}

source: Take a course with {platform} online
cy: Dilyn cwrs gyda {platform} ar-lein

source: I just enrolled in {number} {title} through {platform} {url}
cy: Dwi newydd gofrestru yn {number} {title} trwy {platform} {url}

source: Tweet that you've enrolled in this course
cy: Trydarwch eich bod eisoes wedi'ch cofrestru ar y cwrs hwn

source: Post a Facebook message to say you've enrolled in this course
cy: Postiwch neges Facebook yn dweud eich bod wedi cofrestru ar y cwrs hwn

source: Email someone to say you've enrolled in this course
cy: E-bostiwch rhywun i ddweud eich bod wedi cofrestru ar y cwrs hwn

source: Course Material
cy: Deunydd y cwrs

source: Hide
cy: Cuddio

source: Show
cy: Dangos

source: Show Earlier Course Updates
cy: Dangos diweddariadau blaenorol i'r cwrs

source: List of Courses
cy: Rhestr o'r cyrsiau

source: Refine Your Search
cy: Mireinio eich chwiliad

source: {course_number} Courseware
cy: Deunydd cwrs {course_number}

source: Course Utilities
cy: Gwasanaethau'r cwrs

source: Courseware
cy: Deunydd cwrs

source: Bookmarks
cy: Nodau tudalen

source: Course Search
cy: Chwilio am gwrs

source: No content has been added to this course
cy: Nid ychwanegwyd cynnwys i'r cwrs hwn

source: Your score is {current_score}%. You have passed the entrance exam.
cy: Eich sgôr yw {current_score}%. Rydych wedi llwyddo yn yr arholiad mynediad.

source: Gradebook
cy: Llyfr graddio

source: Search students
cy: Chwilio am fyfyriwr

source: previous page
cy: tudalen flaenorol

source: of
cy: o

source: next page
cy: tudalen newydd

source: {course_number} Course Info
cy: Gwybodaeth am gwrs {course_number}

source: You are not enrolled yet
cy: Nid ydych wedi corfestru eto

source: You are not currently enrolled in this course. {link_start}Sign up now!{link_end}
cy: Nid ydych wedi'ch cofrestru ar y cwrs hwn ar hyn o bryd. {link_start}Cofrestrwch nawr!{link_end}

source: Welcome to {org}'s {course_name}
cy: Croeso i {org}'s {course_name}

source: Welcome to {org}'s {course_title}
cy: Croeso i {org}'s {course_title}

source: Resume Course
cy: Parhau â'r cwrs

source: Start Course
cy: Parhau â'r cwrs

source: View Updates in Studio
cy: Gweld y diweddariadau yn Studio

source: Course Updates and News
cy: Y diweddaraf am y cwrs a newyddion

source: Handout Navigation
cy: Llywio taflenni

source: News - MITx 6.002x
cy: Newyddion - MITx 6.002x

source: Updates to Discussion Posts You Follow
cy: Diweddariadau i bostiadau trafodaeth rydych yn eu dilyn

source: {course_number} Progress
cy: Cynnydd {course_number}

source: View Grading in studio
cy: Gweld graddio yn Studio

source: Course Progress for Student '{username}' ({email})
cy: Cynnydd y myfyriwr '{username}' ({email}) ar y cwrs

source: View Certificate
cy: Gweld y dystysgrif

source: Opens in a new browser window
cy: Yn agor mewn ffenestr porwr newydd

source: Download Your Certificate
cy: Lawrlwytho eich tystysgrif

source: Request Certificate
cy: Cais am dystysgrif

source: Requirements for Course Credit
cy: Gofynion ar gyfer credyd y cwrs

source: {student_name}, you are no longer eligible for credit in this course.
cy: {student_name}, nid ydych bellach yn gymwys am gredyd ar y cwrs hwn.

source: {student_name}, you have met the requirements for credit in this course. {a_start}Go to your dashboard{a_end} to purchase course credit.
cy: {student_name}, rydych wedi bodloni'r gofynion am gredyd ar y cwrs hwn. {a_start}Ewch i'ch dangosfwrdd{a_end} i brynu credyd cwrs.

source: {student_name}, you have not yet met the requirements for credit.
cy: {student_name}, nid ydych wedi bodloni'r gofynion am gredyd eto.

source: Information about course credit requirements
cy: Gwybodaeth am ofynion credydau cwrs

source: Verification Submitted
cy: Cyflwynwyd y gwiriad

source: Verification Failed
cy: Methodd y gwirio

source: Verification Declined
cy: Gwrthodwyd gwirio

source: Completed by {date}
cy: Cwblhawyd erbyn {date}

source: Upcoming
cy: I ddod

source: Less
cy: Llai

source: Details for each chapter
cy: Manylion pob pennod

source: {earned} of {total} possible points
cy: {earned} o'r {total} pwyntiau sy'n bosib

source: No problem scores in this section
cy: Dim sgorau sy'n broblem yn yr adran hon

source: {course.display_number_with_default} Course Info
cy: {course.display_number_with_default} Mae gwybodaeth y cwrs

source: needs attention
cy: angen sylw

source: You were most recently in {section_link}. If you're done with that, choose another section on the left.
cy: Roeddech chi yn ddiwethaf {section_link}. Os ydych wedi gorffen gyda hyn, dewiswch adran arall ar y chwith.

source: Hi {name},
cy: Helo {name},

source: Hi,
cy: Helo,

source: Congratulations! You are eligible to receive course credit from {providers} for successfully completing your {platform_name} course! {link_start}Get your credit now.{link_end}
cy: Llongyfarchiadau! Rydych yn gymwys ar gyfer derbyn credyd cwrs gan {providers} am gwblhau eich cwrs {platform_name} yn llwyddiannus! {link_start}Mynnwch eich credyd nawr.{link_end}

source: Congratulations! You are eligible to receive course credit for successfully completing your {platform_name} course! {link_start}Get your credit now.{link_end}
cy: Llongyfarchiadau! Rydych yn gymwys ar gyfer derbyn credyd cwrs am gwblhau eich cwrs {platform_name} yn llwyddiannus! {link_start}Mynnwch eich credyd nawr.{link_end}

source: Course credit can help you get a jump start on your university degree, finish a degree already started, or fulfill requirements at a different academic institution.
cy: Gall credyd cwrs eich helpu i gael dechrau da ar eich gradd brifysgol, gorffen gradd rydych eisoes wedi'i dechrau, neu gyflawni gofynion sefydliad academaidd gwahanol.

source: To get course credit, simply go to your {link_start}{platform_name} dashboard{link_end} and click the <b>Get Credit</b> button. After you receive your credit, you will also have an official academic transcript at the institution that granted the credit.
cy: I gael credyd cwrs, ewch i'ch {link_start} dangosfwrdd {platform_name}{link_end} a chlicio ar fotwm <b>Cael credyd</b>. Wedi i chi dderbyn eich credyd, byddwch hefyd yn derbyn trawsgrifiad academaidd swyddogol gan y sefydliad a roddodd y credyd i chi.

source: We hope you enjoyed the course, and we hope to see you in future {platform_name} courses!
cy: Gobeithiwn eich bod wedi mwynhau'r cwrs, a gobeithiwn eich gweld ar gyrsiau {platform_name} yn y dyfodol!

source: The {platform_name} Team
cy: Tîm {platform_name}

source: {link_start}Click here for more information on credit at {platform_name}{link_end}.
cy: {link_start}Cliciwch yma am fwy o wybodaeth am gredyd yn {platform_name}{link_end}.

source: Final course details are being wrapped up at this time. Your final standing will be available shortly.
cy: Mae manylion terfynol y cwrs yn cael eu gorffen ar hyn o bryd. Bydd eich statws terfynol ar gael cyn hir.

source: Your final grade:
cy: Eich gradd derfynol:

source: Grade required for a {cert_name_short}:
cy: Y radd ofynnol ar gyfer {cert_name_short}:

source: Grade required to pass this course:
cy: Y radd sydd ei hangen i basio'r cwrs hwn:

source: Your verified {cert_name_long} is being held pending confirmation that the issuance of your {cert_name_short} is in compliance with strict U.S. embargoes on Iran, Cuba, Syria and Sudan. If you think our system has mistakenly identified you as being connected with one of those countries, please let us know by contacting {email}. If you would like a refund on your {cert_name_long}, please contact our billing address {billing_email}
cy: Mae eich {cert_name_long} a wiriwyd yn cael ei ddal wrth aros am gadarnhad fod dyroddi'ch {cert_name_short} mewn cydymffurfiaeth ag embargoau llym yr U.D. ar Iran, Ciwba, Syria a Swdan. Os credwch bod ein system wedi nodi'n anghywir eich bod yn gysylltiedig ag un o'r gwledydd hynny, rhowch wybod i ni drwy e-bostio {email}. Os hoffech ad-daliad ar eich {cert_name_long}, cysylltwch â'n cyfeiriad bilio {billing_email}

source: Your {cert_name_long} is being held pending confirmation that the issuance of your {cert_name_short} is in compliance with strict U.S. embargoes on Iran, Cuba, Syria and Sudan. If you think our system has mistakenly identified you as being connected with one of those countries, please let us know by contacting {email}.
cy: Mae eich {cert_name_long} yn cael ei ddal wrth aros am gadarnhad fod dyroddi'ch {cert_name_short} mewn cydymffurfiaeth ag embargoau llym yr U.D. ar Iran, Ciwba, Syria a Swdan. Os credwch bod ein system wedi nodi'n anghywir eich bod yn gysylltiedig ag un o'r gwledydd hynny, rhowch wybod i ni drwy e-bostio {email}.

source: Verify your identity now.
cy: Gwiriwch pwy ydych chi nawr.

source: Your {cert_name_short} is Generating
cy: Mae eich {cert_name_short} yn cael ei gynhyrchu

source: This link will open the certificate web view
cy: Bydd y ddolen hon yn agor y dystysgrif mewn gweolwg

source: View {cert_name_short}
cy: Gweld {cert_name_short}

source: This link will open/download a PDF document
cy: Bydd y ddolen hon yn agor/lawrlwytho dogfen PDF

source: Download {cert_name_short} (PDF)
cy: Lawrlwytho {cert_name_short} (PDF)

source: Download Your {cert_name_short} (PDF)
cy: Lawrlwytho eich {cert_name_short} (PDF)

source: This link will open/download a PDF document of your verified {cert_name_long}.
cy: Bydd y ddolen hon yn agor/lawrlwytho dogfen PDF o'ch {cert_name_long} wedi'i wirio.

source: Download Your ID Verified {cert_name_short} (PDF)
cy: Lawrlwythwch eich {cert_name_short} (PDF) rhif adnabod wedi'i wirio

source: Complete our course feedback survey
cy: Cwblhau ein harolwg adborth cwrs

source: Add Certificate to LinkedIn Profile
cy: Ychwanegu tystysgrif i broffil LinkedIn

source: Share on LinkedIn
cy: Rhannu ar LinkedIn

source: Since we did not have a valid set of verification photos from you when your {cert_name_long} was generated, we could not grant you a verified {cert_name_short}. An honor code {cert_name_short} has been granted instead.
cy: Gan nad oes gennym gyfres o luniau wedi'i gwirio gennych pan gynhyrchwyd eich {cert_name_long}, nid oeddem yn gallu rhoi {cert_name_short} wedi'i gwirio i chi. Rhoddwyd côd anrhydedd {cert_name_short} yn lle.

source: Course details
cy: Manylion y cwrs

source: {course_number} {course_name} Home Page
cy: Hafan {course_number} {course_name}

source: {course_number} {course_name} Cover Image
cy: Delwedd glawr {course_number} {course_name}

source: Coming Soon
cy: Yn dod cyn hir

source: Ended - {date}
cy: Gorffennwyd - {date}

source: Started - {date}
cy: Dechreuwyd - {date}

source: Starts - {date}
cy: Yn dechrau - {date}

source: View Archived Course
cy: Gweld cwrs a archifwyd

source: Share on Facebook
cy: Rhannu ar Facebook

source: Course options for
cy: Dewisiadau cwrs ar gyfer

source: Available Actions
cy: Camau gweithredu sydd ar gael

source: Are you sure you want to unenroll from the purchased course %(course_name)s (%(course_number)s)?
cy: Ydych chi'n siŵr eich bod am ddadgofrestru o'r cwrs a brynoch %(course_name)s (%(course_number)s)?

source: You will be refunded the amount you paid.
cy: Byddwch yn derbyn ad-daliad am y swm a daloch.

source: You will not be refunded the amount you paid.
cy: Ni fyddwch yn derbyn ad-daliad am y swm a daloch.

source: Are you sure you want to unenroll from %(course_name)s (%(course_number)s)?
cy: Ydych chi'n siŵr eich bod am ddadgofrestru o %(course_name)s (%(course_number)s)?

source: The refund deadline for this course has passed, so you will not receive a refund.
cy: Mae'r dyddiad cau ar gyfer ad-daliadau'r cwrs hwn wedi bod, felly ni fyddwch yn derbyn ad-daliad.

source: Email Settings
cy: Gosodiadau e-bost

source: Related Programs
cy: Rhaglenni cysylltiedig

source: Verification not yet complete.
cy: Nid yw'r gwirio eto wedi'i gwblhau.

source: Almost there!
cy: Bron yna!

source: You still need to verify for this course.
cy: Mae angen i chi wirio o hyd ar gyfer y cwrs yma.

source: Verify Now
cy: Gwirio nawr

source: You have submitted your verification information.
cy: Rydych wedi cyflwyno eich gwybodaeth wirio.

source: You will see a message on your dashboard when the verification process is complete (usually within 1-2 days).
cy: Byddwch yn gweld neges ar eich dangosfwrdd wedi cwblhau'r broses wirio (fel arfer o fewn 1-2 diwrnod).

source: Your current verification will expire soon!
cy: Bydd eich gwiriad cyfredol yn dod i ben yn fuan!

source: You have submitted your reverification information. You will see a message on your dashboard when the verification process is complete (usually within 1-2 days).
cy: Rydych wedi cyflwyno eich gwybodaeth ailwirio. Byddwch yn gweld neges ar eich dangosfwrdd wedi cwblhau'r broses wirio (fel arfer o fewn 1-2 diwrnod).

source: You have successfully verified your ID with edX
cy: Rydych wedi gwirio pwy ydych chi gydag edX yn llwyddiannus

source: Your current verification is effective until {date}.
cy: Mae eich gwiriad cyfredol yn weithredol tan {date}.

source: Your current verification will expire soon.
cy: Bydd eich gwiriad cyfredol yn dod i ben yn fuan.

source: Your current verification will expire in {days} days. {start_link}Re-verify your identity now{end_link} using a webcam and a government-issued photo ID.
cy: Bydd eich gwiriad cyfredol yn dod i ben mewn {days} diwrnod. {start_link}Ail-wiriwch eich hunaniaeth nawr{end_link} gan ddefnyddio gwe-gamera a llun adnabod a roddwyd gan y llywodraeth.

source: Pursue a {cert_name_long} to highlight the knowledge and skills you gain in this course.
cy: Dilynwch {cert_name_long} i amlygu'r wybodaeth a'r sgiliau a enillwch drwy'r cwrs hwn.

source: It's official. It's easily shareable. It's a proven motivator to complete the course. {line_break}{link_start}Learn more about the verified {cert_name_long}{link_end}.
cy: Mae'n swyddogol. Mae'n hawdd ei rannu. Mae'n ysgogydd wedi'i brofi i gwblhau'r cwrs. {line_break}{link_start}Dysgu mwy am y gwirio {cert_name_long}{link_end}.

source: Upgrade to Verified
cy: Uwchraddio i gwiriwyd

source: You can no longer access this course because payment has not yet been received. You can {contact_link_start}contact the account holder{contact_link_end} to request payment, or you can {unenroll_link_start}unenroll{unenroll_link_end} from this course
cy: Ni chewch fynediad bellach i'r cwrs am na dderbyniwyd taliad eto. Gallwch {contact_link_start}gysylltu â deilydd y cyfrif{contact_link_end} i ofyn am daliad, neu gallwch {unenroll_link_start}ddadgofrestru{unenroll_link_end} o'r cwrs hwn

source: You have completed this course and are eligible to purchase course credit. Select <strong>Get Credit</strong> to get started.
cy: Rydych wedi cwblhau'r cwrs yma ac yn gallu prynu credyd cwrs. Dewiswch <strong>Get Credit</strong> i ddechrau.

source: You are now eligible for credit from {provider}. Congratulations!
cy: Rydych nawr yn gymwys am gredyd gan {provider}. Llongyfarchiadau!

source: Get Credit
cy: Cael credyd

source: Thank you for your payment. To receive course credit, you must now request credit at the {link_to_provider_site} website. Select <b>Request Credit</b> to get started.
cy: Diolch am eich taliad. I dderbyn credyd cwrs, rhaid i chi nawr wneud cais am gredyd ar wefan {link_to_provider_site}. Dewiswch <b>Request Credit</b> i ddechrau.

source: Request Credit
cy: Cais am gredyd

source: {provider_name} has received your course credit request. We will update you when credit processing is complete.
cy: Mae {provider_name} wedi derbyn eich cais am gredyd cwrs. Byddwn yn rhoi'r diweddaraf i chi pan fydd prosesu'r credyd wedi'i gwblhau.

source: View Details
cy: Gweld manylion

source: <b>Congratulations!</b> {provider_name} has approved your request for course credit. To see your course credit, visit the {link_to_provider_site} website.
cy: <b>Llongyfarchiadau!</b> Mae {provider_name} wedi cymeradwyo eich cais am gredyd cwrs. I weld credyd eich cwrs, ewch i wefan {link_to_provider_site}.

source: View Credit
cy: Gweld y credydau

source: {provider_name} did not approve your request for course credit. For more information, contact {link_to_provider_site} directly.
cy: Ni wnaeth {provider_name} gymeradwyo eich cais am gredyd cwrs. Am fwy o wybodaeth, cysylltwch â {link_to_provider_site} yn uniongyrchol.

source: An error occurred with this transaction. For help, contact {support_email}.
cy: Cafwyd gwall gyda'r trafodyn. Am gymorth, cysylltwch â {support_email}.

source: Current Verification Status: Approved
cy: Statws gwirio cyfredol: Cymeradwywyd

source: Your edX verification has been approved. Your verification is effective for one year after submission.
cy: Mae eich gwiriad edX wedi cael ei gymeradwyo. Mae eich gwiriad mewn grym am flwyddyn wedi'i gyflwyno.

source: Current Verification Status: Pending
cy: Statws gwirio cyfredol: Yn yr arfaeth

source: Your edX ID verification is pending. Your verification information has been submitted and will be reviewed shortly.
cy: Mae eich gwiriad hunaniaeth edX yn yr arfaeth. Mae eich gwybodaeth wirio wedi cael ei chyflwyno a bydd yn cael ei hadolygu cyn hir.

source: Current Verification Status: Expired
cy: Statws gwirio cyfredol: Wedi darfod

source: Your verification has expired. To receive a verified certificate, you must submit a new photo of yourself and your government-issued photo ID before the verification deadline for your course.
cy: Mae eich gwiriad wedi darfod. I dderbyn tystysgrif wedi'i gwirio, rhaid i chi gyflwyno llun newydd o'ch hunan a'ch llun adnabod gan y llywodraeth cyn terfyn cau'r gwirio ar gyfer eich cwrs.

source: Resubmit Verification
cy: Ailgyflwyno gwiriad

source: Could Not Link Accounts
cy: Ni ellid cysylltu'r cyfrifon

source: The {provider_name} account you selected is already linked to another {platform_name} account.
cy: Mae'r cyfrif {provider_name} rydych wedi'i ddewis eisoes yn gysylltiedig â chyfrif {platform_name} arall.

source: Results:
cy: Canlyniadau:

source: Topic:
cy: Pwnc:

source: Show Discussion
cy: Dangos y drafodaeth

source: To view live discussions, click Preview or View Live in Unit Settings.
cy: I weld trafodaethau yn fyw, cliciwch ar Rhagolwg neu Weld yn Fyw yn ngosodiadau'r uned.

source: Discussion ID: {discussion_id}
cy: Rhif adnabod y drafodaeth: {discussion_id}

source: Discussion topics list
cy: Rhestr o bynciau trafod

source: Filter Topics
cy: Hidlo pynciau

source: filter topics
cy: Hidlo pynciau

source: All Discussions
cy: Pob trafodaeth

source: Posts I'm Following
cy: Postiadau rwy'n eu dilyn

source: Filter:
cy: Hidlydd:

source: Flagged
cy: Wedi'i nodi

source: in all cohorts
cy: ym mhob cohort

source: Sort:
cy: Trefnu:

source: by recent activity
cy: yn ôl gweithgarwch diweddar

source: by most activity
cy: yn ôl y prysuraf

source: by most votes
cy: yn ôl y mwyaf o bleidleisiau

source: Student Notes
cy: Nodiadau myfyrwyr

source: Highlights and notes you've made in course content
cy: Yr hyn a amlygwyd a nodiadau a wnaethoch yng nghynnwys y cwrs

source: Search notes for:
cy: Chwilio'r nodiadau am:

source: Search notes for...
cy: Chwilio'r nodiadau am...

source: View notes by:
cy: Gweld nodiadau gan:
