Repository: zhulinhai/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: cy

source: Briefly describe your issue
cy: Disgrifiwch y mater yn fyr

source: Tell us the details
cy: Rhowch y manylion i ni

source: Describe what you were doing when you encountered the issue. Include any details that will help us to troubleshoot, including error messages that you saw.
cy: Disgrifiwch beth roeddech yn ei wneud pan gawsoch broblem. Rhowch unrhyw fanylion a fydd yn ein helpu ni i gywiro diffygion, gan gynnwys negeseuon gwallau a welsoch.

source: Thank You!
cy: Diolch!

source: Thank you for your inquiry or feedback. We typically respond to a request within one business day, Monday to Friday. In the meantime, please review our {link_start}detailed FAQs{link_end} where most questions have already been answered.
cy: Diolch am eich ymholiad neu adborth. Fel arfer byddwn yn ateb cais o fewn un diwrnod gwaith, dydd Llun i ddydd Gwener. Yn y cyfamser, darllenwch ein {link_start}cwestiynau cyffredin manwl{link_end} lle mae mwyafrif y cwestiynau wedi cael eu hateb.

source: - Select -
cy: - Dewiswch -

source: Report a Problem
cy: Adrodd am broblem

source: Brief description of the problem
cy: Disgrifiad byr o'r broblem

source: Details of the problem you are encountering{asterisk}
cy: Manylion y broblem rydych yn ei chael{asterisk}

source: suggestion
cy: awgrym

source: Make a Suggestion
cy: Argymell

source: Brief description of your suggestion
cy: Disgrifiad byr o'ch awgrym

source: question
cy: cwestiwn

source: Ask a Question
cy: Holi cwestiwn

source: Brief summary of your question
cy: Crynodeb fer o'ch cwestiwn

source: An error has occurred.
cy: Gwall wedi digwydd.

source: Please {link_start}send us e-mail{link_end}.
cy: {link_start}anfonwch e-bost atom{link_end}.

source: Please try again later.
cy: Rhowch gynnig arall arni nes ymlaen.

source: The course has ended.
cy: Mae'r cwrs wedi gorffen.

source: The due date for this assignment has passed.
cy: Mae dyddiad cau yr aseiniad hwn wedi bod.

source: Because the course has ended, this assignment is no longer available.{line_break}If you have completed this assignment, your grade is available on the {link_start}progress page{link_end}.
cy: Am fod y cwrs wedi dod i ben, nid yw'r aseiniad hwn bellach ar gael{line_break}Os ydych wedi cwblhau'r aseiniad hwn, bydd eich gradd ar gael ar y {link_start}dudalen cynnydd{link_end}.

source: Because the due date has passed, this assignment is no longer available.{line_break}If you have completed this assignment, your grade is available on the {link_start}progress page{link_end}.
cy: Am fod y dyddiad derbyn wedi bod, nid yw'r aseiniad hwn bellach ar gael{line_break}Os ydych wedi cwblhau'r aseiniad hwn, bydd eich gradd ar gael ar y {link_start}dudalen cynnydd{link_end}.

source: Note: only instructors may annotate.
cy: Sylwer: hyfforddwyr gaiff anodi'n unig.

source: Welcome to the Open edX{registered_trademark} platform!
cy: Croeso i blatform {registered_trademark} Open edX!

source: It works! This is the default homepage for this Open edX instance.
cy: Mae'n gweithio! Dyma hafan ddiofyn ar gyfer yr Open edX hwn.

source: Search for a course
cy: Chwilio am gwrs

source: Invalid email change key
cy: Allwedd newid e-bost annilys

source: This e-mail key is not valid. Please check:
cy: Nid yw'r allwedd e-bost yn ddilys. Gwiriwch:

source: Was this key already used? Check whether the e-mail change has already happened.
cy: A ddefnyddiwyd yr allwedd hwn eisoes? Gwiriwch a yw'r newid e-bost wedi digwydd eisoes.

source: Did your e-mail client break the URL into two lines?
cy: A wnaeth eich cleient e-bost dorri'r URL yn ddwy llinell?

source: The keys are valid for a limited amount of time. Has the key expired?
cy: Mae'r allweddi yn ddilys am gyfnod penodol o amser. A yw'r allwedd wedi darfod?

source: Helpful Information
cy: Gwybodaeth ddefnyddiol

source: Login via OpenID
cy: Mewngofnodi trwy OpenID

source: You can now start learning with {platform_name} by logging in with your <a rel="external" href="http://openid.net/">OpenID account</a>.
cy: Gallwch nawr ddechrau dysgu gyda {platform_name} trwy fewngofnodi gyda'ch <a rel="external" href="http://openid.net/">OpenID account</a>.

source: Not Enrolled?
cy: Heb gofrestru?

source: Sign up for {platform_name} today!
cy: Cofrestru ar gyfer {platform_name} heddiw!

source: Need Help?
cy: Angen cymorth arnoch?

source: Looking for help signing in or with your {platform_name} account?
cy: Am gymorth wrth fewngofnodi neu gyda'ch cyfrif {platform_name}?

source: View our help section for answers to commonly asked questions.
cy: Gweld ein hadran help am atebion i gwestiynau a ofynnir yn gyffredin.

source: Log into your {platform_name} Account
cy: Mewngofnodi i'ch cyfrif {platform_name}

source: Log into My {platform_name} Account
cy: Mewngofnodi i fy nghyfrif {platform_name}

source: Access My Courses
cy: Hygyrchu fy nghyrsiau

source: Processing your account information
cy: Prosesu gwybodaeth eich cyfrif

source: Please log in
cy: Mewngofnodwch

source: to access your account and courses
cy: i gael mynediad i'ch cyfrif a'r cyrsiau

source: We're Sorry, {platform_name} accounts are unavailable currently
cy: Mae'n flin gennym, nid yw cyfrifon {platform_name} ar gael ar hyn o bryd

source: We couldn't log you in.
cy: Ni fedrem eich mewngofnodi.

source: Your email or password is incorrect
cy: Mae eich e-bost neu gyfrinair yn anghywir

source: An error occurred when signing you in to {platform_name}.
cy: Cafwyd gwall wrth eich mewngofnodi i {platform_name}.

source: Please provide the following information to log into your {platform_name} account. Required fields are noted by <strong class="indicator">bold text and an asterisk (*)</strong>.
cy: Rhowch yr wybodaeth hon i fewngofnodi i'r cyfrif {platform_name}. Dynodir meysydd gofynnol â <strong class="indicator">thestun trwm a seren (*)</strong>.

source: Account Preferences
cy: Dewisiadau'r cyfrif

source: Sign in with {provider_name}
cy: Mewngofnodi gyda {provider_name}

source: External resource
cy: Adnodd allanol

source: {points} / {total_points} points
cy: {points} / {total_points} pwynt

source: {total_points} points possible
cy: {total_points} o bwyntiau yn bosib

source: View resource in a new window
cy: Gweld yr adnodd mewn ffenestr newydd

source: Please provide launch_url. Click "Edit", and fill in the required fields.
cy: Rhowch launch_url. Cliciwch ar "Golygu", a chwblhau'r meysydd gofynnol.

source: Feedback on your work from the grader:
cy: Adborth ar eich gwaith gan y graddiwr:

source: Press to Launch
cy: Gwasgwch i lansio

source: Manage student accounts
cy: Rheoli cyfrifon myfyrwyr

source: Username:
cy: Enw defnyddiwr:

source: Profile:
cy: Proffil:

source: Image:
cy: Delwedd:

source: Name:
cy: Enw:

source: Choose an action:
cy: Dewis gweithred:

source: View Profile
cy: Gweld proffil

source: Disable Account
cy: Analluogi'r cyfrif

source: Reenable Account
cy: Ailalluogi cyfrif

source: Remove Profile Image
cy: Dileu delwedd proffil

source: Students whose accounts have been disabled
cy: Myfyrwyr y cafodd eu cyfrifon eu hanalluogi

source: (reload your page to refresh)
cy: (ail-lwytho eich tudalen i'w ail-wneud)

source: working
cy: yn gweithio

source: There has been an error on the {platform_name} servers
cy: Cafwyd gwall ar weinyddion {platform_name}

source: We're sorry, this module is temporarily unavailable. Our staff is working to fix it as soon as possible. Please email us at {tech_support_email} to report any problems or downtime.
cy: Mae'n flin gennym, nid yw'r modiwl ar gael dros dro. Mae ein staff yn gweithio i'w gywiro cyn gynted â phosibl. E-bostiwch ni yn {tech_support_email} i adrodd am unrhyw broblemau neu adegau nad yw'n gweithio.

source: Raw data:
cy: Data crai:

source: Global
cy: Byd-eang

source: {platform_name} Home Page
cy: {platform_name} Tudalen gartref

source: Programs
cy: Rhaglenni

source: Shopping Cart
cy: Troli siopa

source: How it Works
cy: Sut mae'n gweithio

source: Schools
cy: Ysgolion

source: Explore Courses
cy: Archwilio cyrsiau

source: Register
cy: Cofrestru

source: Sign in
cy: Mewngofnodi

source: {begin_strong}Warning:{end_strong} Your browser is not fully supported. We strongly recommend using {chrome_link} or {ff_link}.
cy: {begin_strong}Rhybudd:{end_strong} Ni chynhelir eich porwr yn llwyr. Argymhellwn yn gryf eich bod yn defnyddio {chrome_link} neu {ff_link}.

source: You do not have any notes.
cy: Nid oes gennych unrhyw nodiadau.

source: Course View
cy: Gweld y cwrs

source: View this course as:
cy: Gweld y cwrs hwn fel:

source: Username or email:
cy: Enw ddefnyddiwr neu e-bost:

source: Set preview mode
cy: Gosod modd rhagweld

source: You are now viewing the course as {i_start}{user_name}{i_end}.
cy: Rydych nawr yn gweld y cwrs fel {i_start}{user_name}{i_end}.

source: Hint
cy: Awgrym

source: Save
cy: Cadw

source: Save your answer
cy: Cadw eich ateb

source: Reset your answer
cy: Ailosod eich ateb

source: Next Hint
cy: Awgrym nesaf

source: Review
cy: Adolygu

source: Log In
cy: Mewngofnodi

source: Your username, email, and full name will be sent to {destination}, where the collection and use of this information will be governed by their terms of service and privacy policy.
cy: Bydd eich enw defnyddiwr, e-bost ac enw llawn yn cael ei anfon at {destination}, lle caiff casglu a defnyddio'r wybodaeth hon eu rheoli gan eu telerau gwasanaeth a pholisi preifatrwydd.

source: Return To %s
cy: Dychwelyd i %s

source: We're sorry, but this version of your browser is not supported. Try again using a different browser or a newer version of your browser.
cy: Mae'n flin gennym, ond ni chefnogir eich fersiwn chi o'ch porwr. Ceisiwch eto gan ddefnyddio porwr gwahanol neu fersiwn mwy newydd o'ch porwr.

source: The following errors occurred while processing your registration:
cy: Cafwyd y gwallau hyn wrth brosesu eich cofrestriad:

source: Sign up with {provider_name}
cy: Cofrestru gyda {provider_name}

source: Create your own {platform_name} account below
cy: Crëwch eich cyfrif {platform_name} eich hun isod

source: Required fields are noted by <strong class="indicator">bold text and an asterisk (*)</strong>.
cy: Dynodir meysydd gofynnol â <strong class="indicator">thestun trwm a seren (*)</strong>.

source: You've successfully signed in with {selected_provider}.
cy: Rydych wedi mewngofnodi'n llwyddiannus gyda {selected_provider}.

source: We just need a little more information before you start learning with {platform_name}.
cy: Mae angen ychydig mwy o wybodaeth arnom cyn i chi ddechrau dysgu gyda {platform_name}.

source: Will be shown in any discussions or forums you participate in
cy: Bydd i'w weld mewn unrhyw drafodaeth neu fforymau rydych yn cymryd rhan ynddynt

source: cannot be changed later
cy: ni ellir ei newid yn ddiweddarach

source: Welcome {username}
cy: Croeso {username}

source: Enter a Public Display Name:
cy: Rhowch enw a ddangosir yn gyhoeddus:

source: Public Display Name
cy: Enw a ddangosir yn gyhoeddus

source: Additional Personal Information
cy: Gwybodaeth bersonol ychwanegol

source: example: New York
cy: enghraifft: Efrog Newydd

source: Highest Level of Education Completed
cy: Lefel uchaf yr addysg a gwblhawyd

source: Please share with us your reasons for registering with {platform_name}
cy: Rhannwch gyda ni eich rhesymau dros gofrestru gyda {platform_name}

source: Account Acknowledgements
cy: Cydnabyddiaethau'r cyfrif

source: I agree to the {link_start}Terms of Service{link_end}
cy: Cytunaf i'r {link_start}Telerau Gwasanaeth{link_end}

source: I agree to the {link_start}Honor Code{link_end}
cy: Cytunaf i'r {link_start}Côd anrhydedd{link_end}

source: Create My Account
cy: Creu fy nghyfrif

source: Preferences for {platform_name}
cy: Dewisiadau ar gyfer {platform_name}

source: Update my {platform_name} Account
cy: Diweddaru fy nghyfrif {platform_name}

source: Welcome {username}! Please set your preferences below
cy: Croeso {username}! Nodwch eich dewisiadau isod

source: Enter a public username:
cy: Rhowch enw defnyddiwr cyhoeddus:

source: Update My Account
cy: Diweddaru fy nghyfrif

source: Registration Help
cy: Cymorth cofrestru

source: Already registered?
cy: Eisoes wedi cofrestru?

source: Log in
cy: Mewngofnodi

source: Welcome to {platform_name}
cy: Croeso i {platform_name}

source: Registering with {platform_name} gives you access to all of our current and future free courses. Not ready to take a course just yet? Registering puts you on our mailing list - we will update you as courses are added.
cy: Mae cofrestru gyda {platform_name} yn rhoi mynediad i chi i'n holl gyrsiau am ddim cyfredol ac yn y dyfodol. Ddim yn barod i ddilyn y cwrs ar hyn o bryd? Trwy gofrestru rydych yn ymuno â'n rhestr bostion - byddwn yn anfon y diweddaraf i chi wrth ychwanegu cyrsiau.

source: Next Steps
cy: Camau nesaf

source: As part of joining {platform_name}, you will receive an email message with instructions for activating your account. Don't see the email? Check your spam folder and mark {platform_name} emails as 'not spam'. At {platform_name}, we communicate mostly through email.
cy: Fel rhan o ymuno â {platform_name}, byddwch yn derbyn neges e-bost gyda chyfarwyddiadau ar gyfer ysgogi eich cyfrif. Methu gweld yr e-bost? Gwiriwch eich ffolder sbam a nodi e-bostiau {platform_name} 'not spam'. Yn {platform_name}, gallwn gyfathrebu'n bennaf drwy e-bost.

source: Need help registering with {platform_name}?
cy: Angen cymorth wrth gofrestru gyda {platform_name}?

source: View our FAQs for answers to commonly asked questions.
cy: Gweld ein cwestiynau cyffredin am atebion i gwestiynau a ofynnir yn gyffredin.

source: You can find the answers to most of your questions in our list of FAQs. After you enroll in a course, you can also find answers in the course discussions.
cy: Gallwch ddod o hyd i atebion i fwyafrif eich cwestiynau yn ein rhestr cwestiynau cyffredin. Wedi i chi gofrestru ar gwrs, gallwch hefyd ddod o hyd i atebion yn nhrafodaethau'r cwrs.

source: Register for {platform_name}
cy: Cofrestru ar gyfer {platform_name}

source: Create My {platform_name} Account
cy: Creu fy nghyfrif {platform_name}

source: Welcome!
cy: Croeso!

source: Register below to create your {platform_name} account
cy: Cofrestrwch isod i greu eich cyfrif {platform_name}

source: Re-subscribe Successful!
cy: Ail-danysgrifiwyd yn llwyddiannus!

source: You have re-enabled forum notification emails from {platform_name}. You may {dashboard_link_start}return to your dashboard{link_end}.
cy: Rydych wedi ailalluogi derbyn e-bostiau hysbysu fforymau gan {platform_name}. Gallwch {dashboard_link_start}ddychwelyd i'ch dangosfwrdd{link_end}.

source: Previous
cy: Blaenorol

source: Sequence
cy: Dilyniant

source: Next
cy: Nesaf

source: Sign Up for {platform_name}
cy: Cofrestru ar gyfer {platform_name}

source: e.g. yourname@domain.com
cy: e.e. eichenw@parth.com

source: e.g. yourname (shown on forums)
cy: e.e. eich enw (i'w weld ar fforymau)

source: e.g. Your Name (for certificates)
cy: e.e. Eich enw (ar gyfer tystysgrifau)

source: Full Name *
cy: Enw llawn *

source: Ed. Completed
cy: Golygwyd Cwblhawyd

source: Goals in signing up for {platform_name}
cy: Nodau wrth gofrestru ar gyfer {platform_name}

source: Already have an account?
cy: Gennych gyfrif eisoes?

source: Login.
cy: Mewngofnodi.

source: This content experiment uses group configuration '{group_configuration_name}'.
cy: Mae'r arbrawf cynnwys hwn yn defnyddio ffurfweddiad grŵp '{group_configuration_name}'.

source: Active Groups
cy: Grwpiau actif

source: Inactive Groups
cy: Grwpiau anactif

source: Staff Debug Info
cy: Gwybodaeth am ddadfygio staff

source: Submission history
cy: Hanes cyflwyno

source: {platform_name} Content Quality Assessment
cy: Asesiad ansawdd cynnwys {platform_name}

source: Comment
cy: Sylw

source: comment
cy: sylw

source: Optional tag (eg "done" or "broken"):
cy: Tag dewisol (ee "gorffen" neu "torri"):

source: Add comment
cy: Ychwanegu sylw

source: Staff Debug
cy: Dadfygio staff

source: Actions
cy: Gweithredoedd

source: Reset Learner's Attempts to Zero
cy: Ailosod ymgeisiau'r dysgwr i ddim

source: Delete Learner's State
cy: Dileu cyflwr y dysgwr

source: Rescore Learner's Submission
cy: ail-sgorio cyflwyniad y dysgwr

source: Rescore Only If Score Improves
cy: ail-sgorio os yw'r sgôr yn gwella'n unig

source: Module Fields
cy: Meysydd y modiwl

source: XML attributes
cy: priodweddau XML

source: Submission History Viewer
cy: Gwyliwr hanes cyflwyno

source: User:
cy: Defnyddiwr:

source: View History
cy: Gweld hanes

source: {course_number} Textbook
cy: Gwerslyfr {course_number}

source: Textbook Navigation
cy: Llywio gwerslyfr

source: Page
cy: Tudalen

source: Previous page
cy: Tudalen flaenorol

source: Next page
cy: Tudalen newydd

source: Sysadmin Dashboard
cy: Dangosfwrdd Sysadmin

source: Users
cy: Defnyddwyr

source: Staffing and Enrollment
cy: Staffio a chofrestru

source: Git Logs
cy: Logiau git

source: User Management
cy: Rheoli defnyddwyr

source: Email or username
cy: E-bost neu enw defnyddiwr

source: Delete user
cy: Dileu defnyddiwr

source: Create user
cy: Creu defnyddiwr

source: Download list of all users (csv file)
cy: Lawrlwytho rhestr o'r holl ddefnyddwyr (ffeil csv)

source: Check and repair external authentication map
cy: Gwirio ac atgyweirio map dilysu allanol

source: Go to each individual course's Instructor dashboard to manage course enrollment.
cy: Mynd i ddangosfwrdd pob hyfforddwr cwrs unigol i reoli cofrestru ar y cwrs.

source: Manage course staff and instructors
cy: Rheoli staff a hyfforddwyr cyrsiau

source: Download staff and instructor list (csv file)
cy: Lawrlwytho rhestr staff a hyfforddwyr (ffeil csv)

source: Administer Courses
cy: Gweinyddu cyrsiau

source: Repo Location
cy: Lleoliad y gronfa

source: Repo Branch (optional)
cy: Cangen y gronfa (dewisol)

source: Load new course from GitHub
cy: Llwytho cwrs newydd o GitHub

source: Course ID or dir
cy: Rhif adnabod neu gyfeirlyfr y cwrs

source: Delete course from site
cy: Dileu'r cwrs o'r wefan

source: Platform Version
cy: Fersiwn platfform

source: previous
cy: blaenorol

source: Page {current_page} of {total_pages}
cy: Tudalen {current_page} o {total_pages}

source: next
cy: nesaf

source: Recent git load activity for {course_id}
cy: Gweithgarwch llwyth git diweddar ar gyfer {course_id}

source: Date
cy: Dyddiad

source: Git Action
cy: Gweithgarwch git

source: No git import logs have been recorded.
cy: Ni chofnodwyd unrhyw logiau mewnforio git.

source: No git import logs have been recorded for this course.
cy: Ni chofnodwyd unrhyw logiau mewnforio git ar gyfer y cwrs hwn.

source: Source:
cy: Ffynhonnell:

source: Tracking Log
cy: Log olrhain

source: source
cy: ffynhonnell

source: type
cy: math

source: Unsubscribe Successful!
cy: Datdanysgrifio llwyddiannus!

source: You will no longer receive forum notification emails from {platform_name}. You may {dashboard_link_start}return to your dashboard{link_end}. If you did not mean to do this, {undo_link_start}you can re-subscribe{link_end}.
cy: Ni fyddwch bellach yn derbyn e-bostiau hysbysu fforymau gan {platform_name}. Gallwch {dashboard_link_start}ddychwelyd i'ch dangosfwrdd{link_end}. Os nad oeddech yn bwriadu gwneud hyn, {undo_link_start}gallwch ail-danysgrifio{link_end}.

source: Dashboard for:
cy: Dangosfwrdd ar gyfer:

source: Profile
cy: Proffil

source: Using the system
cy: Defnyddio'r system

source: During video playback, use the subtitles and the scroll bar to navigate. Clicking the subtitles is a fast way to skip forwards and backwards by small amounts.
cy: Wrth chwarae'r fideo yn ôl, defnyddiwch yr is-deitlau a'r bar sgrolio i lywio. Mae clicio ar yr is-deitlau'n ffordd gyflym o neidio ymlaen ac yn ôl ychydig bach.

source: If you are on a low-resolution display, the left navigation bar can be hidden by clicking on the set of three left arrows next to it.
cy: Os ydych wedi gosod arddangos eglurdeb isel, gall y bar llywio fod yn gudd drwy glicio ar y tair saeth ar y chwith nesaf ato.

source: If you need bigger or smaller fonts, use your browsers settings to scale them up or down. Under Google Chrome, this is done by pressing ctrl-plus, or ctrl-minus at the same time.
cy: Os oes angen ffont mwy neu lai o faint arnoch, defnyddiwch osodiadau eich porwyr i'w newid. Gyda Google Chrome, gwneir hyn drwy wasgu ctfl-plws, neu ctrl-minws ar yr un pryd.

source: Loading video player
cy: Llwytho chwaraeydd fideo

source: Play video
cy: Chwarae'r fideo

source: No playable video sources found.
cy: Ni ddaethpwyd o hyd i ffynonellau fideo y gellir eu chwarae.

source: Downloads and transcripts
cy: Lawrlwythiadau a thrawsgrifiadau.

source: Download video file
cy: Lawrlwytho ffeil fideo

source: Transcripts
cy: Trawsgrifiadau

source: Download {file}
cy: Lawrlwytho {file}

source: Download transcript
cy: Lawrlwytho trawsgrifiad

source: Handouts
cy: Taflenni

source: Download Handout
cy: Lawrlwytho taflen

source: {num} of {total}
cy: {num} o {total}

source: Your words were:
cy: Eich geiriau oedd:

source: API Access Request
cy: Cais mynediad i API

source: {platform_name} API Access Request
cy: Cais Mynediad API {platform_name}

source: Request API Access
cy: Cais am fynediad API

source: API Access Request Status
cy: Statws cais mynediad i API

source: Your request to access the {platform_name} Course Catalog API is being processed. You will receive a message at the email address in your profile when processing is complete. You can also return to this page to see the status of your API access request.
cy: Mae eich cais i gael mynediad i API catalog cwrs {platform_name} yn cael ei brosesu. Byddwch yn derbyn neges i'r cyfeiriad e-bost a nodir yn eich proffil wedi i'r prosesu orffen. Gallwch hefyd ddychwelyd i'r dudalen hon i weld statws eich cais am fynediad API.

source: Your request to access the {platform_name} Course Catalog API has been denied. If you think this is an error, or for other questions about using this API, contact {api_support_email_link}.
cy: Mae eich cais i gael mynediad i API catalog cwrs {platform_name} wedi cael ei wrthod. Os credwch mai camgymeriad yw hwn, neu os oes gennych gwestiynau eraill am ddefnyddio'r API hwn, cysylltwch â {api_support_email_link}.

source: Your request to access the {platform_name} Course Catalog API has been approved.
cy: Mae eich cais i gael mynediad i API catalog cwrs {platform_name} wedi cael ei gymeradwyo.

source: Application Name
cy: Enw'r cymhwysiad

source: API Client ID
cy: Rhif adnabod cleient API

source: API Client Secret
cy: Cleient cyfrinachol API

source: Redirect URLs
cy: Ailgyfeirio URL

source: If you would like to regenerate your API client information, please use the form below.
cy: Os hoffech ailgynhyrchu eich gwybodaeth cleient API, defnyddiwch y ffurflen isod.

source: Generate API client credentials
cy: Cynhyrchu cymwysterau cleient API

source: To learn more about the {platform_name} Course Catalog API, visit {link_start}our API documentation page{link_end}. For questions about using this API, contact {api_support_email_link}.
cy: I ddysgu mwy am API catalog cwrs {platform_name}, ewch i'n {link_start}tudalen dogfennaeth API{link_end}. Am gwestiynau ynghylch defnyddio'r API hwn, cysylltwch â {api_support_email_link}.

source: API Terms of Service
cy: Telerau gwasanaeth API

source: Terms of Service for {platform_name} APIs
cy: Telerau gwasanaeth ar gyfer API {platform_name}

source: Effective Date: April 12th, 2016
cy: Dyddiad yn weithredol: 12 Ebrill, 2016
