Repository: zhulinhai/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: cy

source: Regenerate for learners who have not received certificates. ({count})
cy: Ailgynhyrchu ar gyfer dysgwyr sydd heb dderbyn tystysgrifau. ({count})

source: Regenerate for learners with audit passing state. ({count})
cy: Ailgynhyrchu ar gyfer dysgwyr gyda chyflwr pasio awdit. ({count})

source: Regenerate for learners with audit not passing state. ({count})
cy: Ailgynhyrchu ar gyfer dysgwyr gyda chyflwr heb basio awdit. ({count})

source: Regenerate for learners in an error state. ({count})
cy: Ailgynhyrchu ar gyfer dysgwyr gyda gwall. ({count})

source: Certificate Generation History
cy: Hanes cynhyrchu tystysgrifau

source: Task name
cy: Enw'r dasg

source: SET CERTIFICATE EXCEPTIONS
cy: GOSOD EITHRIADAU TYSTYSGRIFAU

source: Set exceptions to generate certificates for learners who did not qualify for a certificate but have been given an exception by the course team. After you add learners to the exception list, click Generate Exception Certificates below.
cy: Gosodwch eithriadau i gynhyrchu tystysgrifau ar gyfer dysgwyr nad oedd yn gymwys am dystysgrif, ond sydd wedi derbyn eithriad gan dîm y cwrs. Wedi i chi ychwanegu dysgwyr i'r rhestr eithriadau, cliciwch ar Creu Tystysgrifau Eithrio isod.

source: Invalidate Certificates
cy: Annilysu tystysgrifau

source: Enrollment Information
cy: Gwybodaeth am gofrestru

source: Number of enrollees (admins, staff, and students) by track
cy: Nifer y rhai a gofrestrwyd (gweinyddol, staff a myfyrwyr) yn ôl trac

source: Professional
cy: Proffesiynol

source: Basic Course Information
cy: Gwybodaeth sylfaenol am y cwrs

source: Course Name:
cy: Enw'r cwrs:

source: Course Display Name:
cy: Enw arddangos y cwrs:

source: Course End Date:
cy: Dyddiad gorffen y cwrs:

source: No end date set
cy: Ni osodwyd ddyddiad gorffen

source: Has the course started?
cy: A yw'r cwrs wedi dechrau?

source: Yes
cy: Ie

source: No
cy: Na

source: Has the course ended?
cy: A yw'r cwrs wedi gorffen?

source: Number of sections:
cy: Nifer yr adrannau:

source: Grade Cutoffs:
cy: Terfyna graddau:

source: View detailed Git import logs for this course {link_start}by clicking here{link_end}.
cy: Gweld logiau mewnforio Git manwl ar gyfer y cwrs hwn {link_start}drwy glicio yma{link_end}.

source: Course Warnings
cy: Rhybuddion am y cwrs

source: Click to display the grading configuration for the course. The grading configuration is the breakdown of graded subsections of the course (such as exams and problem sets), and can be changed on the 'Grading' page (under 'Settings') in Studio.
cy: Cliciwch i arddangos y ffurfweddiad graddio ar gyfer y cwrs. Y ffurfweddiad graddio yw'r dadansoddiad o'r is-adrannau wedi'u graddio yn y cwrs (megis arholiadau a setiau problemau), a gellir eu newid ar y dudalen 'Graddio' (o dan 'Gosodiadau') yn Studio.

source: Grading Configuration
cy: Ffurfweddiad graddio

source: Click to download a CSV of anonymized student IDs:
cy: Cliciwch i lawrlwytho CSV o rifau adnabod dienw myfyrwyr:

source: Get Student Anonymized IDs CSV
cy: Cael CSV o rifau adnabod dienw myfyrwyr

source: Reports
cy: Adroddiadau

source: For large courses, generating some reports can take several hours. When report generation is complete, a link that includes the date and time of generation appears in the table below. These reports are generated in the background, meaning it is OK to navigate away from this page while your report is generating.
cy: Ar gyfer cyrsiau mawr, gall cynhyrchu rhai adroddiadau gymryd sawl awr. Pan fydd cynhyrchu adroddiad wedi'i gwblhau, bydd dolen sy'n cynnwys dyddiad ac amser y cynhyrchu yn ymddangos yn y tabl isod. Caiff yr adroddiadau hyn eu cynhyrchu yn y cefndir, sy'n golygu y gallwch lywio ymaith o'r dudalen hon wrth i'ch adroddiad gael ei gynhyrchu.

source: Please be patient and do not click these buttons multiple times. Clicking these buttons multiple times will significantly slow the generation process.
cy: Byddwch yn amyneddgar a pheidiwch â chlicio ar y botymau hyn sawl gwaith. Bydd clicio sawl gwaith ar y botymau hyn yn arafu'r broses gynhyrchu'n sylweddol.

source: Click to generate a CSV file of all students enrolled in this course, along with profile information such as email address and username:
cy: Cliciwch i gynhyrchu ffeil CSV o'r holl fyfyrwyr sydd wedi cofrestru ar y cwrs hwn, ynghyd â gwybodaeth broffil megis cyfeiriad e-bost ac enw defnyddiwr:

source: Download profile information as a CSV
cy: Lawrlwythwch gwybodaeth broffil fel CSv

source: Click to generate a CSV file that lists learners who can enroll in the course but have not yet done so.
cy: Cliciwch i gynhyrchu ffeil CSV sy'n rhestru dysgwyr sy'n gallu cofrestru ar y cwrs, ond sydd heb wneud hynny eto.

source: Download a CSV of learners who can enroll
cy: Lawrlwytho CSV o'r dysgwyr sy'n gallu cofrestru

source: Click to generate a CSV file of all proctored exam results in this course.
cy: Cliciwch i gynhyrchu ffeil CSV o'r holl ganlyniadau arholiadau proctor ar y cwrs hwn.

source: Generate Proctored Exam Results Report
cy: Cynhyrchu adroddiad o ganlyniadau'r arholiadau proctor

source: Click to generate a CSV file of survey results for this course.
cy: Cliciwch i gynhyrchu ffeil CSV o holl ganlyniadau arolwg y cwrs hwn.

source: Generate Survey Results Report
cy: Cynhyrchu adroddiad o ganlyniadau'r arolwg

source: To generate a CSV file that lists all student answers to a given problem, enter the location of the problem (from its Staff Debug Info).
cy: I gynhyrchu ffeil CSV sy'n rhestru holl atebion y myfyrwyr i broblem benodol, rhowch leoliad y broblem (o'r wybodaeth dadfygio staff).

source: Download a CSV of problem responses
cy: Lawrlwytho CSV o ymatebion i broblemau

source: Click to list certificates that are issued for this course:
cy: Cliciwch i restru tystysgrifau a roddwyd ar gyfer y cwrs hwn:

source: View Certificates Issued
cy: Gweld y tystysgrifau a roddwyd

source: Download CSV of Certificates Issued
cy: Lawrlwytho CSV o dystysgrifau a roddwyd

source: For smaller courses, click to list profile information for enrolled students directly on this page:
cy: Ar gyfer cyrsiau llai, cliciwch i restru gwybodaeth broffil ar gyfer myfyrwyr sydd wedi cofrestru'n uniongyrchol ar y dudalen hon:

source: List enrolled students' profile information
cy: Rhestrwch gwybodaeth broffil myfyrwyr sydd wedi cofrestru

source: Click to generate a CSV grade report for all currently enrolled students.
cy: Cliciwch i gynhyrchu CSV adroddiad graddau ar gyfer pob myfyriwr sydd wedi cofrestru.

source: Generate Grade Report
cy: Cynhyrchu adroddiad graddau

source: Generate Problem Grade Report
cy: Cynhyrchu adroddiad graddau problem

source: Generate ORA Data Report
cy: Cynhyrchu adroddiad data ORA

source: Reports Available for Download
cy: Adroddiadau sydd ar gael i'w lawrlwytho

source: The reports listed below are available for download. A link to every report remains available on this page, identified by the UTC date and time of generation. Reports are not deleted, so you will always be able to access previously generated reports from this page.
cy: Mae'r adroddiadau a restrir isod bellach ar gael i'w lawrlwytho. Bydd dolen i bob adroddiad yn parhau ar gael ar y dudalen hon, wedi'u nodi gyda dyddiad ac amser yn ôl y cyd-drefniant byd-eang (UTC) creu'r adroddiad. Ni chaiff adroddiadau eu dileu, felly byddwch yn gallu gweld adroddiadau a gynhyrchwyd eisoes o'r dudalen hon.

source: The answer distribution report listed below is generated periodically by an automated background process. The report is cumulative, so answers submitted after the process starts are included in a subsequent report. The report is generated several times per day.
cy: Mae'r adroddiad dosbarthu a restrir isod yn cael ei gynhyrchu o bryd i'w gilydd gan broses gefndirol awtomataidd. Mae'r adroddiad yn gronnol, felly mae atebion a gyflwynir ar ôl dechrau'r broses yn cael eu cynnwys mewn adroddiadau dilynol. Caiff yr adroddiad ei greu sawl gwaith y diwrnod.

source: {strong_start}Note{strong_end}: To keep student data secure, you cannot save or email these links for direct access. Copies of links expire within 5 minutes.
cy: {strong_start}Sylwer{strong_end}: I gadw data myfyrwyr yn ddiogel, ni allwch gadw nac e-bostio'r dolenni hyn ar gyfer mynediad uniongyrchol. Bydd copïau o'r dolenni yn darfod o fewn 5 munud.

source: Enrollment Codes
cy: Codau cofrestru

source: Create one or more pre-paid course enrollment codes. Students can use these codes to enroll in the course.
cy: Creu un neu fwy côd cofrestru cwrs rhagdaledig. Gall y myfyrwyr ddefnyddio'r codau hyn i gofrestru ar y cwrs.

source: Create Enrollment Codes
cy: Creu codau cofrestru

source: Cancel, restore, or mark an enrollment code as unused.
cy: Canslo, adfer, neu farcio côd cofrestru heb ei ddefnyddio.

source: Change Enrollment Code Status
cy: Newid statws côd cofrestru

source: Download a .csv file of all enrollment codes for this course.
cy: Lawrlwytho ffeil .csv o'r holl godau cofrestru ar gyfer y cwrs hwn.

source: Download All Enrollment Codes
cy: Lawrlwytho pob côd cofrestru

source: Download a .csv file of all unused enrollment codes for this course.
cy: Lawrlwytho ffeil .csv o'r holl godau cofrestru na ddefnyddiwyd ar gyfer y cwrs hwn.

source: Download Unused Enrollment Codes
cy: Lawrlwytho pob côd cofrestru na ddefnyddiwyd

source: Download a .csv file of all used enrollment codes for this course.
cy: Lawrlwytho ffeil .csv o'r holl godau cofrestru a ddefnyddiwyd ar gyfer y cwrs hwn.

source: Download Used Enrollment Codes
cy: Lawrlwytho pob côd cofrestru a ddefnyddiwyd

source: Course Price
cy: Pris y cwrs

source: Edit Price
cy: Golygu'r pris

source: Course Seat Purchases
cy: Sawl sedd brynwyd ar y cwrs

source: Download a .csv file for all credit card purchases or for all invoices, regardless of status.
cy: Lawrlwytho ffeil .csv ar gyfer pob archeb cerdyn credyd ar gyfer pob anfoneb, ni waeth beth yw'r statws.

source: Download All Invoices
cy: Lawrlwytho pob anfoneb

source: Download All Credit Card Purchases
cy: Lawrlwytho pob archeb cerdyn credyd

source: To cancel or resubmit an invoice, enter the invoice number below.
cy: I ganslo neu ailgyflwyno anfoneb, rhowch rif yr anfoneb isod.

source: Invoice Number
cy: Rhif yr anfoneb

source: Cancel Invoice
cy: Canslo'r anfoneb

source: Resubmit Invoice
cy: Ailgyflwyno anfoneb

source: Create a .csv file that contains enrollment information for your course.
cy: Creu ffeil .csv sy'n cynnwys gwybodaeth gofrestru am eich cwrs.

source: Create Enrollment Report
cy: Creu adroddiad cofrestru

source: Create an HTML file that contains an executive summary for this course.
cy: Creu ffeil HTML sy'n cynnwys crynodeb gweithredol ar gyfer y cwrs hwn.

source: Create Executive Summary
cy: Creu crynodeb gweithredol

source: Available Reports
cy: Adroddiadau sydd ar gael

source: The following reports are available for download. Reports are not deleted. A link to every report remains available on this page, identified by the date and time (in UTC) that the report was generated.
cy: Mae'r adroddiadau hyn ar gael i'w lawrlwytho. Ni chaiff adroddiadau eu dileu. Bydd dolen i bob adroddiad yn parhau ar gael ar y dudalen hon, wedi'u nodi gyda dyddiad ac amser (UTC) creu'r adroddiad.

source: {strong_start}Note{strong_end}: To help protect learner data, links to these reports that you save outside of this page or that you send or receive in email expire after five minutes.
cy: {strong_start}Sylwer{strong_end}: I helpu i amddiffyn data dysgwyr, bydd y dolenni i'r adroddiadau hyn y byddwch yn eu cadw y tu allan i'r dudalen hon neu rai a anfonwch neu a dderbyniwch ar e-bost yn darfod wedi pum munud.

source: Coupon Code List
cy: Rhestr codau cwponau

source: Download a .csv file of all coupon codes for this course.
cy: Lawrlwytho ffeil .csv o'r holl godau cwponau ar gyfer y cwrs hwn.

source: Download Coupon Codes
cy: Lawrlwytho codau cwponau

source: Coupon Codes
cy: Codau cwponau

source: Coupon (%)
cy: Cwpon (%)

source: Number Redeemed
cy: Y nifer a gyfnewidiwyd

source: The Invoice Number field cannot be empty.
cy: Ni chaiff maes rhif yr anfoneb fod yn wag.

source: No Expiration Date
cy: Dim dyddiad darfod

source: Enter the company name.
cy: Rhowch enw'r cwmni.

source: The company name cannot be a number.
cy: Ni all enw'r cwmni fod yn rhif.

source: Enter the company contact name.
cy: Rhowch enw cyswllt y cwmni.

source: The company contact name cannot be a number.
cy: Ni all enw cyswllt y cwmni fod yn rhif.

source: Enter the email address for the company contact.
cy: Rhowch gyfeiriad e-bost cyswllt y cwmni.

source: Enter a valid email address.
cy: Rhowch gyfeiriad e-bost dilys.

source: Enter the recipient name.
cy: Rhowch enw'r derbynnydd.

source: The recipient name cannot be a number.
cy: Ni all enw'r derbynnydd fod yn rhif.

source: Enter the recipient email address.
cy: Rhowch gyfeiriad e-bost y derbynnydd.

source: Enter the billing address.
cy: Rhowch y cyfeiriad bilio.

source: Enter the price per course seat.
cy: Rhowch y pris fesul sedd ar y cwrs.

source: Enter a numeric value for the price per course seat. Do not include currency symbols.
cy: Rhowch werth rhifiadol ar gyfer y pris fesul sedd ar y cwrs. Peidiwch â chynnwys symbolau arian.

source: Enter the number of enrollment codes.
cy: Rhowch nifer y codau cofrestru.

source: Enter a numeric value for the number of enrollment codes.
cy: Rhowch werth rhifiadol ar gyfer nifer y codau cofrestru.

source: Select a currency.
cy: Dewiswch arian.

source: Enter a coupon code.
cy: Rhowch gôd cwpon.

source: The discount percentage must be less than or equal to 100.
cy: Rhaid i garan y disgownt fod yn llai na neu gyfateb i 100.

source: Enter a numeric value for the discount amount. Do not include the percent sign.
cy: Rhowch werth rhifiadol ar gyfer swm y disgownt. Peidiwch â chynnwys yr arwydd canran.

source: Edit Coupon Code
cy: Golygu côd cwpon

source: Edit Coupon Code Information
cy: Golygu gwybodaeth côd cwpon

source: Code
cy: Côd

source: example: A123DS
cy: enghraifft: A123DS

source: Percentage Discount
cy: Canran y disgownt

source: Update Coupon Code
cy: Diweddaru côd y cwpon

source: Executive Summary for {display_name}
cy: Crynodeb gweithredol ar gyfer {display_name}

source: Report Creation Date
cy: Dyddiad creu'r adroddiad

source: Number of Seats
cy: Nifer y seddi

source: Number of Enrollments
cy: Nifer y cofrestriadau

source: Gross Revenue Collected
cy: Y refeniw gros a gasglwyd

source: Gross Revenue Pending
cy: Refeniw gros yn yr arfaeth

source: Number of Enrollment Refunds
cy: Nifer yr ad-daliadau cofrestru

source: Amount Refunded
cy: Y swm a ad-dalwyd

source: Average Price per Seat
cy: Pris cyfartalog pob sedd

source: Frequently Used Coupon Codes
cy: Codau cwpon a ddefnyddir yn aml

source: Number of seats purchased using coupon codes
cy: Nifer y seddi a brynwyd gan ddefnyddio codau cwpon

source: Rank
cy: Safle

source: Percent Discount
cy: Canran y disgownt

source: Times Used
cy: Sawl gwaith y'i ddefnyddiwyd

source: Bulk and Single Seat Purchases
cy: Y seddi a brynwyd yn unigol neu mewn swp

source: Number of seats purchased individually
cy: Nifer y seddi a brynwyd yn unigol

source: Number of seats purchased in bulk
cy: Nifer y seddi a brynwyd mewn swp

source: Number of seats purchased with invoices
cy: Nifer y seddi a brynwyd gydag anfonebau

source: Unused bulk purchase seats (revenue at risk)
cy: Seddi a brynwyd mewn swp na ddefnyddiwyd (perygl i'r refeniw)

source: Percentage of seats purchased individually
cy: Canran y seddi a brynwyd yn unigol

source: Percentage of seats purchased in bulk
cy: Canran y seddi a brynwyd mewn swmp

source: Percentage of seats purchased with invoices
cy: Canran y seddi a brynwyd gydag anfonebau

source: Individual due date extensions
cy: Estyniadau dyddiad cau unigol

source: In this section, you have the ability to grant extensions on specific units to individual students. Please note that the latest date is always taken; you cannot use this tool to make an assignment due earlier for a particular student.
cy: Yn yr adran hon, gallwch roi estyniadau i fyfyrwyr unigol ar gyfer unedau penodol. Sylwer y defnyddir y dyddiad hwyraf bob tro; ni allwch ddefnyddio'r offeryn hwn i wneud dyddiad aseiniad yn gynharach ar gyfer myfyriwr penodol.

source: Specify the {platform_name} email address or username of a student here:
cy: Rhowch gyfeiriad e-bost neu enw defnyddiwr {platform_name} myfyriwr yma:

source: Student Email or Username
cy: E-bost neu enw defnyddiwr y myfyriwr

source: Choose the graded unit:
cy: Dewiswch uned a gaiff ei graddio:

source: Specify the extension due date and time (in UTC; please specify {format_string}).
cy: Nodwch ddyddiad ac amser cau yr estyniad (yn UTC; nodwch {format_string}).

source: Change due date for student
cy: Newid dyddiad cau ar gyfer myfyriwr

source: Viewing granted extensions
cy: Gweld yr estyniadau a roddwyd

source: Here you can see what extensions have been granted on particular units or for a particular student.
cy: Yma gallwch weld pa estyniadau a roddwyd ar unedau penodol neu ar gyfer myfyriwr penodol.

source: Choose a graded unit and click the button to obtain a list of all students who have extensions for the given unit.
cy: Dewiswch uned a gaiff ei graddio a chlicio'r botwm i gael rhestr o'r holl fyfyrwyr sydd wedi derbyn estyniadau ar gyfer yr uned honno.

source: List all students with due date extensions
cy: Rhestrwch yr holl fyfyrwyr ag estyniadau dyddiad cau

source: Specify a student to see all of that student's extensions.
cy: Nodwch fyfyriwr i weld holl estyniadau'r myfyriwr hwnnw.

source: List date extensions for student
cy: Rhestrwch yr estyniadau dyddiad ar gyfer myfyriwr

source: Resetting extensions
cy: Ailosod estyniadau

source: Resetting a problem's due date rescinds a due date extension for a student on a particular unit. This will revert the due date for the student back to the problem's original due date.
cy: Mae ailosod dyddiad cau problem yn dadwneud unrhyw estyniad dyddiad cau ar gyfer myfyriwr ar yr uned honno. Bydd hyn yn newid y dyddiad cau ar gyfer y myfyriwr yn ôl i ddyddiad cau gwreiddiol y broblem.

source: Reset due date for student
cy: Ailosod dyddiad cau ar gyfer myfyriwr

source: Generate Registration Code Modal
cy: Cynhyrchu moddol côd cofrestru

source: * Required Information
cy: * Gwybodaeth ofynnol

source: Organization Name
cy: Enw'r sefydliad

source: The organization that purchased enrollments in the course
cy: Y sefydliadau a brynodd gofrestriadau yn y cwrs hwn

source: Organization Contact
cy: Cyswllt yn y sefydliad

source: Organization Contact Name
cy: Enw cyswllt yn y sefydliad

source: The primary contact at the organization
cy: Y prif gyswllt yn y sefydliad

source: Invoice Recipient
cy: Derbynnydd yr anfoneb

source: The contact who should receive the invoice
cy: Y cyswllt a ddylai dderbyn yr anfoneb

source: Organization Billing Address
cy: Cyfeiriad bilio'r sefydliad

source: Address Line 1
cy: Llinell Cyfeiriad 1

source: Address Line 2
cy: Llinell Cyfeiriad 2

source: Address Line 3
cy: Llinell Cyfeiriad 3

source: State/Province
cy: Talaith/Rhanbarth

source: Unit Price
cy: Pris yr uned

source: The price per enrollment purchased
cy: Y pris fesul cofrestriad a brynwyd

source: Number of Enrollment Codes
cy: Nifer y codau cofrestru

source: The total number of enrollment codes to create
cy: Cyfanswm nifer y codau cofrestru i'w creu

source: Course Team Internal Reference
cy: Cyfeirnod mewnol tîm y cwrs

source: Internal reference information for the sale
cy: Gwybodaeth gyfeiriol fewnol ar gyfer y gwerthiant

source: Customer Reference
cy: Cyfeirnod y cwsmer

source: Customer's purchase order or other reference information
cy: Archeb y cwsmer neu wybodaeth gyfeiriol arall

source: Send me a copy of the invoice
cy: Anfonwch gopi o'r anfoneb ataf

source: For analytics about your course, go to {link_start}{analytics_dashboard_name}{link_end}.
cy: Am ddadansoddeg ynghylch eich cwrs, ewch i {link_start}{analytics_dashboard_name}{link_end}.

source: Instructor Dashboard
cy: Dangosfwrdd hyfforddwr

source: View Course in Studio
cy: Gweld y cwrs yn Studio

source: Enrollment Code Status
cy: Statws côd cofrestru

source: Change the status of an enrollment code.
cy: Newid statws côd cofrestru.

source: Enrollment Code
cy: Côd cofrestru

source: Find Enrollment Code
cy: Canfod côd cofrestru

source: Enter the reason why the students are to be manually enrolled or unenrolled.
cy: Rhowch reswm dros gofrestru neu ddadgofrestru'r myfyrwyr eich hun.

source: This cannot be left blank and will be recorded and presented in Enrollment Reports.
cy: Ni ellir gadael hwn yn wag a bydd yn cael ei gofnodi a'i gyflwyno yn Adroddiadau Cofrestru.

source: Therefore, please give enough detail to account for this action.
cy: Felly, rhowch ddigon o fanylion i gyflawni'r weithred hon.

source: Reason
cy: Rheswm

source: If this option is <em>checked</em>, users who have not yet registered for {platform_name} will be automatically enrolled.
cy: Os yw'r dewis hwn wedi'i <em>nodi â thic</em>, bydd y defnyddwyr sydd hyd yma heb gofrestru ar gyfer {platform_name} yn cael eu cofrestru'n awtomataidd.

source: If this option is left <em>unchecked</em>, users who have not yet registered for {platform_name} will not be enrolled, but will be allowed to enroll once they make an account.
cy: Os bydd y dewis hwn yn cael ei adael <em>yn wag</em>, ni fydd y defnyddwyr sydd heb gofrestru eto ar gyfer {platform_name} yn cael eu cofrestru, ond byddan yn cael cofrestr wedi iddynt greu cyfrif.

source: If this option is <em>checked</em>, users will receive an email notification.
cy: Os yw'r dewis hwn wedi'i <em>nodi â thic</em>, bydd y defnyddwyr yn derbyn hysbysiad e-bost.

source: Register/Enroll Students
cy: Cofrestru/Cofrestru Myfyrwyr

source: To register and enroll a list of users in this course, choose a CSV file that contains the following columns in this exact order: email, username, name, and country. Please include one student per row and do not include any headers, footers, or blank lines.
cy: I gofrestru rhestr o ddysgwyr ar y cwrs hwn, dewiswch ffeil CSV sy'n cynnwys manylion y colofnau yn yr union drefn hon: e-bost, enw defnyddiwr, enw a gwlad. Rhowch un myfyriwr fesul rhes a pheidiwch â chynnwys unrhyw benawdau, troedynnau na llinellau gwag.

source: Upload a CSV for bulk enrollment
cy: Yn llwytho CSV ar gyfer cofrestru swmp i fyny

source: Upload CSV
cy: Llwytho CSV i fyny

source: Batch Beta Tester Addition
cy: Ychwanegu swp brosesu profwr beta

source: Note: Users must have an activated {platform_name} account before they can be enrolled as beta testers.
cy: Sylwer: Rhaid bod gan ddefnyddwyr gyfrif {platform_name} wedi'i ysgogi cyn gallu cofrestru fel profwyr beta.

source: If this option is <em>checked</em>, users who have not enrolled in your course will be automatically enrolled.
cy: Os yw'r dewis hwn wedi'i <em>nodi â thic</em>, bydd y defnyddwyr sydd hyd yma heb gofrestru ar eich cwrs yn cael eu cofrestru'n awtomataidd.

source: Checking this box has no effect if 'Remove beta testers' is selected.
cy: Wrth roi tic yn y blwch yma ni chaiff effaith os yw 'Dileu profwyr beta' wedi'r ddewis.

source: Add beta testers
cy: Ychwanegu profwyr beta

source: Remove beta testers
cy: Dileu profwyr beta

source: Course Team Management
cy: Rheolwyr tîm y cwrs

source: Select a course team role:
cy: Dewiswch rôl ar gyfer tîm y cwrs:

source: Getting available lists...
cy: Cael rhestrau sydd ar gael...
