Repository: zhulinhai/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: cy

source: Enter the URL of the external tool that this component launches. This setting is only used when Hide External Tool is set to False.<br />See {docs_anchor_open}the edX LTI documentation{anchor_close} for more details on this setting.
cy: Rhowch URL yr offeryn allanol mae'r gydran hon yn ei lansio. Defnyddir y gosodiad hwn pan fo Cuddio Offeryn Allanol wedi'i osod yn anwir.<br />Gweler {docs_anchor_open}dogfennaeth LTI edX{anchor_close} am fwy o fanylion am y gosodiad hwn.

source: Custom Parameters
cy: Paramedrau ar fesur

source: Add the key/value pair for any custom parameters, such as the page your e-book should open to or the background color for this component.<br />See {docs_anchor_open}the edX LTI documentation{anchor_close} for more details on this setting.
cy: Ychwanegwch yr allwedd/pâr gwerth ar gyfer unrhyw baramedrau ar fesur, megis y dudalen y dylai'ch e-lyfr agor iddi neu'r lliw cefndir ar gyfer y gydran hon.<br />Gweler {docs_anchor_open}dogfennaeth LTI edX{anchor_close} am fwy o fanylion am y gosodiad hwn.

source: Open in New Page
cy: Agor mewn tudalen newydd

source: Scored
cy: Sgoriwyd

source: Select True if this component will receive a numerical score from the external LTI system.
cy: Dewiswch Gwir os bydd y gydran hon yn derbyn sgôr rhifiadol o'r system LTI allanol.

source: Weight
cy: Pwysoliad

source: Enter the number of points possible for this component. The default value is 1.0. This setting is only used when Scored is set to True.
cy: Rhowch nifer y pwyntiau posib ar gyfer y gydran hon. Y gwerth diofyn yw 1.0. Defnyddir y gosodiad hwn yn unig pan osodir Sgoriwyd i Anwir.

source: The score kept in the xblock KVS -- duplicate of the published score in django DB
cy: Y sgôr a gedwir yn y xblock KVS -- copi dyblyg o'r sgôr a gyhoeddir yn django DB

source: Comment as returned from grader, LTI2.0 spec
cy: Rhowch sylw ei fod wedi'i ddychwelyd o'r graddiwr, LTI2.0 spec

source: Hide External Tool
cy: Cuddio Offeryn Allanol

source: Select True if you want to use this component as a placeholder for syncing with an external grading system rather than launch an external tool. This setting hides the Launch button and any IFrames for this component.
cy: Dewiswch Gwir os hoffech ddefnyddio'r gydran hon i gadw lle ar gyfer cysoni gyda system raddio allanol yn hytrach na lansio offeryn allanol. Mae'r gosodiad hwn yn cuddio'r botwm lansio ac unrhyw IFrames ar gyfer y gydran hon.

source: Request user's username
cy: Cais am enw defnyddiwr defnyddiwr

source: Select True to request the user's username.
cy: Dewiswch Gwir i holi am enw defnyddiwr y defnyddiwr.

source: Request user's email
cy: Cais am e-bost defnyddiwr

source: Select True to request the user's email address.
cy: Dewiswch Gwir i holi am gyfeiriad e-bost y defnyddiwr.

source: LTI Application Information
cy: Gwybodaeth Cymhwysiad LTI

source: Enter a description of the third party application. If requesting username and/or email, use this text box to inform users why their username and/or email will be forwarded to a third party application.
cy: Rhowch ddisgrifiad o'r cymhwysiad trydydd parti. Os yn gofyn am enw defnyddiwr a/neu e-bost, defnyddiwch y blwch testun hwn i hysbysu defnyddwyr pam y bydd eu henwau defnyddiwr a/neu e-bost yn cael eu rhoi i gymhwysiad trydydd parti.

source: Button Text
cy: Botwm testun

source: Enter the text on the button used to launch the third party application.
cy: Rhowch y testun ar y botwm a ddefnyddir i lansio'r cymhwysiad trydydd parti.

source: Accept grades past deadline
cy: Derbyn graddau wedi'r dyddiad terfyn

source: Select True to allow third party systems to post grades past the deadline.
cy: Dewiswch Gwir i ganiatáu i systemau trydydd parti bostio graddau wedi'r dyddiad cau.

source: Could not parse custom parameter: {custom_parameter}. Should be "x=y" string.
cy: Ni fedrwyd dosrannu'r paramedr ar fesur: {custom_parameter}. Dylai fod yn llinyn "x=y".

source: Could not parse LTI passport: {lti_passport}. Should be "id:key:secret" string.
cy: Ni fedrwyd dosrannu'r pasport LTI: {lti_passport}. Dylai fod yn llinyn "id:key:secret".

source: License
cy: Trwydded

source: A license defines how the contents of this block can be shared and reused.
cy: Mae trwydded yn diffinio sut mae cynnwys y bloc hwn yn gallu cael ei rannu a'i ddefnyddio.

source: Due Date
cy: I guddio cynnwys is-adran rhag dysgwyr ar ôl dyddiad dychwelyd is-adran, dewiswch yr eicon Ffurfweddu ar gyfer is-adran, yna dewis {em_start}Cuddio cynnwys wedi dyddiad dychwelyd{em_end}. Mae'r graddau ar gyfer is-adran yn parhau i gael eu cynnwys wrth gyfrifo graddau.

source: Enter the default date by which problems are due.
cy: Rhowch y fformat ar gyfer dyddiadau dychwelyd. Y fformat diofyn yw Mis DD, BBBB. Rhowch "%m-%d-%Y" ar gyfer MM-DD-BBBB, "%d-%m-%Y" ar gyfer DD-MM-BBBB, "%Y-%m-%d" ar gyfer BBBB-MM-DD, neu "%Y-%d-%m" ar gyfer BBBB-DD-MM.

source: If true, can be seen only by course staff, regardless of start date.
cy: Os gwir, staff y cwrs yn unig gaiff ei weld, ni waeth beth yw'r dyddiad dechrau.

source: GIT URL
cy: URL GIT

source: Enter the URL for the course data GIT repository.
cy: Rhowch yr URL ar gyfer cronfa data GIT y cwrs.

source: XQA Key
cy: Allwedd XQA

source: This setting is not currently supported.
cy: Ni chefnogir y gosodiad hwn ar hyn o bryd.

source: Enter the location of the annotation storage server. The textannotation, videoannotation, and imageannotation advanced modules require this setting.
cy: Rhowch leoliad y gweinydd storio anodiadau. Mae'r anodiad testun, yr anodiad fideo a'r anodiad delwedd y mae eu hangen ar fodiwlau uwch yn galw am y gosodiad hwn.

source: URL for Annotation Storage
cy: URL ar gyfer Storio Anodiadau

source: Enter the secret string for annotation storage. The textannotation, videoannotation, and imageannotation advanced modules require this string.
cy: Rhowch linyn cyfrinachol ar gyfer storio anodiadau. Mae'r anodiad testun, yr anodiad fideo a'r anodiad delwedd y mae eu hangen ar fodiwlau uwch yn galw am y llinyn hwn.

source: Enter the ids for the content groups this problem belongs to.
cy: Rhowch y rhifau adnabod ar gyfer y grŵp cynnwys mae'r broblem hon yn perthyn iddo.

source: Specify when the Show Answer button appears for each problem. Valid values are "always", "answered", "attempted", "closed", "finished", "past_due", "correct_or_past_due", and "never".
cy: Nodwch pryd ddylai'r botwm Dangos yr ateb ymddangos ar gyfer pob problem. Dyma werthoedd dilys: "Bob tro", "Atebwyd", "Ceisiwyd", "Wedi'i gau", "Wedi'i orffen", "wedi'r_disgwyl", "cywir_neu_wedi'r_disgwyl", a "byth".

source: Specify the default for how often variable values in a problem are randomized. This setting should be set to "never" unless you plan to provide a Python script to identify and randomize values in most of the problems in your course. Valid values are "always", "onreset", "never", and "per_student".
cy: Nodwch osodiad diofyn ar gyfer pa mor aml caiff gwerthoedd newidynnau eu hapdrefnu mewn problem. Ni ddylid gosod y gosodiad hwn i "byth" oni bai eich bod yn bwriadu darparu sgript Python i ddynodi a hapdrefnu gwerthoedd yn y mwyafrif o'r problemau yn eich cwrs. Dyma werthoedd dilys: "bob tro", "wrth ailosod", "byth" a "fesul myfyriwr".

source: Days Early for Beta Users
cy: Sawl diwrnod yn gynnar ar gyfer defnyddwyr beta.

source: Enter the number of days before the start date that beta users can access the course.
cy: Rhowch nifer y dyddiau cyn y dyddiad dechrau y caiff defnyddwyr beta gael mynediad i'r cwrs.

source: Static Asset Path
cy: Llwybr asedau statig

source: Enter the path to use for files on the Files & Uploads page. This value overrides the Studio default, c4x://.
cy: Rhowch y llwybr i'w ddefnyddio ar gyfer ffeiliau ar y dudalen Ffeiliau a llwytho i fyny. Mae'r gwerth hwn yn diystyru gwerth diofyn Studio, c4x://.

source: Enable LaTeX Compiler
cy: Galluogi LaTeX Compiler

source: Enter true or false. If true, you can use the LaTeX templates for HTML components and advanced Problem components.
cy: Rhowch gwir neu anwir. Os gwir, gallwch ddefnyddio patrymlun LaTeX ar gyfer cydrannau HTML a chydrannau problem uwch.

source: Enter the maximum number of times a student can try to answer problems. By default, Maximum Attempts is set to null, meaning that students have an unlimited number of attempts for problems. You can override this course-wide setting for individual problems. However, if the course-wide setting is a specific number, you cannot set the Maximum Attempts for individual problems to unlimited.
cy: Rhowch y mwyafswm o droeon gall myfyriwr geisio ateb problemau. Yn ddiofyn, y mwyafswm ceisiadau yw dim, sy'n golygu bod gan y myfyrwyr nifer di-ben-draw o geisiadau i ateb problemau. Gallwch ddiystyru'r gosodiad cwrs cyfan hwn ar gyfer problemau unigol. Fodd bynnag, os yw'r gosodiad cwrs cyfan ar gyfer nifer arbennig, ni chewch osod mwyafswm ceisiadau ar gyfer problemau unigol i ddi-ben-draw.

source: Enter the API key provided by MathWorks for accessing the MATLAB Hosted Service. This key is granted for exclusive use in this course for the specified duration. Do not share the API key with other courses. Notify MathWorks immediately if you believe the key is exposed or compromised. To obtain a key for your course, or to report an issue, please contact moocsupport@mathworks.com
cy: Rhowch yr allwedd API a ddarparwyd gan MathWorks ar gyfer gweld MATLAB Hosted Service. Rhoddir yr allwedd hwn i'w ddefnyddio'n unig ar y cwrs hwn am hyd penodol. Peidiwch â rhannu'r allwedd API gyda chyrsiau eraill. Rhowch wybod i MathWorks yn syth os credwch bod yr allwedd yn cael ei gamddefnyddio neu ei beryglu. I gael allwedd ar gyfer eich cwrs, neu i adrodd am broblem, cysylltwch â moocsupport@mathworks.com

source: Group Configurations
cy: Ffurfweddiadau Grŵp

source: Enter the configurations that govern how students are grouped together.
cy: Rhowch y ffurfweddiadau sy'n rheoli sut caiff myfyrwyr eu grwpio gyda'i gilydd.

source: Enable video caching system
cy: Galluogi system storio fideo

source: Enter true or false. If true, video caching will be used for HTML5 videos.
cy: Rhowch gwir neu anwir. Os gwir, defnyddir storio fideo ar gyfer fideos HTML5.

source: Video Pre-Roll
cy: Rhôl fideo cychwynnol

source: Show Reset Button for Problems
cy: Dangos y botwm ailosod ar gyfer problemau

source: Enter true or false. If true, problems in the course default to always displaying a 'Reset' button. You can override this in each problem's settings. All existing problems are affected when this course-wide setting is changed.
cy: Rhowch gwir neu anwir. Os gwir, bydd problemau'r cwrs yn arddangos botwm 'Ailosod' bob tro yn ddiofyn. Gallwch ddiystyru hyn yng ngosodiad pob problem. Effeithir ar bob problem sy'n bodoli wrth newid gosodiad cwrs cyfan.

source: Enable Student Notes
cy: Galluogi nodiadau myfyrwyr

source: Enter true or false. If true, students can use the Student Notes feature.
cy: Rhowch gwir neu anwir. Os gwir, gall y myfyrwyr ddefnyddio'r nodwedd nodiadau myfyrwyr.

source: Indicates whether Student Notes are visible in the course. Students can also show or hide their notes in the courseware.
cy: Mae'n dynodi a yw nodiadau myfyrwyr yn weledol yn y cwrs. Gall y myfyrwyr hefyd ddangos neu guddio eu nodiadau yn neunydd y cwrs.

source: Tag this module as part of an Entrance Exam section
cy: Tagiwch y modiwl hwn fel rhan o adran arholiad mynediad.

source: Enter true or false. If true, answer submissions for problem modules will be considered in the Entrance Exam scoring/gating algorithm.
cy: Rhowch gwir neu anwir. Os gwir, bydd atebion a gyflwynir ar gyfer modiwlau problem yn cael eu hystyried wrth sgorio/llidiartu algorithm yr arholiad mynediad.

source: Whether this student has voted on the poll
cy: A yw'r myfyriwr hwn wedi pleidleisio

source: Student answer
cy: Ateb y myfyriwr

source: Poll answers from all students
cy: Atebion pleidlais gan bob myfyriwr

source: Poll answers from xml
cy: Atebion pleidlais gan xml

source: Poll question
cy: Cwestiwn pleidleisio

source: Enter the date by which problems are due.
cy: Rhowch ddyddiad dychwelyd y problemau.

source: Hide sequence content After Due Date
cy: Cuddio cynnwys dilyniant wedi'r dyddiad dychwelyd

source: If set, the sequence content is hidden for non-staff users after the due date has passed.
cy: Os wedi'i osod, caiff y cynnwys dilyniant ei guddio ar gyfer defnyddwyr nad ydynt yn staff wedi'r dyddiad dychwelyd .

source: Is Entrance Exam
cy: Yr Arholiad mynediad

source: Tag this course module as an Entrance Exam. Note, you must enable Entrance Exams for this course setting to take effect.
cy: Tagiwch y modiwl cwrs hwn fel arholiad mynediad. Sylwer, rhaid i chi alluogi Arholiadau Mynediad er mwyn galluogi'r cwrs hwn.

source: Is Time Limited
cy: Yn amseredig

source: This setting indicates whether students have a limited time to view or interact with this courseware component.
cy: Mae'r gosodiad hwn yn nodi a oes cyfyngiad amser ar fyfyrwyr i weld neu ryngweithio â'r gydran hon o ddeunydd y cwrs.

source: Time Limit in Minutes
cy: Cyfyngiad amser mewn munudau

source: The number of minutes available to students for viewing or interacting with this courseware component.
cy: Nifer y munudau sydd ar gael i fyfyrwyr i weld neu ryngweithio â'r gydran hon o ddeunydd y cwrs.

source: Is Proctoring Enabled
cy: Procter wedi'i alluogi

source: This setting indicates whether this exam is a proctored exam.
cy: Mae'r gosodiad hwn yn dynodi a yw'r arholiad hwn yn arholiad procter.

source: Software Secure Review Rules
cy: Rheolau adolygu diogel y feddalwedd

source: This setting indicates what rules the proctoring team should follow when viewing the videos.
cy: Mae'r gosodiad hwn yn dynodi pa reolau dylai'r tîm procter eu dilyn wrth wylio'r fideos.

source: Is Practice Exam
cy: Arholiad ymarfer

source: This setting indicates whether this exam is for testing purposes only. Practice exams are not verified.
cy: Mae'r gosodiad hwn yn dynodi a yw'r arholiad hwn ar gyfer ymarfer yn unig. Ni chaiff arholiadau ymarfer eu gwirio.

source: This exam is hidden from the learner.
cy: Ni all y dysgwr weld yr arholiad hwn.

source: Because the course has ended, this assignment is hidden from the learner.
cy: Am fod y cwrs wedi dod i ben, mae'r aseiniad hwn wedi'i guddio rhag y dysgwyr.

source: Because the due date has passed, this assignment is hidden from the learner.
cy: Am fod y dyddiad derbyn wedi bod, mae'r aseiniad hwn wedi'i guddio rhag y dysgwyr.

source: This subsection is unlocked for learners when they meet the prerequisite requirements.
cy: Mae'r is-adran hon wedi'i datgloi i ddysgwyr wedi iddynt fodloni'r rhagofynion.

source: Group ID {group_id}
cy: Rhif adnabod y grŵp {group_id}

source: Not Selected
cy: Heb ddethol

source: The display name for this component. (Not shown to learners)
cy: Yr enw arddangos ar gyfer y gydran hon. (Ddim i'w weld i ddysgwyr)

source: Content Experiment
cy: Arbrawf cynnwys

source: The list of group configurations for partitioning students in content experiments.
cy: Y rhestr ffurfweddiadau grŵp ar gyfer dyrannu myfyrwyr i arbrofion cynnwys.

source: The configuration defines how users are grouped for this content experiment. Caution: Changing the group configuration of a student-visible experiment will impact the experiment data.
cy: Mae'r ffurfweddiad yn diffinio sut caiff defnyddwyr eu grwpio ar gyfer yr arbrawf cynnwys hwn. Rhybudd: Bydd newid ffurfweddiad grŵp arbrawf sy'n weladwy i fyfyrwyr yn cael effaith ar ddata'r arbrawf.

source: Group Configuration
cy: Ffurfweddiad y grŵp

source: Which child module students in a particular group_id should see
cy: Pa fodiwl plentyn mewn group_id penodol y dylai myfyrwyr ei weld

source: {group_name} (inactive)
cy: {group_name} (anactif)

source: The experiment is not associated with a group configuration.
cy: Nid yw'r arbrawf yn gysylltiedig â ffurfweddiad y grŵp.

source: Select a Group Configuration
cy: Dewiswch ffurfweddiad grŵp

source: The experiment uses a deleted group configuration. Select a valid group configuration or delete this experiment.
cy: Mae'r arbrawf yn defnyddio ffurfweddiad grŵp sydd wedi'i ddileu. Dewiswch gyfluniad grŵp dilys neu ddileu'r arbrawf hwn.

source: The experiment uses a group configuration that is not supported for experiments. Select a valid group configuration or delete this experiment.
cy: Mae'r arbrawf yn defnyddio ffurfweddiad grŵp na chaiff ei gefnogi ar gyfer arbrofion. Dewiswch gyfluniad grŵp dilys neu ddileu'r arbrawf hwn.

source: The experiment does not contain all of the groups in the configuration.
cy: Nid yw'r arbrawf yn cynnwys pob grŵp y ffurfweddiad.

source: Add Missing Groups
cy: Ychwanegu grwpiau coll

source: The experiment has an inactive group. Move content into active groups, then delete the inactive group.
cy: Mae gan yr arbrawf grŵp anactif. Symudwch y cynnwys i grwpiau actif, yna dileu'r grŵp anactif.

source: This content experiment has issues that affect content visibility.
cy: Mae gan yr arbrawf cynnwys hwn broblemau sy'n effeithio ar welededd y cynnwys.

source: External Discussion
cy: Trafodaeth allanol

source: Home
cy: Hafan

source: Text Annotation
cy: Anodiad testun

source: Source/Citation
cy: Ffynhonnell/cyfeiriad

source: Optional for citing source of any material used. Automatic citation can be done using <a href="http://easybib.com">EasyBib</a>
cy: Dewisol ar gyfer dyfynnu ffynhonnell unrhyw ddeunydd a ddefnyddiwyd. Gellir gwneud mynegai cyfeirio awtomatig gan ddefnyddio <a href="http://easybib.com">EasyBib</a>

source: Diacritic Marks
cy: Marciau diacritig

source: Add diacritic marks to be added to a text using the comma-separated form, i.e. markname;urltomark;baseline,markname2;urltomark2;baseline2
cy: Ychwanegu marciau diacritig i'w hychwanegu i'r testun gan ddefnyddio ffurf wedi'u gwahanu gan atalnod, h.y. markname;urltomark;baseline,markname2;urltomark2;baseline2

source: Can't receive transcripts from Youtube for {youtube_id}. Status code: {status_code}.
cy: Yn methu derbyn trawsgrifiadau o Youtube ar gyfer {youtube_id}. Côd statws: {status_code}.

source: We support only SubRip (*.srt) transcripts format.
cy: Rydym yn cefnogi fformat trawsgrifiadau SubRip (*.srt) yn unig.

source: Something wrong with SubRip transcripts file during parsing. Inner message is {error_message}
cy: Rhywbeth o'r le gyda ffeil trawsgrifiadau SubRip yn ystod dosrannu. Y neges fewnol yw {error_message}

source: Something wrong with SubRip transcripts file during parsing.
cy: Rhywbeth o'r le gyda ffeil trawsgrifiadau SubRip yn ystod dosrannu.

source: {exception_message}: Can't find uploaded transcripts: {user_filename}
cy: {exception_message}: Ni ellir dod o hyd i'r trawsgrifiadau a lwythwyd i fyny: {user_filename}

source: Invalid encoding type, transcripts should be UTF-8 encoded.
cy: Math amgodio annilys, dylai trawsgrifiadau gael amgodiad UTF-8.

source: Basic
cy: Sylfaenol

source: The URL for your video. This can be a YouTube URL or a link to an .mp4, .ogg, or .webm video file hosted elsewhere on the Internet.
cy: URL eich fideo. Gall hyn fod yn URL YouTube neu'n ddolen i .mp4, .ogg, neu fideo .webm sy'n cael ei letya rhywle arall ar y rhyngrwyd.

source: Default Video URL
cy: URL diofyn y fideo

source: Component Display Name
cy: Enw arddangos y gydran

source: Current position in the video.
cy: Man cyfredol yn y fideo.

source: Optional, for older browsers: the YouTube ID for the normal speed video.
cy: Dewisol ar gyfer porwyr hŷn: rhif adnabod YouTube ar gyfer y fideo cyflymder arferol.

source: YouTube ID
cy: Rhif adnabod YouTube

source: Optional, for older browsers: the YouTube ID for the .75x speed video.
cy: Dewisol ar gyfer porwyr hŷn: rhif adnabod YouTube ar gyfer y fideo cyflymder .75x.

source: YouTube ID for .75x speed
cy: Rhif adnabod YouTube ar gyfer cyflymder .75x

source: Optional, for older browsers: the YouTube ID for the 1.25x speed video.
cy: Dewisol ar gyfer porwyr hŷn: rhif adnabod YouTube ar gyfer y fideo cyflymder .1.25x.

source: YouTube ID for 1.25x speed
cy: Rhif adnabod YouTube ar gyfer cyflymder .1.25x

source: Optional, for older browsers: the YouTube ID for the 1.5x speed video.
cy: Dewisol ar gyfer porwyr hŷn: rhif adnabod YouTube ar gyfer y fideo cyflymder .1.5x.

source: YouTube ID for 1.5x speed
cy: Rhif adnabod YouTube ar gyfer cyflymder .1.5x

source: Time you want the video to start if you don't want the entire video to play. Not supported in the native mobile app: the full video file will play. Formatted as HH:MM:SS. The maximum value is 23:59:59.
cy: Amser dechrau'r fideo os nad ydych am chwarae'r fideo cyfan. Heb ei gefnogi yn yr app ffôn cynhenid: bydd y fideo llawn yn chwarae. Fformatiwyd AA:MM:EE. Y mwyafswm gwerth yw 23:59:59.

source: Video Start Time
cy: Amser dechrau'r fideo

source: Time you want the video to stop if you don't want the entire video to play. Not supported in the native mobile app: the full video file will play. Formatted as HH:MM:SS. The maximum value is 23:59:59.
cy: Amser stopio'r fideo os nad ydych am chwarae'r fideo cyfan. Heb ei gefnogi yn yr app ffôn cynhenid: bydd y fideo llawn yn chwarae. Fformatiwyd AA:MM:EE. Y mwyafswm gwerth yw 23:59:59.

source: Video Stop Time
cy: Amser stopio'r fideo

source: The external URL to download the video.
cy: Yr URL allanol i lawrlwytho'r fideo.

source: Download Video
cy: Lawrlwytho'r fideo

source: Allow students to download versions of this video in different formats if they cannot use the edX video player or do not have access to YouTube. You must add at least one non-YouTube URL in the Video File URLs field.
cy: Caniatáu i fyfyrwyr lawrlwytho fersiynau o'r fideo hwn mewn fformatau gwahanol os na allant ddefnyddio'r chwaraewr fideo edX neu os nad ydynt yn gallu defnyddio YouTube. Rhaid i chi ychwanegu o leiaf un URL nad yw'n YouTube ym maes URL y ffeil fideo.

source: Video Download Allowed
cy: Caniateir lawrlwytho'r fideo

source: The URL or URLs where you've posted non-YouTube versions of the video. Each URL must end in .mpeg, .mp4, .ogg, or .webm and cannot be a YouTube URL. (For browser compatibility, we strongly recommend .mp4 and .webm format.) Students will be able to view the first listed video that's compatible with the student's computer. To allow students to download these videos, set Video Download Allowed to True.
cy: URL neu URLs lle rydych wedi postio fersiynau heb fod yn YouTube o'r fideo. Rhaid i bob URL orffen gyda .mpeg, .mp4, .ogg, neu .webm ac yn methu bod yn URL YouTube. (Ar gyfer cydnawsedd, argymhellwn yn gryf fformat .mp4 a .webm) Bydd y myfyrwyr yn gallu gweld y fideo a restrir gyntaf sy'n gydnaws â chyfrifiadur y myfyriwr. I ganiatáu i fyfyrwyr lawrlwytho'r fideos hyn, gosodwch Caniatáu Lawrlwytho Fideo ar gywir.

source: Video File URLs
cy: URL y ffeil fideo
