Repository: zhulinhai/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: cy

source: Visit a course wiki to add an article.
cy: Ewch i wici cwrs i ychwanegu erthygl.

source: Course has not started
cy: Nid yw'r cwrs wedi dechrau

source: Course does not start until {}
cy: Nid yw'r cwrs yn dechrau tan {}

source: You have unfulfilled milestones
cy: Mae gennych gerrig milltir heb eu cyflawni

source: You do not have access to this course
cy: Nid oes gennych fynediad i'r cwrs hwn

source: You do not have access to this course on a mobile device
cy: Nid oes gennych fynediad i'r cwrs hwn ar eich ffôn

source: {relative} ago - {absolute}
cy: {relative} yn ôl - {absolute}

source: in {relative} - {absolute}
cy: yn {relative} - {absolute}

source: Course Starts
cy: Cwrs yn dechrau

source: Course End
cy: Diwedd y cwrs

source: To earn a certificate, you must complete all requirements before this date.
cy: I ennill tystysgrif, rhaid i chi gwblhau pob gofyniad cyn y dyddiad hwn.

source: After this date, course content will be archived.
cy: Wedi'r dyddiad hwn, bydd cynnwys y cwrs yn cael ei archifo.

source: This course is archived, which means you can review course content but it is no longer active.
cy: Mae'r cwrs hwn wedi'i archifo, sy'n golygu y gallwch adolygu cynnwys cwrs, ond nid yw bellach yn actif.

source: Verification Upgrade Deadline
cy: Dyddiad cau uwchraddio gwiriad

source: You are still eligible to upgrade to a Verified Certificate! Pursue it to highlight the knowledge and skills you gain in this course.
cy: Rydych yn gymwys i uwchraddio i dystysgrif wedi'i gwirio! Dilynwch i amlygu'r wybodaeth a'r sgiliau a enillwch drwy'r cwrs hwn.

source: Upgrade to Verified Certificate
cy: Uwchraddio i dystysgrif wedi'i gwirio

source: Learn More
cy: Dysgu mwy

source: Retry Verification
cy: Ailgeisio gwirio

source: Verify My Identity
cy: Gwirio fy hunaniaeth

source: Missed Verification Deadline
cy: Methwyd y dyddiad cau gwirio

source: Unfortunately you missed this course's deadline for a successful verification.
cy: Gwaetha'r modd fe fethoch ddyddiad cau y cwrs ar gyfer gwiriad llwyddiannus.

source: You must successfully complete verification before this date to qualify for a Verified Certificate.
cy: Rhaid i chi gwblhau gwiriad yn llwyddiannus cyn y dyddiad hwn er mwyn cymhwyso ar gyfer tystysgrif wedi'i gwirio.

source: There is no user with the username or email address {user_name} enrolled in this course.
cy: Nid oes defnyddiwr gyda'r enw defnyddiwr {user_name} neu'r cyfeiriad e-bost yna wedi cofrestru ar y cwrs hwn.

source: This type of component cannot be shown while viewing the course as a specific student.
cy: Ni ellir dangos y math hwn o gydran wrth edrych ar y cwrs fel myfyriwr penodol.

source: Syllabus
cy: Maes llafur

source: Progress
cy: Cynnydd

source: Textbooks
cy: Gwerslyfrau

source: Free
cy: Am ddim

source: Your enrollment: Audit track
cy: Eich cofrestriad: Lwybr awdit

source: You are enrolled in the audit track for this course. The audit track does not include a certificate.
cy: Rydych wedi'ch cofrestru ar y trac awdit ar gyfer y cwrs hwn. Nid yw'r llwybr awdit yn cynnwys tystysgrif.

source: Your certificate has been invalidated
cy: Mae eich tystysgrif wedi'i annilysu

source: Please contact your course team if you have any questions.
cy: Cysylltwch â thîm eich cwrs os oes gennych gwestiynau.

source: Your certificate is available
cy: Mae eich tystysgrif ar gael

source: You can keep working for a higher grade, or request your certificate now.
cy: Gallwch barhau i weithio am radd uwch, neu ofyn am eich tystysgrif nawr.

source: We're working on it...
cy: Rydym yn gweithio ar hyn...

source: We're creating your certificate. You can keep working in your courses and a link to it will appear here and on your Dashboard when it is ready.
cy: Rydym yn creu eich tystysgrif. Gallwch barhau i weithio yn eich cyrsiau a bydd dolen yn ymddangos yma ac ar eich dangosfwrdd pan fydd yn barod.

source: Certificate unavailable
cy: Nid yw'r dystysgrif ar gael

source: You have not received a certificate because you do not have a current {platform_name} verified identity.
cy: Nid ydych wedi derbyn tystysgrif am nad oes gennych hunaniaeth {platform_name} gyfredol wedi'i gwirio.

source: Congratulations, you qualified for a certificate!
cy: Llongyfarchiadau, rydych yn gymwys i dderbyn tystysgrif!

source: Invalid location.
cy: Lleoliad annilys.

source: User {username} has never accessed problem {location}
cy: Nid yw defnyddiwr {username} erioed wedi agor problem {location}

source: You must be signed in to {platform_name} to create a certificate.
cy: Rhaid eich bod wedi mewngofnodi i {platform_name} i greu tystysgrif.

source: Course is not valid
cy: Nid yw'r cwrs yn ddilys

source: Your certificate will be available when you pass the course.
cy: Bydd eich tystysgrif ar gael wedi i chi lwyddo yn y cwrs.

source: Certificate has already been created.
cy: Mae'r dystysgrif eisoes wedi cael ei chreu.

source: Certificate is being created.
cy: Mae'r dystysgrif yn cael ei chreu.

source: {platform_name} now offers financial assistance for learners who want to earn Verified Certificates but who may not be able to pay the Verified Certificate fee. Eligible learners may receive up to 90{percent_sign} off the Verified Certificate fee for a course. To apply for financial assistance, enroll in the audit track for a course that offers Verified Certificates, and then complete this application. Note that you must complete a separate application for each course you take. We plan to use this information to evaluate your application for financial assistance and to further develop our financial assistance program.
cy: Mae {platform_name} nawr yn cynnig cymorth ariannol i ddysgwyr sydd am ennill tystysgrifau wedi'u gwirio, ond sydd efallai yn methu talu'r ffi am dystysgrif wedi'i gwirio. Gall dysgwyr cymwys dderbyn hyd at 90{percent_sign} oddi ar ffi tystysgrif wedi'i gwirio ar gyfer cwrs. I wneud cais am gymorth ariannol, cofrestrwch yn y llwybr awdit ar gyfer cwrs sy'n cynnig tystysgrif wedi'i gwirio, ac yna cwblhau'r cais hwn. Sylwer bod rhaid i chi gwblhau cais ar wahân ar gyfer pob cwrs a gymerwch. Bwriadwn ddefnyddio'r wybodaeth hon i werthuso eich cais am gymorth ariannol ac i ddatblygu ymhellach ein rhaglen gymorth ariannol.

source: Annual Household Income
cy: Incwm blynyddol aelwyd

source: Tell us about your current financial situation. Why do you need assistance?
cy: Dywedwch wrthym am eich sefyllfa ariannol gyfredol. Pam bo angen cymorth arnoch?

source: Tell us about your learning or professional goals. How will a Verified Certificate in this course help you achieve these goals?
cy: Dywedwch wrthym am eich goliau dysgu neu broffesiynol. Sut bydd tystysgrif wedi'i gwirio yn eich helpu i gyflawni'r nodau hyn?

source: Tell us about your plans for this course. What steps will you take to help you complete the course work and receive a certificate?
cy: Dywedwch wrthym am eich cynlluniau ar gyfer y cwrs hwn. Pa gamau fyddwch chi'n eu cymryd i gwblhau'r gwaith cwrs a derbyn tystysgrif?

source: Use between 250 and 500 words or so in your response.
cy: Defnyddiwch rhwng 250 a 500 gair wrth ymateb.

source: Select the course for which you want to earn a verified certificate. If the course does not appear in the list, make sure that you have enrolled in the audit track for the course.
cy: Dewiswch gwrs yr ydych am ennill tystysgrif wedi'i gwirio ar ei gyfer. Os nad yw'r cwrs i'w weld ar y rhestr, sicrhewch eich bod wedi cofrestru ar y llwybr awdit ar gyfer y cwrs.

source: Specify your annual household income in US Dollars.
cy: Nodwch incwm blynyddol eich cartref mewn Doleri UDA.

source: I allow edX to use the information provided in this application (except for financial information) for edX marketing purposes.
cy: Rwy'n caniatáu i edX ddefnyddio'r wybodaeth a ddarparwyd yn y cais hwn (heblaw am wybodaeth ariannol) at ddibenion marchnata edX.

source: Path {0} doesn't exist, please create it, or configure a different path with GIT_REPO_DIR
cy: Nid yw llwybr {0} yn bodoli, crëwch un neu ffurfweddu llwybr gwahanol gyda GIT_REPO_DIR

source: Non usable git url provided. Expecting something like: git@github.com:mitocw/edx4edx_lite.git
cy: Darparwyd url git na ellir ei ddefnyddio. Yn disgwyl rhywbeth tebyg i: git@github.com:mitocw/edx4edx_lite.git

source: Unable to get git log
cy: Yn methu cael git log

source: git clone or pull failed!
cy: clôn git neu dynnu wedi methu!

source: Unable to run import command.
cy: Yn methu rhedeg gorchymyn mewnforio.

source: The underlying module store does not support import.
cy: Nid yw siop y modiwl waelod yn cefnogi mewnforio.

source: The specified remote branch is not available.
cy: Nid yw'r gangen bell a nodwyd ar gael.

source: Unable to switch to specified branch. Please check your branch name.
cy: Yn methu newid i gangen benodol. Gwiriwch enw eich cangen.

source: Import the specified git repository and optional branch into the modulestore and optionally specified directory.
cy: Mewnforiwch y gronfa git a nodwyd a'r gangen ddewisol yn siop y modiwlau a'r cyfeirlyfr a nodir yn ddewisol.

source: Failed in authenticating {username}, error {error}
cy: Methwyd dilysu {username}, gwall {error}

source: Failed in authenticating {username}
cy: Methwyd dilysu {username}

source: fixed password
cy: cywirwyd y cyfrinair

source: All ok!
cy: Popeth yn iawn!

source: Must provide username
cy: Rhaid rhoi enw defnyddiwr

source: Must provide full name
cy: Rhaid rhoi enw llawn

source: Email address must end in {domain}
cy: Rhaid i'r cyfeiriad e-bost orffen gyda {domain}

source: Failed - email {email_addr} already exists as {external_id}
cy: Wedi methu - e-bost {email_addr} eisoes yn bodoli fel {external_id}

source: Password must be supplied if not using certificates
cy: Rhaid rhoi cyfrinair os nad ydych yn defnyddio tystysgrifau

source: email address required (not username)
cy: Mae angen cyfeiriad e-bost (nid enw defnyddiwr)

source: Oops, failed to create user {user}, {error}
cy: Wps, creu defnyddiwr {user}, {error}wedi methu

source: User {user} created successfully!
cy: Cafodd defnyddiwr {user} ei greu yn llwyddiannus!

source: Cannot find user with email address {email_addr}
cy: Yn methu dod o hyd i ddefnyddiwr gyda'r cyfeiriad e-bost {email_addr}

source: Cannot find user with username {username} - {error}
cy: Yn methu dod o hyd i ddefnyddiwr gyda'r enw defnyddiwr {username} - {error}

source: Deleted user {username}
cy: Defnyddiwr wedi'i ddileu {username}

source: Statistic
cy: Ystadegyn

source: Value
cy: Gwerth

source: Site statistics
cy: Ystadegau'r safle

source: Total number of users
cy: Cyfanswm nifer y defnyddwyr

source: Courses loaded in the modulestore
cy: Cyrsiau wedi'u llwytho yn y storfa fodiwlau

source: username
cy: enw defnyddiwr

source: email
cy: e-bost

source: Repair Results
cy: Canlyniadau atgyweirio

source: Create User Results
cy: Creu canlyniadau defnyddiwr

source: Delete User Results
cy: Dileu canlyniadau defnyddiwr

source: The git repo location should end with '.git', and be a valid url
cy: Dylai lleoliad y gronfa git orffen gyda '.git', a bod yn url dilys

source: Added Course
cy: Ychwanegwyd y cwrs

source: Course Name
cy: Enw'r cwrs

source: Directory/ID
cy: Cyfeirlyfr/rhif adnabod

source: Last Change
cy: Newid diwethaf

source: Last Editor
cy: Golygydd diwethaf

source: Information about all courses
cy: Gwybodaeth am yr holl gyrsiau

source: Error - cannot get course with ID {0}<br/><pre>{1}</pre>
cy: Gwall - ni ellir cael cwrs gyda rhif adnabod {0}<br/><pre>{1}</pre>

source: Deleted
cy: Wedi'i ddileu

source: # enrolled
cy: # cofrestrwyd

source: instructors
cy: hyfforddwyr

source: Enrollment information for all courses
cy: Gwybodaeth gofrestru ar gyfer pob cwrs

source: role
cy: rôl

source: Title can't be empty
cy: Ni chaiff y teitl fod yn wag

source: Body can't be empty
cy: Ni cheir gadael rhan yn wag

source: Topic doesn't exist
cy: Nid yw'r pwnc yn bodoli

source: Comment level too deep
cy: Lefel y sylw yn rhy ddwfn

source: Error uploading file. Please contact the site administrator. Thank you.
cy: Gwall wrth lwytho ffeil i fyny. Cysylltwch â gweinyddydd y safle. Diolch.

source: Good
cy: DA

source: EdxNotes Service is unavailable. Please try again in a few minutes.
cy: Nid yw gwasanaeth EdxNotes ar gael. Rhowch gynnig arall arni mewn ychydig funudau.

source: Invalid JSON response received from notes api.
cy: Derbyniwyd ymateb JSON annilys gan notes api.

source: Incorrect data received from notes api.
cy: Derbyniwyd data anghywir gan notes api.

source: No endpoint was provided for EdxNotes.
cy: Ni ddarparwyd diweddglo ar gyfer EDxNotes.

source: Notes
cy: Nodiadau

source: Sailthru connection retry interval (secs).
cy: Cyfwng ailgeisio cysylltedd Sailthru (eiliadau).

source: Sailthru maximum retries.
cy: Mwyafswm ailgeisiadau Sailthru.

source: Sailthru template to use on abandoned cart reminder. Deprecated.
cy: Patrymlun Sailthru i'w ddefnyddio wrth atgoffa am droli siopa segur. Anghymeradwy.

source: Sailthru minutes to wait before sending abandoned cart message. Deprecated.
cy: Munudau Sailthru i'w haros cyn anfon neges troli siopa segur. Anghymeradwy.

source: Use the Sailthru content API to fetch course tags.
cy: Defnyddiwch cynnwys API Sailthru i nôl tagiau cwrs.

source: Number of seconds to cache course content retrieved from Sailthru.
cy: Nifer yr eiliadau i storio dros dro cynnwys y cwrs a adferwyd gan Sailthru.

source: Cost in cents to report to Sailthru for enrolls.
cy: Y gost mewn sentiau i adrodd i Sailthru am gofrestriadau.

source: Optional lms url scheme + host used to construct urls for content library, e.g. https://courses.edx.org.
cy: Defnyddiwyd cynllun lms url dewisol + host i greu urls ar gyfer llyfrgell gynnwys, e.e. https://courses.edx.org.

source: Number of seconds to delay the sending of User Welcome email after user has been activated
cy: Nifer yr eiliadau i oedi anfon e-bost Croeso i ddefnyddiwr wedi i ddefnyddiwr gael ei ysgogi

source: {platform_name} Staff
cy: Staff {platform_name}

source: Course Staff
cy: Staff y cwrs

source: Used Registration Code
cy: Côd cofrestru a ddefnyddiwyd

source: Credit Card - Individual
cy: Cerdyn credyd - unigolyn

source: Manually Enrolled
cy: Wedi cofrestru eich hun

source: Data Integrity Error
cy: Gwall cywirdeb data

source: TBD
cy: I'w benderfynu

source: Proctored Exam Review: {review_status}
cy: Adolygiad o arholiad proctor: {review_status}

source: A proctored exam attempt for {exam_name} in {course_name} by username: {student_username} was reviewed as {review_status} by the proctored exam review provider.
cy: Ymgais arholiad proctor ar gyfer {exam_name} yn {course_name} gan enw defnyddiwr: Adolygwyd {student_username} fel {review_status} gan y darparwr adolygu arholiad proctor.

source: User does not exist.
cy: Nid yw'r defnyddiwr yn bodoli.

source: Task is already running.
cy: Mae'r dasg eisoes yn rhedeg.

source: Make sure that the file you upload is in CSV format with no extraneous characters or rows.
cy: Sicrhewch bod y ffeil rydych yn ei lwytho i fyny ar fformat csv heb gymeriadau na rhesi dieithr.

source: Could not read uploaded file.
cy: Ni fedrwyd darllen y ffeil a lwythwyd i fyny.

source: Data in row #{row_num} must have exactly four columns: email, username, full name, and country
cy: Rhaid i'r data mewn rhes #{row_num} gael pedair colofn yn union: e-bost, enw defnyddiwr, enw llawn, a gwlad

source: Invalid email {email_address}.
cy: E-bost annilys {email_address}.

source: An account with email {email} exists but the provided username {username} is different. Enrolling anyway with {email}.
cy: Mae cyfrif gydag e-bost {email} yn bodoli, ond mae'r enw defnyddiwr {username} a ddarparwyd yn wahanol. Yn cofrestru beth bynnag gyda {email}.

source: File is not attached.
cy: Nid yw'r ffeil ynghlwm.

source: Username {user} already exists.
cy: Maer enw defnyddiwr {user} eisoes yn bodoli.

source: Error '{error}' while sending email to new user (user email={email}). Without the email student would not be able to login. Please contact support for further information.
cy: Gwall '{error}' wrth anfon e-bost ar ddefnyddiwr newydd (user email={email}). Heb e-bost ni fyddai'r myfyriwr yn gallu mewngofnodi. Cysylltwch â chefnogaeth am fwy o wybodaeth.

source: Could not find problem with this location.
cy: Ni ddaethpwyd o hyd i broblem gyda'r lleoliad hwn.

source: The problem responses report is being created. To view the status of the report, see Pending Tasks below.
cy: Mae adroddiad ymatebion y broblem yn cael ei greu. I weld statws yr adroddiad, gweler tasgau yn yr arfaeth

source: A problem responses report generation task is already in progress. Check the 'Pending Tasks' table for the status of the task. When completed, the report will be available for download in the table below.
cy: Mae tasg creu adroddiad o ymatebion y broblem eisoes ar waith. Gwirio'r tabl 'Tasgau yn yr arfaeth' ar gyfer statws y dasg. Wedi iddo gael ei gwblhau bydd yr adroddiad ar gael i'w lawrlwytho yn y tabl isod.

source: Invoice number '{num}' does not exist.
cy: Nid yw'r rhif anfoneb '{num}' yn bodoli.

source: The sale associated with this invoice has already been invalidated.
cy: Mae'r gwerthiant cysylltiedig â'r anfoneb hon eisoes wedi cael ei annilysu.

source: Invoice number {0} has been invalidated.
cy: Mae'r rhif anfoneb {0} wedi cael ei annilysu.

source: This invoice is already active.
cy: Mae'r anfoneb hon eisoes yn weithredol.

source: The registration codes for invoice {0} have been re-activated.
cy: Mae'r codau cofrestru ar gyfer anfoneb {0} wedi cael eu hailysgogi.

source: CourseID
cy: Rhif adnabod y cwrs

source: Certificate Type
cy: Y math o dystysgrif

source: Total Certificates Issued
cy: Cyfanswm y tystysgrifau a roddwyd

source: Date Report Run
cy: Dyddiad rhedeg yr adroddiad

source: User ID
cy: Rhif adnabod defnyddiwr

source: Email
cy: E-bost

source: Language
cy: Iaith

source: Location
cy: Lleoliad

source: Birth Year
cy: Blwyddyn eni

source: Gender
cy: Rhyw

source: Level of Education
cy: Lefel addysg

source: Mailing Address
cy: Cyfeiriad post

source: Goals
cy: Nodau

source: Enrollment Mode
cy: Modd cofrestru

source: Verification Status
cy: Statws gwirio

source: Team
cy: Tîm

source: City
cy: Dinas

source: Country
cy: Gwlad

source: The enrolled learner profile report is being created. To view the status of the report, see Pending Tasks below.
cy: Mae adroddiad proffil dysgwyr cofrestredig yn cael ei greu. I weld statws yr adroddiad, gweler tasgau yn yr arfaeth

source: This enrollment report is currently being created. To view the status of the report, see Pending Tasks below. You will be able to download the report when it is complete.
cy: Mae adroddiad cofrestru hwn yn cael ei greu ar hyn o bryd. I weld statws yr adroddiad, gweler tasgau yn yr arfaeth. Gallwch lawrlwytho'r adroddiad pan fydd wedi'i gwblhau.

source: The enrollment report is being created. This report contains information about learners who can enroll in the course. To view the status of the report, see Pending Tasks below.
cy: Mae'r adroddiad cofrestru yn cael ei greu. Mae'r adroddiad hwn yn cynnwys gwybodaeth am ddysgwyr sy'n gallu cofrestru ar y cwrs. I weld statws yr adroddiad, gweler tasgau yn yr arfaeth

source: The file must contain a 'cohort' column containing cohort names.
cy: Rhaid i'r ffeil gynnwys colofn 'cohort' sy'n cynnwys enwau cohort.

source: The file must contain a 'username' column, an 'email' column, or both.
cy: Rhaid i'r ffeil gynnwys colofn 'enw defnyddiwr', colofn 'e-bost' neu'r ddwy.

source: Coupon Code
cy: Côd cwpon

source: Course Id
cy: Rhif adnabod y cwrs

source: % Discount
cy: % y disgownt

source: Description
cy: Disgrifiad

source: Expiration Date
cy: Dyddiad darfod

source: Is Active
cy: Yn weithredol

source: Code Redeemed Count
cy: Nifer y codau a ddefnyddiwyd

source: Total Discounted Seats
cy: Cyfanswm y seddi â disgownt

source: Total Discounted Amount
cy: Cyfanswm y disgownt

source: The detailed enrollment report is being created. To view the status of the report, see Pending Tasks below.
cy: Mae adroddiad cofrestru manwl yn cael ei greu. I weld statws yr adroddiad, gweler tasgau yn yr arfaeth

source: The detailed enrollment report is being created. To view the status of the report, see Pending Tasks below. You will be able to download the report when it is complete.
cy: Mae adroddiad cofrestru manwl yn cael ei greu. I weld statws yr adroddiad, gweler tasgau yn yr arfaeth. Gallwch lawrlwytho'r adroddiad pan fydd wedi'i gwblhau.

source: The executive summary report is being created. To view the status of the report, see Pending Tasks below.
cy: Mae adroddiad y crynodeb gweithredol yn cael ei greu. I weld statws yr adroddiad, gweler tasgau yn yr arfaeth

source: The executive summary report is currently being created. To view the status of the report, see Pending Tasks below. You will be able to download the report when it is complete.
cy: Mae adroddiad y crynodeb gweithredol yn cael ei greu ar hyn o bryd. I weld statws yr adroddiad, gweler tasgau yn yr arfaeth. Gallwch lawrlwytho'r adroddiad pan fydd wedi'i gwblhau.

source: The survey report is being created. To view the status of the report, see Pending Tasks below.
cy: Mae adroddiad yr arolwg yn cael ei greu. I weld statws yr adroddiad, gweler tasgau yn yr arfaeth

source: The survey report is currently being created. To view the status of the report, see Pending Tasks below. You will be able to download the report when it is complete.
cy: Mae adroddiad yr arolwg yn cael ei greu ar hyn o bryd. I weld statws yr adroddiad, gweler tasgau yn yr arfaeth. Gallwch lawrlwytho'r adroddiad pan fydd wedi'i gwblhau.

source: The proctored exam results report is being created. To view the status of the report, see Pending Tasks below.
cy: Mae adroddiad canlyniadau'r arholiad proctor yn cael ei greu. I weld statws yr adroddiad, gweler tasgau yn yr arfaeth

source: The proctored exam results report is currently being created. To view the status of the report, see Pending Tasks below. You will be able to download the report when it is complete.
cy: Mae adroddiad canlyniadau'r arholiad proctor yn cael ei greu ar hyn o bryd. I weld statws yr adroddiad, gweler tasgau yn yr arfaeth. Gallwch lawrlwytho'r adroddiad pan fydd wedi'i gwblhau.

source: Could not parse amount as a decimal
cy: Ni fedrwyd dosrannu swm yn ddegol

source: Unable to generate redeem codes because of course misconfiguration.
cy: Yn methu cynhyrchu codau cyfnewid oherwydd camffurfweddiad.

source: pdf download unavailable right now, please contact support.
cy: Nid yw lawrlwythiadau pdf ar gael ar hyn o bryd, cysylltwch â chefnogaeth.

source: Module does not exist.
cy: Nid yw'r modiwl yn bodoli.

source: An error occurred while deleting the score.
cy: Cafwyd gwall wrth ddileu'r sgôr.

source: Course has no entrance exam section.
cy: Nid oes adran arholiad mynediad gan y cwrs.

source: all_students and unique_student_identifier are mutually exclusive.
cy: all_students a unique_student_identifier yn gwbl ar wahân o'i gilydd.

source: all_students and delete_module are mutually exclusive.
cy: mae all_students a delete_module yn gwbl ar wahân o'i gilydd.

source: Requires instructor access.
cy: Mae angen mynediad hyfforddwr.

source: Course has no valid entrance exam section.
cy: Nid oes adran arholiad mynediad dilys gan y cwrs.

source: All Students
cy: Pob myfyriwr

source: Cannot rescore with all_students and unique_student_identifier.
cy: Ni ellir ail-sgorio gyda all_students ac unique_student_identifier.

source: The ORA data report is being generated.
cy: Mae adroddiad data ORA yn cael ei greu.
