Repository: zhulinhai/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: cy

source: The file name extension for this file does not match the file data. The file may be corrupted.
cy: Nid yw'r estyniad enw ffeil ar gyfer y ffeil yma yn cyd-fynd â data'r ffeil. Mae'n bosib bod y ffeil wedi'i llygru.

source: bytes
cy: beitiau

source: No file provided for profile image
cy: Ni ddarparwyd ffeil ar gyfer delwedd proffil

source: Path used to construct URLs to programs marketing pages (e.g., "/foo").
cy: Y llwybr a ddefnyddiwyd i adeiladu URL i dudalennau marchnata rhaglenni (e.e., "/foo").

source: Enable course home page improvements.
cy: Galluogi gwelliannau i hafan y cwrs.

source: The '{field_name}' field cannot be edited.
cy: Ni ellir golygu'r maes '{field_name}'.

source: Delete failed for user preference '{preference_key}'.
cy: Dileu'r hyn a fethodd ar gyfer dewis defnyddiwr '{preference_key}'.

source: Preference '{preference_key}' cannot be set to an empty value.
cy: Ni ellir gosod dewis '{preference_key}' yn werth gwag.

source: Invalid user preference key '{preference_key}'.
cy: Allwedd dewis defnyddiwr annilys '{preference_key}'.

source: Value '{preference_value}' is not valid for user preference '{preference_key}'.
cy: Nid yw'r gwerth '{preference_value}' yn ddilys ar gyfer dewis defnyddiwr '{preference_key}'.

source: Value '{preference_value}' not valid for preference '{preference_key}': Not in timezone set.
cy: Nid yw'r gwerth '{preference_value}' yn ddilys ar gyfer dewis '{preference_key}': Nid yw yn y gylchfa amser a osodwyd.

source: Value '{preference_value}' is not a valid time zone selection.
cy: Nid yw'r gwerth '{preference_value}' yn ddewis cylchfa amser dilys.

source: Save failed for user preference '{key}' with value '{value}'.
cy: Methwyd cadw dewis y defnyddiwr '{key}' gyda gwerth '{value}'.

source: No data provided for user preference update
cy: Ni ddarparwyd data ar gyfer diweddaru dewis defnyddwyr

source: The email address you used to register with {platform_name}
cy: Y cyfeiriad e-bost a ddefnyddioch i gofrestru gyda {platform_name}

source: Password
cy: Cyfrinair

source: Remember me
cy: Cofiwch fi

source: It looks like {email_address} belongs to an existing account. Try again with a different email address.
cy: Mae'n ymddangos bod yr {email_address} yn perthyn i gyfrif sydd eisoes yn bodoli. Rhowch gynnig arall arni gyda chyfeiriad e-bost gwahanol.

source: It looks like {username} belongs to an existing account. Try again with a different username.
cy: Mae'n ymddangos bod {username} yn perthyn i gyfrif sydd eisoes yn bodoli. Rhowch gynnig arall arni gydag enw defnyddiwr gwahanol.

source: Full name
cy: Enw llawn

source: Your legal name, used for any certificates you earn.
cy: Eich enw cyfreithiol, i'w ddefnyddio ar gyfer unrhyw dystysgrifau a enillwch.

source: Public username
cy: Enw defnyddiwr cyhoeddus

source: The name that will identify you in your courses - {bold_start}(cannot be changed later){bold_end}
cy: Yr enw a fydd yn nodi pwy ydych chi yn eich cyrsiau - {bold_start}(ni ellir ei newid yn ddiweddarach){bold_end}

source: Highest level of education completed
cy: Lefel uchaf yr addysg a gwblhawyd

source: Year of birth
cy: Blwyddyn geni

source: Mailing address
cy: Cyfeiriad post

source: Tell us why you're interested in {platform_name}
cy: Dywedwch wrthym pam fod gennych ddiddordeb yn {platform_name}

source: Select the highest level of education you have completed.
cy: Dewiswch y lefel uchaf o addysg yr ydych wedi'i gwblhau.

source: State/Province/Region
cy: Talaith/Rhanbarth

source: Company
cy: Cwmni

source: Please select your Country.
cy: Dewiswch eich gwlad.

source: Review the Honor Code
cy: Adolygu'r côd anrhydedd

source: Review the Honour Code
cy: Adolygu'r côd anrhydedd

source: Terms of Service and Honor Code
cy: Telerau Gwasanaeth a Chôd Anrhydedd

source: Terms of Service and Honour Code
cy: Telerau Gwasanaeth a Chôd Anrhydedd

source: Review the Terms of Service and Honor Code
cy: Adolygu Telerau Gwasanaeth a Chôd Anrhydedd

source: Review the Terms of Service and Honour Code
cy: Adolygu Telerau Gwasanaeth a Chôd Anrhydedd

source: I agree to the {platform_name} {terms_of_service}
cy: Rwy'n cytuno i {platform_name} {terms_of_service}

source: You must agree to the {platform_name} {terms_of_service}
cy: Rhaid i chi gytuno i {platform_name} {terms_of_service}

source: Review the Terms of Service
cy: Adolygu'r telerau gwasanaeth

source: The course key for the course we would like to be auto-cohorted.
cy: Yr allwedd cwrs ar gyfer y cwrs yr hoffem i greu cohort yn awtomatig.

source: This value is invalid.
cy: Mae'r gwerth yn annilys.

source: This field is not editable
cy: Ni ellir golygu'r maes hwn

source: %(min_score)s is not a valid grade percentage
cy: Nid yw %(min_score)s yn ganran gradd ddilys

source: Gating milestone for {usage_key}
cy: Carreg filltir llidiartu ar gyfer {usage_key}

source: Category
cy: Categori

source: Week 1
cy: Wythnos 1

source: A category name for the discussion. This name appears in the left pane of the discussion forum for the course.
cy: Enw categori ar gyfer y drafodaeth. Bydd yr enw hwn yn ymddangos ar ochr chwith y fforwm drafodaeth ar gyfer y cwrs.

source: Subcategory
cy: Is-gategori

source: A subcategory name for the discussion. This name appears in the left pane of the discussion forum for the course.
cy: Enw is-gategori ar gyfer y drafodaeth. Bydd yr enw hwn yn ymddangos ar ochr chwith y fforwm drafodaeth ar gyfer y cwrs.

source: Content Groups
cy: Grwpiau cynnwys

source: invalid JSON
cy: JSON annilys

source: must have name of the configuration
cy: rhaid bod gennych enw'r ffurfweddiad

source: must have at least one group
cy: rhaid bod gennych o leiaf un grŵp

source: Invalid course update id.
cy: Rhif adnabod diweddariad y cwrs annilys.

source: Course update not found.
cy: Ni ddaethpwyd o hyd i ddiweddariad y cwrs.

source: Could not index item: {}
cy: Ni llwyddwyd i fynegeio eitem: {}

source: General indexing error occurred
cy: Cafwyd gwall mynegeio cyffredinol

source: (Unnamed)
cy: (Dienw)

source: GIT_REPO_EXPORT_DIR not set or path {0} doesn't exist, please create it, or configure a different path with GIT_REPO_EXPORT_DIR
cy: GIT_REPO_EXPORT_DIR heb ei osod neu nid yw'r llwybr {0} yn bodoli, crëwch un neu ffurfweddu llwybr gwahanol gyda GIT_REPO_EXPORT_DIR

source: Non writable git url provided. Expecting something like: git@github.com:mitocw/edx4edx_lite.git
cy: Darparwyd url git na ellir ei ysgrifennu. Yn disgwyl rhywbeth tebyg i: git@github.com:mitocw/edx4edx_lite.git

source: If using http urls, you must provide the username and password in the url. Similar to https://user:pass@github.com/user/course.
cy: Os ydych yn defnyddio url http, rhaid i chi ddarparu enw defnyddiwr a chyfrinair yn yr url. Tebyg i https://user:pass@github.com/user/course.

source: Unable to determine branch, repo in detached HEAD mode
cy: Yn methu pennu cangen, cronfa mewn modd HEAD ar wahân (detached)

source: Unable to update or clone git repository.
cy: Yn methu diweddaru neu glonio cronfa git.

source: Unable to export course to xml.
cy: Yn methu allforio'r cwrs i xml.

source: Unable to configure git username and password
cy: Yn methu ffurfweddu enw defnyddiwr a chyfrinair git

source: Unable to commit changes. This is usually because there are no changes to be committed
cy: Yn methu cyflawni'r newidiadau. Mae hyn fel arfer am nad oes newidiadau i'w gwneud

source: Unable to push changes. This is usually because the remote repository cannot be contacted
cy: Yn methu gwthio'r newidiadau. Mae hyn fel arfer am na ellir cysylltu â'r gronfa bell

source: Bad course location provided
cy: Darparwyr lleoliad cwrs gwael

source: Missing branch on fresh clone
cy: Cangen ar goll ar glôn ffres

source: Take the specified course and attempt to export it to a git repository . Course directory must already be a git repository. Usage: git_export <course_loc> <git_url>
cy: Cymryd y cwrs a nodwyd a cheisio ei allforio i gronfa git . Rhaid bod cyfeiriadur y cwrs yn gronfa git eisoes Defnydd: git_export <course_loc> <git_url>

source: We only support uploading a .tar.gz file.
cy: Rydym yn cefnogi ffeil .tar.gz yn unig.

source: Could not find the {0} file in the package.
cy: Ni fedrwyd dod o hyd i'r ffeil {0} yn y pecyn.

source: File {filename} exceeds maximum size of {size_mb} MB. Please follow the instructions here to upload a file elsewhere and link to it instead: {faq_url}
cy: Mae ffeil {filename} yn fwy na'r mwyafswm maint {size_mb} MB. Dilynwch y cyfarwyddiadau yma i lwytho ffeil i fyny i rywle arall a rhoi dolen iddi yn lle: {faq_url}

source: Upload completed
cy: Llwytho i fyny wedi'i gwblhau

source: must have name of the certificate
cy: rhaid cael enw'r dystysgrif

source: PermissionDenied: Failed in authenticating {user}
cy: Gwrthodir caniatâd: Methwyd dilysu {user}

source: {platform_name} Support Levels:
cy: Lefelau cefnogi {platform_name}:

source: Video
cy: Fideo

source: Blank
cy: Gwag

source: Course has been successfully reindexed.
cy: Cafodd y cwrs ei ailfynegeio'n llwyddiannus.

source: Unscheduled
cy: Annisgwyl

source: Special characters not allowed in organization, course number, and course run.
cy: Ni cheir rhoi nodau/cymeriadau arbennig ar gyfer y sefydliad, rhif y cwrs a rhediad y cwrs.

source: There is already a course defined with the same organization and course number. Please change either organization or course number to be unique.
cy: Mae cwrs eisoes wedi cael ei ddiffinio gyda'r un sefydliad a rhif cwrs. Newidiwch rif naill ai'r sefydliad neu'r cwrs i un unigryw.

source: Please change either the organization or course number so that it is unique.
cy: Newidiwch rif naill ai'r sefydliad neu'r cwrs i un unigryw

source: Unable to create course '{name}'. {err}
cy: Yn methu creu cwrs '{name}'. {err}

source: You must link this course to an organization in order to continue. Organization you selected does not exist in the system, you will need to add it to the system
cy: Rhaid i chi gysylltu'r cwrs hwn â sefydliad er mwyn parhau. Nid yw'r sefydliad rydych wedi'i ddewis yn bodoli yn y system, bydd angen i chi ei ychwanegu i'r system

source: Invalid prerequisite course key
cy: Allwedd cwrs hanfodol annilys

source: An error occurred while trying to save your tabs
cy: Cafwyd gwall wrth geisio cadw eich tabiau

source: Tabs Exception
cy: Eithriadau Tabiau

source: This group configuration is in use and cannot be deleted.
cy: Mae ffurfweddiad y grŵp hwn yn cael ei ddefnyddio ac ni ellir ei ddileu.

source: This content group is in use and cannot be deleted.
cy: Mae'r grŵp cynnwys hwn yn cael ei ddefnyddio ac ni ellir ei ddileu.

source: Entrance Exam - Subsection
cy: Arholiad mynediad - Is-adran

source: Completed Course Entrance Exam
cy: Arholiad mynediad y cwrs wedi'i gwblhau

source: Course successfully exported to git repository
cy: Allforiwyd y cwrs yn llwyddiannus i'r gronfa git

source: Vertical
cy: Fertigol

source: Empty
cy: Gwag

source: File upload corrupted. Please try again
cy: Llwytho ffeil wedi'i llygru i fyny. Rhowch gynnig arall arni

source: Invalid data
cy: Data annilys

source: Invalid data ({details})
cy: Data annilys ({details})

source: Duplicate of {0}
cy: Copi dyblyg o {0}

source: Duplicate of '{0}'
cy: Copi dyblyg o '{0}'

source: Students must score {score}{pct_sign} or higher to access course materials.
cy: Rhaid i'r myfyrwyr sgorio {score}{pct_sign} neu'n uwch i weld deunydd cwrs.

source: Unable to create library - missing required field '{field}'
cy: Yn methu creu llyfrgell - maes '{field}' gofynnol yn wag

source: Unable to create library '{name}'. {err}
cy: Yn methu creu llyfrgell '{name}'. {err}

source: There is already a library defined with the same organization and library code. Please change your library code so that it is unique within your organization.
cy: Mae llyfrgell eisoes wedi cael ei ddiffinio gyda'r un sefydliad a rhif llyfrgell. Newidiwch gôd eich llyfrgell fel ei fod yn unigryw o fewn eich sefydliad.

source: Incoming video data is empty.
cy: Mae'r data fideo sy'n dod i mewn yn wag.

source: Can't find item by locator.
cy: Yn methu canfod eitem yn ôl ei leolwr.

source: Transcripts are supported only for "video" modules.
cy: Cefnogir trawsgrifiadau ar gyfer modiwlau "fideo" yn unig.

source: Insufficient permissions
cy: Nid oes digon o ganiatadau

source: Could not find user by email address '{email}'.
cy: Ni fedrwyd dod o hyd i'r defnyddiwr yn ôl cyfeiriad e-bost '{email}'.

source: No `role` specified.
cy: Ni nodwyd 'rôl'.

source: User {email} has registered but has not yet activated his/her account.
cy: Mae'r defnyddiwr {email} wedi cofrestru ond nid yw eto wedi ysgogi ei gyfrif.

source: Invalid `role` specified.
cy: Nodwyd 'rôl' annilys.

source: You may not remove the last Admin. Add another Admin first.
cy: Ni chewch ddileu'r gweinyddwr olaf. Ychwanegu gweinyddwr arall gyntaf.

source: Uploading
cy: Yn llwytho i fyny

source: In Progress
cy: Ar waith

source: Ready
cy: Barod

source: Uploaded
cy: Wedi llwytho i fyny

source: Failed
cy: Wedi methu

source: Cancelled
cy: Wedi'i ganslo

source: Failed Duplicate
cy: Methwyd dyblygu

source: YouTube Duplicate
cy: Copi dyblyg YouTube

source: Invalid Token
cy: Tocyn annilys

source: Imported
cy: Mewnforiwyd

source: Unknown
cy: Anhysbys

source: Duration
cy: Hyd

source: Date Added
cy: Dyddiad ychwanegwyd

source: unrequested
cy: heb holi amdano

source: pending
cy: yn yr arfaeth

source: granted
cy: rhoddwyd

source: denied
cy: gwrthodwyd

source: Studio user
cy: Defnyddiwr Studio

source: The date when state was last updated
cy: Dyddiad diweddaru'r cyflwr ddiwethaf

source: Current course creator state
cy: Cyflwr lluniwr y cwrs cyfredol

source: Optional notes about this user (for example, why course creation access was denied)
cy: Nodiadau dewisol am y defnyddiwr hwn (er enghraifft, pam gwrthodwyd mynediad i greu cwrs)

source: Force Publish Course
cy: Gorfodi cyhoeddi'r cwrs

source: Sometimes the draft and published branches of a course can get out of sync. Force publish course command resets the published branch of a course to point to the draft branch, effectively force publishing the course. This view dry runs the force publish command
cy: Weithiau gall canghennau drafft a chyhoeddedig cwrs fod yn anghyson. Mae gorchmynion gorfodi cyhoeddi'r cwrs yn ailosod cangen gyhoeddedig y cwrs hyd at y gangen ddrafft, hynny ydi gorfodi cyhoeddi'r cwrs. Mae hyn yn ymarfer ar gyfer y gorchymyn gorfodi cyhoeddi

source: Please provide course id.
cy: Rhowch rif adnabod y cwrs.

source: Invalid course key.
cy: Allwedd cwrs annilys.

source: No matching course found.
cy: Ni ddaethpwyd o hyd i gwrs sy'n cyfateb

source: Force publishing course is not supported with old mongo courses.
cy: Ni chaiff cwrs gorfodi cyhoeddi ei gefnogi gan hen gyrsiau mongo.

source: Course is already in published state.
cy: Mae'r cwrs eisoes mewn cyflwr i'w gyhoeddi.

source: Incorrect format for field '{name}'. {detailed_message}
cy: Fformat anghywir ar gyfer maes '{name}'. {detailed_message}

source: Dictionary with the available tags
cy: Geiriadur gyda'r tagiau sydd ar gael

source: Page Not Found
cy: Heb ganfod y dudalen

source: Page not found
cy: Heb ganfod y dudalen

source: Content
cy: Cynnwys

source: Loading
cy: Yn llwytho

source: Settings
cy: Gosodiadau

source: Course Number
cy: Rhif y cwrs

source: Course Start Date:
cy: Dyddiad dechrau'r cwrs:

source: Error:
cy: Gwall:

source: Organization:
cy: Sefydliad:

source: Course Number:
cy: Rhif y cwrs:

source: Courses
cy: Cyrsiau

source: Sign In
cy: Mewngofnodi

source: Sign In to {studio_name}
cy: Mewngofnodi i {studio_name}

source: Don't have a {studio_name} Account? Sign up!
cy: Heb gyfrif {studio_name}? Cofrestru!

source: Required Information to Sign In to {studio_name}
cy: Gwybodaeth ofynnol i fewngofnodi i {studio_name}

source: E-mail
cy: E-bost

source: example: username@domain.com
cy: enghraifft: username@domain.com

source: Forgot password?
cy: Wedi anghofio eich cyfrinair?

source: example: Jane Doe
cy: enghraifft: Jane Doe

source: Public Username
cy: Enw defnyddiwr cyhoeddus

source: example: JaneDoe
cy: enghraifft: JaneDoe

source: Course End Date
cy: Dyddiad gorffen y cwrs

source: Requirements
cy: Gofynion

source: Details
cy: Manylion

source: View
cy: Gwylio

source: Preview Language Setting
cy: Rhagweld y gosodiad iaith

source: Reset
cy: Ailosod

source: Thanks for activating your account.
cy: Diolch am gynnau'r cyfrif.

source: This account has already been activated.
cy: Mae'r cyfrif hwn eisoes wedi cael ei ysgogi.

source: Visit your {link_start}dashboard{link_end} to see your courses.
cy: Ewch i'ch {link_start}dangosfwrdd{link_end} i weld eich cwrs.

source: You can now {link_start}sign in{link_end}.
cy: Gallwch nawr {link_start}fewngofnodi{link_end}.

source: Choose Language
cy: Dewis iaith

source: Account
cy: Cyfrif

source: Looking for help with {studio_name}?
cy: Chwilio am help gyda {studio_name}?

source: Hide {studio_name} Help
cy: Cuddio help {studio_name}

source: {studio_name} Documentation
cy: Dogfennaeth {studio_name}

source: Access documentation on http://docs.edx.org
cy: Hygyrchu dogfennaeth ar http://docs.edx.org

source: edX Documentation
cy: Dogfennaeth edX

source: Enroll in edX101: Overview of Creating an edX Course
cy: Cofrestru ar gyfer edX101: Trosolwg o greu cwrs edX

source: Enroll in edX101
cy: Cofrestru ar gyfer edX101

source: Enroll in StudioX: Creating a Course with edX Studio
cy: Cofrestru ar gyfer StudioX: Creu cwrs gyda edX Studio

source: Enroll in StudioX
cy: Cofrestru ar gyfer StudioX

source: Send an email to {email}
cy: Anfon e-bost at {email}

source: Contact Us
cy: Cysylltu â ni

source: Usermenu
cy: Dewislen y defnyddiwr

source: Usermenu dropdown
cy: Cwymplen dewislen y defnyddiwr

source: Sign Out
cy: Allgofnodi

source: Code Editor
cy: Golygydd y côd

source: All Rights Reserved
cy: Cedwir pob hawl

source: Attribution
cy: Priodoliad

source: Noncommercial
cy: Anfasnachol

source: No Derivatives
cy: Dim deilliad

source: Share Alike
cy: Rhannu tebyg

source: Creative Commons licensed content, with terms as follow:
cy: Cynnwys trwyddedig Creative Commons, gyda thelerau fel a ganlyn:

source: Some Rights Reserved
cy: Cedwir peth hawliau

source: Feedback Form
cy: Ffurflen adborth

source: Email: {email}
cy: E-bost: {email}

source: Full Name: {realname}
cy: Enw llawn: {realname}

source: Inquiry Type: {inquiry_type}
cy: Math o ymholiad: {inquiry_type}

source: Message: {message}
cy: Neges: {message}

source: Tags: {tags}
cy: Tagiau: {tagiau}

source: Additional Info:
cy: Gwybodaeth ychwanegol:

source: Feedback from user
cy: Adborth gan ddefnyddiwr

source: Discussions
cy: Trafodaethau

source: Add a Post
cy: Ychwanegu postiad

source: Discussion thread list
cy: Rhestr edefynnau trafodaethau

source: New topic form
cy: Ffurflen pwnc newydd

source: Discussion - {course_number}
cy: Trafodaeth - {course_number}

source: Discussion unavailable
cy: Nid yw'r drafodaeth ar gael

source: The discussions are currently undergoing maintenance. We'll have them back up shortly!
cy: Mae'r trafodaethau'n cael eu cynnal a'u cadw ar hyn o bryd. Byddan i'w gweld eto cyn hir!

source: Collapse Instructions
cy: Cwympo'r cyfarwyddiadau

source: Guided Discussion
cy: Trafodaeth o dan arweiniad

source: Hide Annotations
cy: Cuddio'r anodiadau

source: Bookmarked
cy: Wedi rhoi nod tudalen

source: Bookmark this page
cy: Rhoi nod tudalen yma

source: You do not have access to this dependency module.
cy: Nid oes gennych fynediad i'r modiwl dibynnol hwn.

source: LEARN MORE
cy: DYSGU MWY

source: Starts
cy: Dechrau

source: Starts: {date}
cy: Dechrau: {date}

source: View all Courses
cy: Gweld yr holl gyrsiau

source: Dashboard
cy: Dangosfwrdd

source: You are not enrolled in any courses yet.
cy: Nid ydych wedi cofrestru ar unrhyw gwrs eto.

source: Explore courses
cy: Archwilio cyrsiau

source: Course-loading errors
cy: Gwallau llwytho cwrs

source: Search Your Courses
cy: Chwilio am eich cyrsiau

source: Clear search
cy: Clirio'r chwiliad

source: Account Status Info
cy: Gwybodaeth am statws y cyfrif

source: Order History
cy: Cofnod archebu

source: Email Settings for {course_number}
cy: Gosodiadau e-bost ar gyfer {course_number}

source: Receive course emails
cy: Derbyn negeseuon e-bost am y cwrs

source: Save Settings
cy: Cadw gosodiadau

source: Unenroll
cy: Dadgofrestru

source: View Unit in Studio
cy: Gweld yr uned yn Studio

source: E-mail change failed
cy: Methwyd newid e-bost

source: We were unable to send a confirmation email to {email}
cy: Nid oeddem yn gallu anfon neges e-bost yn cadarnhau at {email}

source: Go back to the {link_start}home page{link_end}.
cy: Ewch yn ôl i'r {link_start}hafan{link_end}.

source: E-mail change successful!
cy: Newidiwyd yr e-bost yn llwyddiannus!

source: You should see your new email in your {link_start}dashboard{link_end}.
cy: Dylech weld eich e-bost newydd yn eich {link_start}dangosfwrdd{link_end}.

source: An account with the new e-mail address already exists.
cy: Mae cyfrif gyda'r e-bost newydd eisoes yn bodoli.

source: You should Register before trying to access the Unit
cy: Dylech gofrestru cyn ceisio agor yr uned

source: Enroll
cy: Cofrestru

source: Don't enroll
cy: Peidiwch cofrestru

source: Student Enrollment Form
cy: Ffurflen gofrestru myfyrwyr

source: Add new students
cy: Ychwanegu myfyrwyr newydd

source: Existing students:
cy: Myfyrwyr presennol:

source: External Authentication failed
cy: Dilysu allanol wedi methu

source: Legal
cy: Cyfreithiol

source: Password Reset
cy: Ailosod y cyfrinair

source: Please enter your e-mail address below, and we will e-mail instructions for setting a new password.
cy: Rhowch eich cyfeiriad e-bost isod, a byddwn yn anfon cyfarwyddiadau atoch ynghylch gosod cyfrinair newydd.

source: Required Information
cy: Gwybodaeth ofynnol

source: Your E-mail Address
cy: Eich cyfeiriad e-bost

source: This is the e-mail address you used to register with {platform}
cy: Dyma'r cyfeiriad e-bost a ddefnyddioch i gofrestru gyda {platform}

source: Reset My Password
cy: Ailosod fy nghyfrinair

source: Email is incorrect.
cy: Mae'r e-bost yn anghywir.

source: Support
cy: Cefnogaeth

source: {platform_name} Support
cy: Cefnogaeth {platform_name}

source: For {strong_start}questions on course lectures, homework, tools, or materials for this course{strong_end}, post in the {link_start}course discussion forum{link_end}.
cy: Ar gyfer {strong_start}cwestiynau am ddarlithoedd cwrs, gwaith cartref, offer, neu ddeunyddiau ar gyfer y cwrs hwn{strong_end}, postiwch yn {link_start}fforwm trafodaeth y cwrs{link_end}.

source: Have {strong_start}general questions about {platform_name}{strong_end}? You can find lots of helpful information in the {platform_name} {link_start}FAQ{link_end}.
cy: Gennych {strong_start}gwestiynau cyffredin am {platform_name}{strong_end}? Gallwch ddod o hyd i lawer o wybodaeth ddefnyddiol yn adran {link_start}Cwestiynau cyffredin{link_end} {platform_name}.

source: Have a {strong_start}question about something specific{strong_end}? You can contact the {platform_name} general support team directly:
cy: Gennych {strong_start}gwestiwn am rywbeth penodol{strong_end}? Gallwch gysylltu â thîm cefnogi cyffredinol {platform_name} yn uniongyrchol:

source: Report a problem
cy: Adrodd am broblem

source: Make a suggestion
cy: Argymell

source: Ask a question
cy: Holi cwestiwn

source: Please note: The {platform_name} support team is English speaking. While we will do our best to address your inquiry in any language, our responses will be in English.
cy: Sylwer: Mae tîm cefnogi {platform_name} yn siarad Saesneg. Er y gwnawn ein gorau i ateb eich ymholiad mewn unrhyw iaith, bydd ein hymatebion yn Saesneg.
