Repository: zhulinhai/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: cy

source: Enter the names of the advanced modules to use in your course.
cy: Rhowch enwau'r modiwlau uwch i'w defnyddio yn eich y cwrs.

source: Enter the heading that you want students to see above your course handouts on the Course Home page. Your course handouts appear in the right panel of the page.
cy: Rhowch y pennawd rydych am i fyfyrwyr ei weld uwchben eich taflenni cwrs ar y dudalen hafan. Bydd eich taflenni cwrs yn ymddangos ar banel dde y dudalen.

source: Course Handouts
cy: Taflenni'r cwrs

source: Course Home Sidebar
cy: Enw bar ochr hafan y cwrs

source: Course Home Sidebar Name
cy: Enw bar ochr hafan y cwrs

source: Course Tools
cy: Rolau tîm y cwrs

source: True if timezones should be shown on dates in the course. Deprecated in favor of due_date_display_format.
cy: Gwir os dylid dangos cylchfa amser ar ddyddiadau yn y cwrs. Wedi'i anghymeradwyo er due_date_display_format.

source: Due Date Display Format
cy: Fformat arddangos dyddiad dychwelyd

source: Enter the format for due dates. The default is Mon DD, YYYY. Enter "%m-%d-%Y" for MM-DD-YYYY, "%d-%m-%Y" for DD-MM-YYYY, "%Y-%m-%d" for YYYY-MM-DD, or "%Y-%d-%m" for YYYY-DD-MM.
cy: Rhowch y fformat ar gyfer dyddiadau disgwyl. Y fformat diofyn yw Mis DD, BBBB. Rhowch "%m-%d-%Y" ar gyfer MM-DD-BBBB, "%d-%m-%Y" ar gyfer DD-MM-BBBB, "%Y-%m-%d" ar gyfer BBBB-MM-DD, neu "%Y-%d-%m" ar gyfer BBBB-DD-MM.

source: External Login Domain
cy: Parth mewngofnodi allanol

source: Enter the external login method students can use for the course.
cy: Rhowch ddull mewngofnodi allanol y gall myfyrwyr ei ddefnyddio ar gyfer y cwrs.

source: Certificates Downloadable Before End
cy: Tystysgrifau i'w llwytho i lawr cyn diwedd

source: Enter true or false. If true, students can download certificates before the course ends, if they've met certificate requirements.
cy: Rhowch gwir neu anwir. Os gwir, gall myfyrwyr lawrlwytho tystysgrifau cyn diwedd y cwrs, os ydynt wedi bodloni gofynion y dystysgrif.

source: Certificates Display Behavior
cy: Ymddygiad arddangos tystysgrifau

source: Enter end, early_with_info, or early_no_info. After certificate generation, students who passed see a link to their certificates on the dashboard and students who did not pass see information about the grading configuration. The default is end, which displays this certificate information to all students after the course end date. To display this certificate information to all students as soon as certificates are generated, enter early_with_info. To display only the links to passing students as soon as certificates are generated, enter early_no_info.
cy: Rhowch ddiwedd, early_with_info, neu early_no_info. Ar ôl creu tystysgrif, mae'r myfyrwyr sy'n llwyddo yn gweld dolen i'w tystysgrif ar y dangosfwrdd ac ni fydd myfyrwyr aflwyddiannus yn gweld gwybodaeth am y ffurfweddiad graddio. Y diwedd diofyn, sy'n arddangos yr wybodaeth dystysgrif hon i'r holl fyfyrwyr wedi dyddiad gorffen y cwrs hwn. I arddangos yr wybodaeth dystysgrif hon i'r holl fyfyrwyr cyn gynted ag y caiff tystysgrifau eu cynhyrchu, rhowch early_with_info. I arddangos y dolenni yn unig i fyfyrwyr sy'n pasio cyn gynted ag y caiff tystysgrifau eu cynhyrchu, rhowch early_no_info.

source: Course About Page Image
cy: Delwedd tudalen am y cwrs

source: Edit the name of the course image file. You must upload this file on the Files & Uploads page. You can also set the course image on the Settings & Details page.
cy: Golygwch enw ffeil delwedd y cwrs. Rhaid i chi lwytho'r ffeil hon i fyny ar y dudalen Ffeiliau a llwytho i fyny. Gallwch hefyd osod delwedd y cwrs ar dudalen Gosodiadau a Manylion.

source: Course Banner Image
cy: Delwedd baner y cwrs

source: Edit the name of the banner image file. You can set the banner image on the Settings & Details page.
cy: Golygwch enw ffeil delwedd y faner. Gallwch hefyd osod delwedd y faner ar dudalen Gosodiadau a Manylion.

source: Course Video Thumbnail Image
cy: Llwytho cryno ddelwedd fideo'r cwrs i fyny

source: Edit the name of the video thumbnail image file. You can set the video thumbnail image on the Settings & Details page.
cy: Golygwch enw ffeil cryno ddelwedd y fideo. Gallwch osod cryno ddelwedd y fideo ar dudalen Gosodiadau a Manylion.

source: Issue Open Badges
cy: Rhoi bathodynnau agored

source: Issue Open Badges badges for this course. Badges are generated when certificates are created.
cy: Rhoi bathodynnau Bathodynnau Agored ar gyfer y cwrs hwn. Caiff bathodynnau eu cynhyrchu pan gaiff y tystysgrifau eu creu.

source: Use this setting only when generating PDF certificates. Between quotation marks, enter the short name of the type of certificate that students receive when they complete the course. For instance, "Certificate".
cy: Defnyddiwch y gosodiad hwn wrth greu tystysgrifau PDF yn unig. Rhwng y dyfynodau, rhowch enw byr y math o dystysgrif y bydd y myfyrwyr yn ei dderbyn wrth gwblhau'r cwrs. Er enghraifft, "Tystysgrif".

source: Certificate Name (Short)
cy: Enw'r dystysgrif (Byr)

source: Use this setting only when generating PDF certificates. Between quotation marks, enter the long name of the type of certificate that students receive when they complete the course. For instance, "Certificate of Achievement".
cy: Defnyddiwch y gosodiad hwn wrth greu tystysgrifau PDF yn unig. Rhwng y dyfynodau, rhowch enw hir y math o dystysgrif y bydd y myfyrwyr yn ei dderbyn wrth gwblhau'r cwrs. Er enghraifft, "Tystysgrif cyflawniad".

source: Certificate Name (Long)
cy: Enw'r dystysgrif (Hir)

source: Certificate Web/HTML View Enabled
cy: Galluogi gwedd y we/HTML y dystysgrif

source: If true, certificate Web/HTML views are enabled for the course.
cy: Os gwir, galluogir gwedd y we/HTML y dystysgrif ar gyfer y cwrs.

source: Certificate Web/HTML View Overrides
cy: Galluogi camau diystyru gwedd y we/HTML y dystysgrif

source: Enter course-specific overrides for the Web/HTML template parameters here (JSON format)
cy: Rhowch gamau diystyru penodol i'r cwrs ar gyfer paramedrau patrymlun y we/HTML yma (fformat JSON)

source: Certificate Configuration
cy: Ffurfweddiad tystysgrif

source: Enter course-specific configuration information here (JSON format)
cy: Rhowch wybodaeth ffurfweddu penodol i'r cwrs yma (fformat JSON)

source: CSS Class for Course Reruns
cy: Dosbarth CSS ar gyfer ail-redeg cyrsiau

source: Allows courses to share the same css class across runs even if they have different numbers.
cy: Caniatáu i gyrsiau rannu'r un dosbarth css ar draws rhediadau hyd yn oed os yw'r niferoedd yn wahanol.

source: Discussion Forum External Link
cy: Dolen allanol fforwm drafod

source: Allows specification of an external link to replace discussion forums.
cy: Caniatáu manyleb dolen allanol yn lle fforymau trafod.

source: Hide Progress Tab
cy: Cuddio'r tab cynnydd

source: Allows hiding of the progress tab.
cy: Caniatáu cuddio'r tab cynnydd.

source: Course Organization Display String
cy: Llinyn arddangos sefydliad y cwrs

source: Enter the course organization that you want to appear in the course. This setting overrides the organization that you entered when you created the course. To use the organization that you entered when you created the course, enter null.
cy: Rhowch sefydliad y cwrs rydych am iddo ymddangos ar y cwrs. Mae'r gosodiad hwn yn cymryd lle y sefydliad a roesoch wrth greu'r cwrs. I ddefnyddio'r sefydliad a roesoch wrth greu'r cwrs, rhowch ddim.

source: Course Number Display String
cy: Llinyn arddangos rhif y cwrs

source: Enter the course number that you want to appear in the course. This setting overrides the course number that you entered when you created the course. To use the course number that you entered when you created the course, enter null.
cy: Rhowch rif y cwrs rydych am iddo ymddangos ar y cwrs. Mae'r gosodiad hwn yn cymryd lle rhif y cwrs a roesoch wrth greu'r cwrs. I ddefnyddio rhif y cwrs a roesoch wrth greu'r cwrs, rhowch ddim.

source: Course Maximum Student Enrollment
cy: Mwyafswm nifer y myfyrwyr a all gofrestru

source: Enter the maximum number of students that can enroll in the course. To allow an unlimited number of students, enter null.
cy: Rhowch mwyafswm nifer y myfyrwyr sy'n gallu cofrestru ar y cwrs. I ganiatáu i nifer diderfyn o fyfyrwyr, rhowch ddim.

source: Allow Public Wiki Access
cy: Caniatáu mynediad cyhoeddus i wici

source: Enter true or false. If true, edX users can view the course wiki even if they're not enrolled in the course.
cy: Rhowch gwir neu anwir. Os yn wir, gall defnyddwyr edX weld wici'r cwrs hyd yn oed os ydynt heb gofrestru ar y cwrs.

source: Invitation Only
cy: Gwahoddiad yn unig

source: Whether to restrict enrollment to invitation by the course staff.
cy: A ddylid cyfyngu cofrestru i wahoddiad gan staff y cwrs.

source: Pre-Course Survey Name
cy: Enw'r arolwg cyn y cwrs

source: Name of SurveyForm to display as a pre-course survey to the user.
cy: Enw'r ffurflen arolwg i'w arddangos fel arolwg cyn y cwrs i'r defnyddiwr.

source: Pre-Course Survey Required
cy: Mae'r arolwg cyn y cwrs yn ofynnol

source: Specify whether students must complete a survey before they can view your course content. If you set this value to true, you must add a name for the survey to the Course Survey Name setting above.
cy: Nodwch a ddylai'r myfyrwyr gwblhau arolwg cyn gweld cynnwys eich cwrs. Os gosodwch y gwerth hwn i wir, rhaid i chi ychwanegu enw'r arolwg i'r gosodiad Enw Arolwg y Cwrs uchod.

source: Course Visibility In Catalog
cy: Pa mor weladwy yw'r cwrs yn y catalog

source: Defines the access permissions for showing the course in the course catalog. This can be set to one of three values: 'both' (show in catalog and allow access to about page), 'about' (only allow access to about page), 'none' (do not show in catalog and do not allow access to an about page).
cy: Mae'n diffinio caniatâd mynediad ar gyfer dangos y cwrs yn y catalog cyrsiau. Gellir gosod un o'r tri gwerth: 'Y ddau' (i'w weld yn y catalog a chaniatáu mynediad i'r dudalen amdano), 'amdano' (mynediad i'r dudalen amdano yn unig), 'dim un' (peidiwch â dangos yn y catalog na chaniatáu mynediad i'r dudalen amdano.

source: Both
cy: Y ddau

source: About
cy: Amdano

source: None
cy: Dim un

source: Entrance Exam Enabled
cy: Arholiad mynediad wedi'i alluogi

source: Specify whether students must complete an entrance exam before they can view your course content. Note, you must enable Entrance Exams for this course setting to take effect.
cy: Nodwch a ddylai'r myfyrwyr gwblhau arholiad mynediad cyn gweld cynnwys eich cwrs. Sylwer, rhaid i chi alluogi Arholiadau Mynediad er mwyn galluogi'r cwrs hwn.

source: Entrance Exam Minimum Score (%)
cy: Sgôr ofynnol yr arholiad mynediad (%)

source: Specify a minimum percentage score for an entrance exam before students can view your course content. Note, you must enable Entrance Exams for this course setting to take effect.
cy: Nodwch sgôr ganrannol ofynnol ar gyfer arholiad mynediad cyn caiff myfyrwyr weld cynnwys eich cwrs. Sylwer, rhaid i chi alluogi Arholiadau Mynediad er mwyn galluogi'r cwrs hwn.

source: Entrance Exam ID
cy: Rhif adnabod arholiad mynediad

source: Content module identifier (location) of entrance exam.
cy: Dynodydd cynnwys modiwl (lleoliad) arholiad mynediad.

source: Social Media Sharing URL
cy: Cyfryngau cymdeithasol yn rhannu URL

source: If dashboard social sharing and custom course URLs are enabled, you can provide a URL (such as the URL to a course About page) that social media sites can link to. URLs must be fully qualified. For example: http://www.edx.org/course/Introduction-to-MOOCs-ITM001
cy: Os yw rhannu'r dangosfwrdd yn gymdeithasol ac URL cyrsiau ar fesur wedi'u galluogi, gallwch roi URL (megis URL i dudalen am y cwrs) y gall safleoedd cyfryngau cymdeithasol gysylltu iddo. Rhaid cymhwyso'r URL yn llawn. Er enghraifft: http://www.edx.org/course/Introduction-to-MOOCs-ITM001

source: Course Language
cy: Iaith y cwrs

source: Specify the language of your course.
cy: Nodwch iaith eich cwrs.

source: Teams Configuration
cy: Ffurfweddiad timau

source: Specify the maximum team size and topics for teams inside the provided set of curly braces. Make sure that you enclose all of the sets of topic values within a set of square brackets, with a comma after the closing curly brace for each topic, and another comma after the closing square brackets. For example, to specify that teams should have a maximum of 5 participants and provide a list of 2 topics, enter the configuration in this format: {example_format}. In "id" values, the only supported special characters are underscore, hyphen, and period.
cy: Nodwch fwyafswm maint y tîm a phynciau ar gyfer timau o fewn y gyfres o gromfachau cyrliog a ddarparwyd. Sicrhewch eich bod yn cynnwys pob cyfres gwerthoedd pwnc o fewn cromfachau sgwâr, gydag atalnod ar ôl cau'r gromfach gyrliog ar gyfer pob pwnc, ac atalnod arall wedi cau'r cromfachau sgwâr. Er enghraifft, i nodi y dylai timau gael mwyafswm o 5 cyfranogwr a darparu rhestr o 2 bwnc, rhowch y ffurfweddiad yn y fformat hwn: {example_format}. Gyda gwerthoedd "id", yr unig nodau/gymeriadau arbennig a gefnogir yw tanlinell, cysylltnodau ac atalnodau llawn.

source: Enable Proctored Exams
cy: Galluogi arholiadau procter

source: Enter true or false. If this value is true, proctored exams are enabled in your course. Note that enabling proctored exams will also enable timed exams.
cy: Rhowch gwir neu anwir. Os yw'r gwerth hwn yn wir, caiff arholiadau procter eu galluogi yn eich cwrs. Sylwer, y bydd galluogi arholiadau procter hefyd yn galluogi arholiadau a amserir.

source: Allow Opting Out of Proctored Exams
cy: Caniatáu ymeithrio o arholiadau proctor

source: Enter true or false. If this value is true, learners can choose to take proctored exams without proctoring. If this value is false, all learners must take the exam with proctoring. This setting only applies if proctored exams are enabled for the course.
cy: Rhowch gwir neu anwir. Os yw'r gwerth yma'n wir, gall y dysgwyr ddewis cymryd arholiadau procter heb broctora. Os yw'r gwerth yma'n anwir, rhaid i bob dysgwr gymryd yr arholiad gyda phrocter. Mae'r gosodiadau ond yn gymwys os yw arholiadau procter wedi'u galluogi ar gyfer y cwrs.

source: Create Zendesk Tickets For Suspicious Proctored Exam Attempts
cy: Creu tocynnau Zendesk ar gyfer ceisiadau arholiadau procter amheus

source: Enter true or false. If this value is true, a Zendesk ticket will be created for suspicious attempts.
cy: Rhowch gwir neu anwir. Os yw'r gwerth yn wir, bydd tocyn Zandesk yn cael ei greu ar gyfer ceisiadau amheus.

source: Enable Timed Exams
cy: Galluogi arholiadau a amserir

source: Enter true or false. If this value is true, timed exams are enabled in your course. Regardless of this setting, timed exams are enabled if Enable Proctored Exams is set to true.
cy: Rhowch gwir neu anwir. Os yw'r gwerth hwn yn wir, caiff arholiadau a amserir eu galluogi yn eich cwrs. Ni waeth y gosodiad hwn, caiff arholiadau a amserir eu galluogi os gosodir Galluogi Arholiadau Procter yn wir.

source: Minimum Grade for Credit
cy: Gradd ofynnol ar gyfer credyd

source: The minimum grade that a learner must earn to receive credit in the course, as a decimal between 0.0 and 1.0. For example, for 75%, enter 0.75.
cy: Y lleiafswm gradd mae'n rhaid i fyfyriwr ei ennill i dderbyn credyd ar y cwrs, fel degolyn rhwng 0.0 a 1.0. Er enghraifft, ar gyfer 75%, rhowch 0.75.

source: Self Paced
cy: Pennu cyflymder eich hun

source: Set this to "true" to mark this course as self-paced. Self-paced courses do not have due dates for assignments, and students can progress through the course at any rate before the course ends.
cy: Gosodwch hwn i "gwir" i nodi'r cwrs ar gyflymder yr unigolyn. Nid oes gan gyrsiau cyflymder yr unigolyn unrhyw ddyddiadau disgwyl ar gyfer aseiniadau, a gall myfyrwyr symud drwy'r cwrs ar unrhyw gyflymder cyn diwedd y cwrs.

source: Bypass Course Home
cy: Osgoi hafan y cwrs

source: Bypass the course home tab when students arrive from the dashboard, sending them directly to course content.
cy: Gallwch osgoi tab hafan y cwrs pan ddaw myfyrwyr o'r dangosfwrdd, a'u hanfon yn syth at gynnwys y cwrs.

source: Enable Subsection Prerequisites
cy: Galluogi rhagofynion is-adrannau

source: Enter true or false. If this value is true, you can hide a subsection until learners earn a minimum score in another, prerequisite subsection.
cy: Rhowch gwir neu anwir. Os gosodir hyn yn wir, gallwch guddio is-adran hyd nes bod y dysgwyr yn cyflawni lleiafswm sgôr mewn is-adran rhagofynnol arall.

source: Course Learning Information
cy: Gwybodaeth am ddysgu ar y cwrs

source: Specify what student can learn from the course.
cy: Nodwch yr hyn gall fyfyriwr ddysgu o'r cwrs.

source: Course Instructor
cy: Hyfforddwr y cwrs

source: Enter the details for Course Instructor
cy: Rhowch fanylion hyfforddwr y cwrs

source: Add Unsupported Problems and Tools
cy: Ychwanegu problemau heb eu cefnogi ac offer

source: Enter true or false. If true, you can add unsupported problems and tools to your course in Studio. Unsupported problems and tools are not recommended for use in courses due to non-compliance with one or more of the base requirements, such as testing, accessibility, internationalization, and documentation.
cy: Rhowch gwir neu anwir. Os gwir, gallwch ychwanegu problemau heb gefnogaeth ac offer i'ch cwrs yn Studio. Nid argymhellir problemau heb gefnogaeth ac offer i'w defnyddio ar gyrsiau oherwydd anghydffurfiaeth ag un neu fwy o'r gofynion sylfaenol, megis profi, hygyrchedd, rhyngwladoli a dogfennu.

source: General
cy: Cyffredinol

source: Text
cy: Testun

source: Html contents to display for this module
cy: Cynnwys HTML i'w arddangos ar gyfer y modiwl hwn.

source: Source code for LaTeX documents. This feature is not well-supported.
cy: Côd ffynhonnell ar gyfer dogfennau LaTeX. Nid yw'r nodwedd hon wedi'i chefnogi'n dda.

source: Select Visual to enter content and have the editor automatically create the HTML. Select Raw to edit HTML directly. If you change this setting, you must save the component and then re-open it for editing.
cy: Dewiswch Visual i ychwanegu cynnwys a chael y golygydd i greu HTML yn awtomatig. Dewiswch Crai i olygu'r HTML yn uniongyrchol. Os byddwch yn newid y gosodiad hwn, rhaid i chi gadw'r gydran ac yn ei hail-agor i'w golygu.

source: Editor
cy: Golygydd

source: Visual
cy: Gweledol

source: Raw
cy: Crai

source: Hide Page From Learners
cy: Cuddio'r dudalen rhag y dysgwyr

source: If you select this option, only course team members with the Staff or Admin role see this page.
cy: Os byddwch yn dewis hwn, aelodau tîm y cwrs gyda rolau staff neu weinyddydd yn unig gaiff weld y dudalen hon.

source: HTML for the additional pages
cy: HTML ar gyfer y tudalennau ychwanegol

source: List of course update items
cy: Rhestr o eitemau diweddariad y cwrs

source: Image Annotation
cy: Anodiad delwedd

source: Tags for Assignments
cy: Tagiau ar gyfer aseiniadau

source: Add tags that automatically highlight in a certain color using the comma-separated form, i.e. imagery:red,parallelism:blue
cy: Ychwanegwch tagiau sy'n amlygu'n awtomatig mewn lliw penodol gan ddefnyddio ffurf gwahanu ag atalnod, h.y. imagery:red,parallelism:blue

source: Location of Annotation backend
cy: Lleoliad yr ôl-anodiadau

source: Url for Annotation Storage
cy: URL ar gyfer Storio Anodiadau

source: Secret string for annotation storage
cy: Llinyn cyfrinachol ar gyfer Storio Anodiadau

source: Secret Token String for Annotation
cy: Llinyn tocyn cyfrinachol ar gyfer Anodiadau

source: Default Annotations Tab
cy: Tab anodiadau diofyn

source: Select which tab will be the default in the annotations table: myNotes, Instructor, or Public.
cy: Dewiswch pa dab fydd yn ddiofyn yn y tabl anodiadau: myNotes, Hyfforddwr, neu Cyhoeddus.

source: Email for 'Instructor' Annotations
cy: E-bost ar gyfer anodiadau 'Hyfforddwr'

source: Email of the user that will be attached to all annotations that will be found in 'Instructor' tab.
cy: E-bostiwch y defnyddiwr a fydd yn glwm i'r holl anodiadau i'w cael yn y tab 'Hyfforddwr'.

source: Mode for Annotation Tool
cy: Modd ar gyfer offeryn anodi

source: Type in number corresponding to following modes: 'instructor' or 'everyone'
cy: Rhowch y rhif cyfatebol i'r moddau hyn: 'hyfforddwr' neu 'pawb'

source: No email address found.
cy: Ni chanfuwyd gyfeiriad e-bost.

source: Any Type
cy: Unrhyw fath

source: Library
cy: Llyfrgell

source: Select the library from which you want to draw content.
cy: Dewiswch y llyfrgell i gael cynnwys ohono.

source: Library Version
cy: Fersiwn y llyfrgell

source: Determines how content is drawn from the library
cy: Mae'n pennu sut caiff cynnwys ei dynnu o'r llyfrgell

source: Choose n at random
cy: Dewiswch n ar hap

source: Count
cy: Cyfrif

source: Enter the number of components to display to each student.
cy: Rhowch nifer y cydrannau i'w harddangos i bob myfyriwr.

source: Problem Type
cy: Math o broblem

source: Choose a problem type to fetch from the library. If "Any Type" is selected no filtering is applied.
cy: Dewiswch math o broblem i'w nôl o'r llyfrgell. Os dewiswch "Unrhyw fath" ni chymhwysir unrhyw hidlo.

source: This component is out of date. The library has new content.
cy: Mae'r gydran hon yn hen. Mae cynnwys newydd yn y llyfrgell.

source: {refresh_icon} Update now.
cy: {refresh_icon} Diweddaru nawr.

source: Library is invalid, corrupt, or has been deleted.
cy: Mae'r llyfrgell yn annilys, yn llygredig neu wedi'i dileu.

source: Edit Library List.
cy: Golygu'r rhestr llyfrgelloedd

source: This course does not support content libraries. Contact your system administrator for more information.
cy: Nid yw'r cwrs hwn yn cefnogi llyfrgelloedd cynnwys. Cysylltwch â'ch gweinyddwr system am fwy o wybodaeth.

source: A library has not yet been selected.
cy: Nid oes llyfrgell wedi cael ei dewis eto.

source: Select a Library.
cy: Dewiswch lyfrgell.

source: There are no matching problem types in the specified libraries.
cy: Nid oes unrhyw fathau o broblemau sy'n cyd-fynd yn y llyfrgelloedd a nodwyd.

source: Select another problem type.
cy: Dewiswch math arall o broblem.

source: Edit the library configuration.
cy: Golygu ffurfweddiad y llyfrgell.

source: Invalid Library
cy: Llyfrgell annilys

source: No Library Selected
cy: Ni ddewiswyd llyfrgell

source: Library Display Name
cy: Enw arddangos y llyfrgell

source: Enter the names of the advanced components to use in your library.
cy: Rhowch enwau'r cydrannau uwch i'w defnyddio yn eich llyfrgell.

source: The display name for this component. Analytics reports may also use the display name to identify this component.
cy: Yr enw arddangos ar gyfer y gydran hon. Gall adroddiadau dadansoddeg hefyd ddefnyddio'r enw arddangos i nodi'r gydran hon.

source: LTI ID
cy: Rhif adnabod LTI

source: Enter the LTI ID for the external LTI provider. This value must be the same LTI ID that you entered in the LTI Passports setting on the Advanced Settings page.<br />See {docs_anchor_open}the edX LTI documentation{anchor_close} for more details on this setting.
cy: Rhowch rif adnabod LTI ar gyfer darparwr LTI allanol. Rhaid i'r gwerth hwn fod yr un rhif adnabod LTI a roesoch yn y gosodiad Pasportau LTI ar y dudalen Gosodiadau Uwch.<br />Gweler {docs_anchor_open}dogfennaeth LTI edX{anchor_close} am fwy o wybodaeth am y gosodiad hwn.

source: LTI URL
cy: URL LTI
