Repository: zhulinhai/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: cy

source: These reports are delimited alphabetically by university name. i.e., generating a report with 'Start Letter' A and 'End Letter' C will generate reports for all universities starting with A, B, and C.
cy: Mae'r adroddiadau hyn wedi'u amffinio yn ôl enw prifysgol yn nhrefn yr wyddor. h.y., bydd cynhyrchu adroddiad gyda'r 'Llythyren ddechrau' A a'r 'Llythyren gorffen' C yn cynhyrchu adroddiadau ar gyfer pob prifysgol yn dechrau ag A, B a C.

source: Payment Error
cy: Gwall wrth dalu

source: There was an error processing your order!
cy: Cafwyd gwall wrth brosesu'ch archeb!

source: Thank you for your purchase!
cy: Diolch am brynu!

source: View Dashboard
cy: Gweld y dangosfwrdd

source: You have successfully been enrolled for {course_names}. The following receipt has been emailed to {receipient_emails}
cy: Cawsoch eich cofrestru'n llwyddiannus ar gyfer {course_names}. Mae'r dderbynneb hon wedi cael ei e-bostio at {receipient_emails}

source: The following receipt has been emailed to {receipient_emails}
cy: Mae'r dderbynneb hon wedi cael ei e-bostio at {receipient_emails}

source: Please send each professional one of these unique registration codes to enroll into the course. The confirmation/receipt email you will receive has an example email template with directions for the individuals enrolling.
cy: Anfonwch un o'r codau cofrestru unigryw hyn at bob person proffesiynol er mwyn cofrestru ar y cwrs. Bydd yr e-bost cadarnhau/derbyn a gewch yn cynnwys enghraifft o'r patrymlun e-bost gyda chyfarwyddiadau ar gyfer yr unigolion sy'n cofrestru.

source: Enrollment Link
cy: Dolen gofrestru

source: Used
cy: Defnyddiwyd

source: Invalid
cy: Annilys

source: Date of purchase
cy: Dyddiad prynu

source: Print Receipt
cy: Argraffu derbynneb

source: Billed To Details
cy: Manylion at bwy anfonwyd y bil

source: N/A
cy: Ddim yn berthnasol

source: Purchase Order Number
cy: Rhif yr archeb

source: Company Contact Name
cy: Enw cyswllt y cwmni

source: Company Contact Email
cy: Cyfeiriad e-bost cyswllt y cwmni

source: Recipient Name
cy: Enw'r derbynnydd

source: Recipient Email
cy: E-bost y derbynnydd

source: Card Type
cy: Math o gerdyn

source: Credit Card Number
cy: Rhif y cerdyn credyd

source: Address 1
cy: Cyfeiriad 1

source: Address 2
cy: Cyfeiriad 2

source: State
cy: Cyflwr

source: Registration for:
cy: Cofrestru ar gyfer:

source: Price per student:
cy: Pris fesul myfyriwr:

source: Discount Applied:
cy: Y disgownt a roddwyd:

source: Students
cy: Myfyrwyr

source: Note: items with strikethough like <del>this</del> have been refunded.
cy: Sylwer: bydd eitemau â llinell drwodd fel <del>hyn</del> yn cael ei ad-dalu.

source: Confirm Enrollment
cy: Cadarnhau Cofrestru

source: {site_name} - Confirm Enrollment
cy: {site_name} - Cadarnhau cofrestru

source: {course_number} {course_title} Cover Image
cy: {course_number} {course_title} Delwedd glawr

source: Confirm your enrollment for: {span_start}course dates{span_end}
cy: Cadarnhau eich cofrestriad ar gyfer: {span_start}dyddiadau'r cwrs{span_end}

source: You've clicked a link for an enrollment code that has already been used. Check your {link_start}course dashboard{link_end} to see if you're enrolled in the course, or contact your company's administrator.
cy: Rydych wedi clicio ar ddolen ar gyfer côd cofrestru sydd eisoes wedi cael ei ddefnyddio. Ewch i {link_start}ddangosfwrdd y cwrs{link_end} i weld a ydych wedi cofrestru ar y cwrs, neu gysylltwch â gweinyddydd eich cwmni.

source: You have successfully enrolled in {course_name}. This course has now been added to your dashboard.
cy: Rydych wedi'ch cofrestru'n llwyddiannus ar gwrs {course_name}. Mae'r cwrs hwn nawr wedi cael ei ychwanegu i'ch dangosfwrdd.

source: You're already enrolled for this course. Visit your {link_start}dashboard{link_end} to see the course.
cy: Rydych eisoes wedi cofrestru ar y cwrs hwn. Ewch i'ch {link_start}dangosfwrdd{link_end} i weld y cwrs.

source: The course you are enrolling for is full.
cy: Mae'r cwrs rydych yn cofrestru ar ei gyfer yn llawn.

source: The course you are enrolling for is closed.
cy: Mae'r cwrs rydych yn cofrestru ar ei gyfer wedi cau.

source: There was an error processing your redeem code.
cy: Cafwyd gwall wrth brosesu'ch côd cyfnewid.

source: You're about to activate an enrollment code for {course_name} by {site_name}. This code can only be used one time, so you should only activate this code if you're its intended recipient.
cy: Rydych ar fin ysgogi côd cofrestru ar gyfer {course_name} gan {site_name}. Gellir ond defnyddio'r côd hwn unwaith, felly dylech ond gynnau'r côd hwn os taw ar eich cyfer chi y mae.

source: Activate Course Enrollment
cy: Ysgogi cofrestru ar y cwrs

source: Cover Image
cy: Delwedd glawr

source: Students:
cy: Myfyrwyr:

source: Input quantity and press enter.
cy: Rhowch nifer a gwasgu enter.

source: Increase
cy: Cynnydd

source: Decrease
cy: Lleihad

source: Remove
cy: Dileu

source: Discount or activation code
cy: Côd ysgogi neu ddisgownt

source: discount or activation code
cy: côd ysgogi neu ddisgownt

source: Apply
cy: Gwneud cais

source: code has been applied
cy: ychwanegwyd y côd

source: TOTAL:
cy: CYFANSWM:

source: After this purchase is complete, a receipt is generated with relative billing details and registration codes for students.
cy: Wedi cwblhau prynu, bydd derbynneb yn cael ei chynhyrchu gyda'r manylon bilio a'r codau cofrestru perthnasol ar gyfer y myfyrwyr.

source: After this purchase is complete, {username} will be enrolled in this course.
cy: Wedi cwblhau prynu, bydd {username} yn cael ei gofrestru ar y cwrs hwn.

source: Empty Cart
cy: Troli gwag

source: Shopping cart
cy: Troli siopa

source: {platform_name} - Shopping Cart
cy: {platform_name} - Troli siopa

source: Confirmation
cy: Cadarnhad

source: The page that you were looking for was not found. Go back to the {link_start}homepage{link_end} or let us know about any pages that may have been moved at {email}.
cy: Ni ddaethpwyd o hyd i'r dudalen rydych yn chwilio amdani. Ewch yn ôl i'r {link_start}hafan{link_end} neu roi gwybod i ni am unrhyw dudalennau a all fod wedi symud yn {email}.

source: This page left intentionally blank. Feel free to add your own content.
cy: Gadawyd y dudalen hon yn wag yn fwriadol. Mae croeso i chi ychwanegu eich cynnwys eich hun.

source: FAQ
cy: Cwestiynau cyffredin

source: Jobs
cy: Swyddi

source: In the Press
cy: Yn y wasg

source: Currently the {platform_name} servers are down
cy: Ar hyn o bryd mae gweinyddion {platform_name} i lawr

source: Our staff is currently working to get the site back up as soon as possible. Please email us at {tech_support_email} to report any problems or downtime.
cy: Mae ein staff yn gweithio i gael y safle yn ôl cyn gynted â phosibl. E-bostiwch ni yn {tech_support_email} i adrodd am unrhyw broblemau neu adegau nad yw'n gweithio.

source: There has been a 500 error on the {platform_name} servers
cy: Cafwyd gwall 500 ar weinyddion {platform_name}

source: Please wait a few seconds and then reload the page. If the problem persists, please email us at {email}.
cy: Arhoswch ychydig eiliadau ac yna ail-lwytho'r dudalen. Os yw'r broblem yn parhau, e-bostiwch ni yn {email}.

source: Currently the {platform_name} servers are overloaded
cy: Ar hyn o bryd mae gweinyddion {platform_name} wedi'u gorlwytho

source: Account Settings
cy: Gosodiadau'r cyfrif

source: Please Wait
cy: Arhoswch

source: Sign in or Register
cy: Mewngofnodi neu gofrestru

source: Learner Profile
cy: Proffil y dysgwr

source: Connected Accounts
cy: Cyfrifon cysylltiedig

source: Linked
cy: Wedi'u cysylltu

source: Not Linked
cy: Heb eu cysylltu

source: Unlink
cy: Datgysylltu

source: Link
cy: Cysylltu

source: Student Support
cy: Cefnogaeth i fyfyrwyr

source: Student Support: Certificates
cy: Cefnogaeth i fyfyrwyr: Tystysgrifau

source: Student Support: Enrollment
cy: Cefnogaeth i fyfyrwyr: Cofrestru

source: About to refund this order:
cy: Am ad-dalu'r archeb hon:

source: Order Id:
cy: Rhif yr archeb:

source: Enrollment:
cy: Cofrestru:

source: enrolled
cy: Cofrestrwyd

source: unenrolled
cy: datgofrestrwyd

source: CertificateItem Status:
cy: Statws eitem tystysgrif:

source: Order Status:
cy: Statws yr archeb:

source: Fulfilled Time:
cy: Amser cyflawni:

source: Refund Request Time:
cy: Amser ceisio am ad-daliad:

source: User Survey
cy: Arolwg defnyddwyr

source: Pre-Course Survey
cy: Arolwg cyn y cwrs

source: You can begin your course as soon as you complete the following form. Required fields are marked with an asterisk (*). This information is for the use of {platform_name} only. It will not be linked to your public profile in any way.
cy: Gallwch ddechrau ar eich cwrs cyn gynted ag y cwblhewch y ffurflen hon. Mae'r meysydd gofynnol wedi'u nodi â seren (*). Mae'r wybodaeth hon ar gyfer {platform_name} yn unig. Ni fydd yn gysylltiedig â'ch proffil cyhoeddus mewn unrhyw fodd.

source: You are missing the following required fields:
cy: Mae'r meysydd gofynnol hyn yn wag:

source: Cancel and Return to Dashboard
cy: Canslo a dychwelyd i'r dangosfwrdd

source: Why do I need to complete this information?
cy: Pam mae rhaid i mi gwblhau'r wybodaeth hon?

source: We use the information you provide to improve our course for both current and future students. The more we know about your specific needs, the better we can make your course experience.
cy: Rydym yn defnyddio'r wybodaeth rydych yn ei rhoi i wella ein cwrs ar gyfer ein myfyrwyr cyfredol ac yn y dyfodol. Po fwyaf y gwyddom am eich anghenion penodol, gorau oll gallwn wneud eich profiad ar y cwrs.

source: Who can I contact if I have questions?
cy: Â phwy gallaf gysylltu os oes gennyf gwestiynau?

source: If you have any questions about this course or this form, you can contact {link_start}{mail_to_link}{link_end}.
cy: Os oes gennych unrhyw gwestiynau am y cwrs hwn neu'r ffurflen hon, cysylltwch â {link_start}{mail_to_link}{link_end}.

source: Have questions?
cy: Am holi cwestiwn?

source: Please read {a_start}our FAQs to view common questions about our certificates{a_end}.
cy: Darllenwch {a_start}ein Cwestiynau Cyffredin i weld yr hyn a holir amlaf am ein tystysgrifau{a_end}.

source: Re-Verify for {course_name}
cy: Ail-wirio ar gyfer {course_name}

source: Verification Deadline Has Passed
cy: Mae'r dyddiad cau ar gyfer gwirio wedi bod

source: Upgrade Deadline Has Passed
cy: Mae'r dyddiad cau ar gyfer uwchraddio wedi bod

source: The verification deadline for {course_name} was {{date}}. Verification is no longer available.
cy: Y dyddiad terfyn ar gyfer {course_name} oedd {{date}}. Nid yw gwirio bellach ar gael.

source: The deadline to upgrade to a verified certificate for this course has passed.
cy: Mae'r dyddiad cau ar gyfer uwchraddio i dystysgrif wedi'i gwirio wedi bod ar gyfer y cwrs hwn.

source: Upgrade Your Enrollment For {course_name}.
cy: Uwchraddio eich cofrestru ar gyfer {course_name}.

source: Receipt For {course_name}
cy: Derbynneb ar gyfer {course_name}

source: Verify For {course_name}
cy: Gwirio ar gyfer {course_name}

source: Enroll In {course_name}
cy: Cofrestru ar gyfer {course_name}

source: Technical Requirements
cy: Gofynion technegol

source: Please make sure your browser is updated to the {strong_start}{a_start}most recent version possible{a_end}{strong_end}. Also, please make sure your {strong_start}webcam is plugged in, turned on, and allowed to function in your web browser (commonly adjustable in your browser settings).{strong_end}
cy: Sicrhewch bod eich porwr wedi'i ddiweddaru i'r {strong_start}{a_start}fersiwn mwyaf diweddar posib{a_end}{strong_end}. Hefyd, sicrhewch bod eich gwe-gamera {strong_start} wedi'i blygio i mewn, ymlaen, ac yn gallu gweithredu yn eich porwr gwe (gellir addasu'n hawdd yng ngosodiadau eich porwr).{strong_end}

source: Re-Verification
cy: Ail-wirio

source: Identity Verification
cy: Gwirio pwy ydych chi

source: You have already submitted your verification information. You will see a message on your dashboard when the verification process is complete (usually within 1-2 days).
cy: Rydych eisoes wedi cyflwyno eich gwybodaeth wirio. Byddwch yn gweld neges ar eich dangosfwrdd wedi cwblhau'r broses wirio (fel arfer o fewn 1-2 diwrnod).

source: You cannot verify your identity at this time.
cy: Ni fedrwn wirio pwy ydych chi ar hyn o bryd.

source: Return to Your Dashboard
cy: Dychwelyd i'ch dangosfwrdd

source: This website uses cookies to ensure you get the best experience on our website.
cy: Mae'r wefan hon yn defnyddio cwcis i sicrhau eich bod yn cael y profiad gorau arein gwefan

source: Got it!
cy: Wedi'i gael!

source: Changes
cy: Newidiadau

source: Add article
cy: Ychwanegu erthygl

source: Access Course Staff Support on the Partner Portal to submit or review support tickets
cy: Hygyrchu cefnogaeth i staff y cwrs ar Partner Portal er mwyn cyflwyno neu adolygu tocynnau cefnogi

source: edX Partner Portal
cy: Porthol edX Partner

source: Browse recently launched courses and see what's new in your favorite subjects.
cy: Porwch drwy'r cyrsiau a lansiwyd yn ddiweddar i weld yr hyn sy'n newydd yn eich hoff bynciau.

source: Explore New Courses
cy: Archwilio cyrsiau newydd

source: Page Footer
cy: Troedyn tudalen

source: About edX
cy: Am edX

source: © 2012-{year} edX Inc. All rights reserved except where noted. EdX, Open edX and the edX and Open EdX logos are registered trademarks or trademarks of edX Inc.
cy: © 2012-{year} edX Inc. Cedwir pob hawl heblaw lle nodir. Mae EdX, Open edX a logos edX a Open EdX yn nodau masnachu cofrestredig neu'n nodau masnachu edX Inc.

source: Find Courses
cy: Canfod cyrsiau

source: Schools & Partners
cy: Ysgolion a phartneriaid

source: {b_start}Support our Mission: {b_end} EdX, a non-profit, relies on verified certificates to help fund free education for everyone globally
cy: {b_start}Cefnogi ein cenhadaeth: {b_end} Mae EdX, sydd nid er elw, yn dibynnu ar dystysgrifau wedi'i gwirio i'w helpu i ariannu addysg am ddim i bawb ar draws y byd

source: EdX, Open edX, and the edX and Open edX logos are registered trademarks or trademarks of {link_start}edX Inc.{link_end}
cy: Mae EdX, Open edX a logos edX a Open EdX yn nodau masnachu cofrestredig neu'n nodau masnachu {link_start}edX Inc.{link_end}

source: {tos_link_start}Terms of Service{tos_link_end} and {honor_link_start}Honor Code{honor_link_end}
cy: {tos_link_start}Telerau gwasanaeth{tos_link_end} a {honor_link_start}chôd anrhydedd{honor_link_end}

source: More options dropdown
cy: Cwymplen â mwy o ddewisiadau

source: My Profile
cy: Fy mhroffil

source: Register Now
cy: Cofrestru nawr

source: Copyright
cy: Hawlfraint

source: Copyright {year}. All rights reserved.
cy: Hawlfraint {year}. Cedwir pob hawl.

source: For anyone, anywhere, anytime
cy: Ar gyfer unrhyw un, unrhyw bryd, unrhyw le

source: You will receive an activation email. You must click on the activation link to complete the process. Don't see the email? Check your spam folder and mark emails from class.stanford.edu as 'not spam', since you'll want to be able to receive email from your courses.
cy: Byddwch yn derbyn e-bost ysgogi. Rhaid i chi glicio ar y ddolen ysgogi i gwblhau'r broses. Methu gweld yr e-bost? Gwiriwch eich ffolder sbam a nodi e-bostiau gan class.stanford.edu fe; 'not spam', am y byddwch am dderbyn e-bostiau gan eich cyrsiau.

source: Need help in registering with {platform_name}?
cy: Angen cymorth wrth gofrestru gyda {platform_name}?

source: Once registered, most questions can be answered in the course specific discussion forums or through the FAQs.
cy: Wedi i chi gofrestru, gellir ateb y mwyafrif o gwestiynau yn y fforymau trafodaeth penodol neu drwy'r cwestiynau cyffredin.

source: Put your Terms of Service here!
cy: Rhowch eich telerau gwasanaeth yma!

source: Put your Privacy Policy here!
cy: Rhowch eich polisi preifatrwydd yma!

source: Put your Honor Code here!
cy: Rhowch eich côd anrhydedd yma!

source: Put your Copyright Text here!
cy: Rhowch eich testun hawlfraint yma!

source: The page that you were looking for was not found.
cy: Ni ddaethpwyd o hyd i'r dudalen rydych yn chwilio amdani.

source: Go back to the {homepage} or let us know about any pages that may have been moved at {email}.
cy: Ewch yn ôl i {homepage} neu rowch wybod i ni am unrhyw dudalennau sydd wedi symud {email}.

source: {studio_name} Server Error
cy: Gwall gweinydd {studio_name}

source: The {em_start}{studio_name}{em_end} servers encountered an error
cy: Mae'r gweinyddion {em_start}{studio_name}{em_end} wedi dod ar draws gwall

source: An error occurred in {studio_name} and the page could not be loaded. Please try again in a few moments.
cy: Mae gwall wedi codi yn {studio_name} ac ni ellid llwytho'r dudalen. Rhowch gynnig arall arni mewn ychydig funudau.

source: We've logged the error and our staff is currently working to resolve this error as soon as possible.
cy: Rydym wedi cofnodi'r gwall ac mae ein staff yn gweithio i ddatrys y gwall cyn gynted â phosibl.

source: If the problem persists, please email us at {email_link}.
cy: Os yw'r broblem yn parhau, e-bostiwch ni yn {email_link}.

source: {studio_name} Account Activation
cy: Ysgogi cyfrif {studio_name}

source: Your account is already active
cy: Mae eich cyfrif eisoes wedi'i gynnau

source: This account, set up using {email}, has already been activated. Please sign in to start working within {studio_name}.
cy: Mae'r cyfrif hwn, gyda'r {email} hwn, eisoes wedi cael ei ysgogi. Mewngofnodwch i ddechrau gweithio gyda {studio_name}.

source: Sign into {studio_name}
cy: Mewngofnodi i {studio_name}

source: Your account activation is complete!
cy: Mae ysgogi eich cyfrif yn gyflawn!

source: Thank you for activating your account. You may now sign in and start using {studio_name} to author courses.
cy: Diolch am ysgogi'ch cyfrif. Gallwch nawr fewngofnodi a dechrau defnyddio {studio_name} i awduro cyrsiau.

source: Your account activation is invalid
cy: Mae ysgogi eich cyfrif yn annilys

source: We're sorry. Something went wrong with your activation. Check to make sure the URL you went to was correct, as e-mail programs will sometimes split it into two lines.
cy: Mae'n flin gennym. Aeth rhywbeth o'i le wrth gynnau. Sicrhewch bod yr URL aethoch iddo yn gywir, gan y gall rhaglenni e-bost weithiau hollti'n ddwy linell.

source: If you still have issues, contact {platform_name} Support. In the meantime, you can also return to {link_start}the {studio_name} homepage.{link_end}
cy: Os oes gennych broblemau o hyd, cysylltwch â chefnogaeth {platform_name}. Yn y cyfamser, gallwch hefyd ddychwelyd i {link_start}hafan {studio_name}.{link_end}

source: Files & Uploads
cy: Ffeiliau a llwytho i fyny

source: Page Actions
cy: Gweithrediadau tudalen

source: Upload New File
cy: Llwytho ffeil newydd i fyny

source: Adding Files for Your Course
cy: Yn ychwanegu ffeiliau i'ch cwrs

source: To add files to use in your course, click {em_start}Upload New File{em_end}. Then follow the prompts to upload a file from your computer.
cy: I ychwanegu ffeiliau i'w defnyddio yn eich cwrs, cliciwch ar {em_start}Llwytho ffeil newyddi fyny {em_end}. Yna dilynwch y cyfarwyddiadau i lwytho ffeil o'ch cyfrifiadur i fyny.

source: {em_start}Caution{em_end}: {platform_name} recommends that you limit the file size to {em_start}10 MB{em_end}. In addition, do not upload video or audio files. You should use a third party service to host multimedia files.
cy: {em_start}Rhybudd{em_end}: Mae {platform_name} yn argymell eich bod yn cyfyngu maint y ffeil i {em_start}10 MB{em_end}. At hynny, peidiwch â llwytho fideos neu ffeiliau sain i fyny. Dylech ddefnyddio gwasanaeth trydydd parti i gynnal ffeiliau amlgyfrwng.

source: The course image, textbook chapters, and files that appear on your Course Handouts sidebar also appear in this list.
cy: Mae delwedd y cwrs, penawdau'r gwerslyfr a ffeiliau sy'n ymddangos ar far ochr eich taflenni cwrs hefyd yn ymddangos ar y rhestr hon.

source: Using File URLs
cy: Yn defnyddio URL ffeiliau

source: Use the {em_start}{studio_name} URL{em_end} value to link to the file or image from a component, a course update, or a course handout.
cy: Defnyddiwch werth {em_start}URL {studio_name}{em_end} i gysylltu ffeil neu ddelwedd o gydran, diweddariad cwrs neu daflen cwrs.

source: Use the {em_start}Web URL{em_end} value to reference the file or image only from outside of your course. {em_start}Note:{em_end} If you lock a file, the Web URL no longer works for external access to a file.
cy: Defnyddio gwerth {em_start}URL y we{em_end} i gyfeirio ffeil neu ddelwedd o du allan i'ch cwrs yn unig. {em_start}Sylwer:{em_end} Os byddwch yn cloi ffeil, nid yw URL y we bellach yn gweithio er mwyn cyrchu'r ffeil yn allanol.

source: To copy a URL, double click the value in the URL column, then copy the selected text.
cy: I gopïo'r URL, cliciwch ddwywaith ar y gwerth yn y golofn URL, yna copïo'r testun a ddewiswyd.

source: Learn more about managing files
cy: Dysgu mwy am reoli ffeiliau

source: close
cy: cau

source: Max per-file size: {max_filesize}MB
cy: Mwyafswm maint fesul ffeil: {max_filesize}MB

source: Choose File
cy: Dewiswch ffeil

source: Your file has been deleted.
cy: Mae eich ffeil wedi cael ei ddileu.

source: close alert
cy: cau'r hysbysiad

source: Course Certificates
cy: Tystysgrifau'r cwrs

source: This module is not enabled.
cy: Nid yw'r modiwl hwn wedi cael ei alluogi.

source: This course does not use a mode that offers certificates.
cy: Nid yw'r cwrs hwn yn defnyddio modd sy'n cynnig tystysgrifau.

source: Working with Certificates
cy: Gweithio gyda thystysgrifau

source: Specify a course title to use on the certificate if the course's official title is too long to be displayed well.
cy: Nodwch deitl cwrs i'w ddefnyddio ar y dystysgrif os yw teitl swyddogol y cwrs yn rhy hir i'w arddangos yn dda.

source: For verified certificates, specify between one and four signatories and upload the associated images.
cy: Ar gyfer tystysgrifau wedi'u gwirio, nodwch rhwng un a phedwar llofnodwr a llwythwch y delweddau cysylltiedig i fyny.

source: To edit or delete a certificate before it is activated, hover over the top right corner of the form and select {em_start}Edit{em_end} or the delete icon.
cy: I olygu neu ddileu tystysgrif cyn ei ysgogi, gwnewch i'r cyrchwr hofran dros gornel dde uchaf y ffurflen a dethol {em_start}Golygu{em_end} neu'r eicon dileu.

source: To view a sample certificate, choose a course mode and select {em_start}Preview Certificate{em_end}.
cy: I weld tystysgrif enghreifftiol, dewiswch modd y cwrs a dewis {em_start}Rhagolwg o'r Tystysgrif{em_end}.

source: Issuing Certificates to Learners
cy: Rhoi tystysgrifau i ddysgwyr

source: To begin issuing course certificates, a course team member with either the Staff or Admin role selects {em_start}Activate{em_end}. Only course team members with these roles can edit or delete an activated certificate.
cy: I ddechrau rhoi tystysgrifau cwrs, mae un o aelodau tîm y cwrs gyda rôl staff neu weinyddydd yn dethol {em_start}Ysgogi{em_end}. Aelodau tîm y cwrs gyda'r rolau hyn yn unig gaiff olygu neu ddileu tystysgrif wedi'i ysgogi.

source: {em_start}Do not{em_end} delete certificates after a course has started; learners who have already earned certificates will no longer be able to access them.
cy: {em_start}Peidiwch â{em_end} dileu tystysgrifau wedi i gwrs ddechrau; ni fydd dysgwyr sydd eisoes wedi ennill tystysgrifau bellach yn gallu cael atynt.

source: Learn more about certificates
cy: Dysgu mwy am dystysgrifau

source: Other Course Settings
cy: Gosodiadau eraill y cwrs

source: Details &amp; Schedule
cy: Manylion &amp; Amserlen

source: Grading
cy: Graddio

source: Course Team
cy: Tîm y cwrs

source: Advanced Settings
cy: Gosodiadau uwch

source: Duplicate
cy: Copi dyblyg

source: Duplicate this component
cy: Dyblygu'r gydran hon
