Repository: zhulinhai/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: cy

source: Discussion
cy: Trafodaeth

source: Advanced
cy: Uwch

source: Entrance Exam
cy: Arholiad mynediad

source: Section
cy: Adran

source: Subsection
cy: Is-adran

source: Unit
cy: Uned

source: Name
cy: Enw

source: Video ID
cy: Rhif adnabod fideo

source: Status
cy: Statws

source: Pending
cy: Yn yr arfaeth

source: Mode
cy: Modd

source: Verification Deadline
cy: Dyddiad cau gwirio

source: OPTIONAL: After this date/time, users will no longer be able to submit photos for verification. This appies ONLY to modes that require verification.
cy: DEWISOL: Wedi'r dyddiad/amser hwn, ni fydd defnyddwyr yn cael cyflwyno lluniau i'w gwirio. Mae hyn yn berthnasol YN UNIG i foddau sy'n galw am wiriad.

source: Your verification is pending
cy: Mae eich gwiriad yn yr arfaeth

source: Verified: Pending Verification
cy: Gwiriwyd: Gwiriad yn yr arfaeth

source: ID verification pending
cy: Gwirio rhif adnabod yn yr arfaeth

source: You're enrolled as a verified student
cy: Rydych wedi'ch cofrestru fel myfyriwr a wiriwyd

source: Verified
cy: Gwiriwyd

source: ID Verified Ribbon/Badge
cy: Rhuban/Bathodyn rhif adnabod a wiriwyd

source: You're enrolled as an honor code student
cy: Rydych wedi'ch cofrestru fel myfyriwr côd anrhydedd

source: Honor Code
cy: Côd anrhydedd

source: Honour Code
cy: Côd anrhydedd

source: You're enrolled as a professional education student
cy: Rydych wedi'ch cofrestru fel myfyriwr addysg broffesiynol

source: Professional Ed
cy: Addysg broffesiynol

source: Course
cy: Y cwrs

source: Display Name
cy: Enw a ddangosir

source: Price
cy: Pris

source: Upgrade Deadline
cy: Dyddiad cau ar gyfer uwchraddio

source: OPTIONAL: After this date/time, users will no longer be able to enroll in this mode. Leave this blank if users can enroll in this mode until enrollment closes for the course.
cy: DEWISOL: Wedi'r dyddiad/amser hwn, ni fydd defnyddwyr yn cael cofrestru yn y modd hwn. Gadewch hwn yn wag os gall y myfyrwyr gofrestr yn y modd hwn hyd nes cau cofrestru ar gyfer y cwrs.

source: OPTIONAL: This is the SKU (stock keeping unit) of this mode in the external ecommerce service. Leave this blank if the course has not yet been migrated to the ecommerce service.
cy: DEWISOL: Dyma UCS (uned cadw stoc) y modd hwn yn y gwasanaeth e-fasnach allanol. Gadewch hwn yn wag os nad yw'r cwrs wedi cael ei fudo i'r gwasanaeth e-fasnach.

source: This is the bulk SKU (stock keeping unit) of this mode in the external ecommerce service.
cy: Dyma UCS (uned cadw stoc) swmp y modd hwn yn y gwasanaeth e-fasnach allanol.

source: Audit
cy: Awdit

source: Honor
cy: Anrhydedd

source: Professional education modes are not allowed to have expiration_datetime set.
cy: Nid oes hawl gosod expiration_datetime ar foddau addysg broffesiynol.

source: Verified modes cannot be free.
cy: Ni chaiff moddau a wiriwyd fod am ddim.

source: The time period before a course ends in which a course mode will expire
cy: Y cyfnod amser cyn gorffen cwrs pan fydd modd cwrs yn dod i ben

source: Congratulations! You are now enrolled in {course_name}
cy: Llongyfarchiadau! Rydych nawr wedi'ch cofrestru ar gwrs {course_name}

source: Enrollment is closed
cy: Mae cofrestru wedi cau

source: Enrollment mode not supported
cy: Ni chefnogir modd cofrestru

source: Invalid amount selected.
cy: Dewiswyd swm annilys.

source: No selected price or selected price is too low.
cy: Ni ddewiswyd pris neu mae'r pris a ddewiswyd yn rhy isel.

source: Administrator
cy: Gweinyddwr

source: Moderator
cy: Safonwr

source: Community TA
cy: CD cymunedol

source: Student
cy: Myfyriwr

source: User profile
cy: Proffil y defnyddiwr

source: That e-mail address doesn't have an associated user account. Are you sure you've registered?
cy: Nid oes cyfrif defnyddiwr yn gysylltiedig â cyfeiriad e-bost hynny. Ydych chi'n siŵr eich bod wedi cofrestru?

source: The user account associated with this e-mail address cannot reset the password.
cy: Ni all y cyfrif defnyddiwr sy'n gysylltiedig â'r cyfeiriad e-bost hwn ailosod y cyfrinair.

source: Username must be minimum of two characters long
cy: Rhaid i'r enw defnyddiwr fod o leiaf dau nod/gymeriad o hyd

source: A properly formatted e-mail is required
cy: Mae angen e-bost wedi'i fformatio'n iawn

source: A valid password is required
cy: Mae angen cyfrinair dilys

source: Your legal name must be a minimum of two characters long
cy: Rhaid i'ch enw cyfreithiol fod o leiaf ddau nod/gymeriad o hyd

source: Usernames can only contain Roman letters, western numerals (0-9), underscores (_), and hyphens (-).
cy: Gellir ond defnyddio llythrennau Rhufeinig, rhifau (0-9), tanlinellau (_) a chysylltnodau (-) yn yr enwau defnyddiwr.

source: You must accept the terms of service.
cy: Rhaid i chi dderbyn telerau'r gwasanaeth.

source: A level of education is required
cy: Rhaid nodi lefel addysg

source: Your gender is required
cy: Mae'n rhaid i chi nodi eich rhyw

source: Your year of birth is required
cy: Mae'n rhaid i chi nodi blwyddyn eich geni

source: Your mailing address is required
cy: Mae'n rhaid i chi roi cyfeiriad postio

source: A description of your goals is required
cy: Mae angen disgrifiad o'ch nodau

source: A city is required
cy: Mae angen rhoi dinas

source: A country is required
cy: Mae angen rhoi gwlad

source: To enroll, you must follow the honor code.
cy: I gofrestru, rhaid i chi ddilyn y côd anrhydedd.

source: You are missing one or more required fields
cy: Mae un maes gofynnol neu fwy yn wag

source: Username and password fields cannot match
cy: Ni chaiff yr enw defnyddiwr a'r cyfrinair fod yr un fath

source: Unauthorized email address.
cy: Cyfeiriad e-bost heb ei awdurdodi

source: It looks like {email} belongs to an existing account. Try again with a different email address.
cy: Mae'n ymddangos bod yr {email} yn perthyn i gyfrif sydd eisoes yn bodoli. Rhowch gynnig arall arni gyda chyfeiriad e-bost gwahanol.

source: Removed group: "{}"
cy: Dilëwyd y grŵp: "{}"

source: Did not find a group with name "{}" - skipping.
cy: Ni ddaethpwyd o hyd i grŵp gyda'r enw "{}" - neidio.

source: Invalid group name: "{group_name}". {messages}
cy: Enw grŵp annilys: "{group_name}". {messages}

source: Created new group: "{}"
cy: Crëwyd grŵp newydd: "{}"

source: Found existing group: "{}"
cy: Daethpwyd o hyd i grŵp sy'n bodoli eisoes: "{}"

source: Adding {codenames} permissions to group "{group}"
cy: Yn ychwanegu caniatâd {codenames} i'r grŵp "{group}"

source: Removing {codenames} permissions from group "{group}"
cy: Yn dileu caniatâd {codenames} o'r grŵp "{group}"

source: Invalid permission option: "{}". Please specify permissions using the format: app_label:model_name:permission_codename.
cy: Dewiswyd caniatâd annilys: "{}". Nodwch y caniatâd gan ddefnyddio'r fformat: app_label:model_name:permission_codename.

source: Invalid permission codename: "{codename}". No such permission exists for the model {module}.{model_name}.
cy: Enw côd caniatâd annilys: "{codename}". Nid yw'r fath ganiatâd yn bodoli ar gyfer y model {module}.{model_name}.

source: Setting {attribute} for user "{username}" to "{new_value}"
cy: Yn gosod {attribute} ar gyfer defnyddiwr "{username}" i "{new_value}"

source: Skipping user "{}" because the specified and existing email addresses do not match.
cy: Yn neidio defnyddiwr "{}" am nad yw'r cyfeiriad e-bost a nodwyd yn cyd-fynd â'r cyfeiriad e-bost sydd gennym.

source: Did not find a user with username "{}" - skipping.
cy: Ni ddaethpwyd o hyd i ddefnyddiwr gyda'r enw defnyddiwr "{}" - neidio.

source: Removing user: "{}"
cy: Yn dileu'r defnyddiwr: "{}"

source: Created new user: "{}"
cy: Yn creu defnyddiwr newydd: "{}"

source: Found existing user: "{}"
cy: Daethpwyd o hyd i ddefnyddiwr sy'n bodoli: "{}"

source: Setting unusable password for user "{}"
cy: Yn gosod cyfrinair na ellir ei ddefnyddio ar gyfer "{}"

source: Created new profile for user: "{}"
cy: Wedi creu proffil newydd ar gyfer defnyddiwr: "{}"

source: Could not find a group named "{}" - skipping.
cy: Ni ddaethpwyd o hyd i grŵp gyda'r enw "{}" - neidio.

source: Adding user "{username}" to groups {group_names}
cy: Yn ychwanegu defnyddiwr "{username}" i grwpiau {group_names}

source: Removing user "{username}" from groups {group_names}
cy: Yn dileu'r defnyddiwr "{username}" o grwpiau {group_names}

source: Your account has been disabled. If you believe this was done in error, please contact us at {support_email}
cy: Mae eich cyfrif wedi cael ei analluogi. Os credwch mae camgymeriad yw hyn, cysylltwch â ni ar {support_email}

source: Disabled Account
cy: Cyfrif wedi'i analluogi

source: Male
cy: Gwryw

source: Female
cy: Benyw

source: Other/Prefer Not to Say
cy: Arall/ddim am ddweud

source: Doctorate
cy: Doethuriaeth

source: Master's or professional degree
cy: Gradd feistr neu broffesiynol

source: Bachelor's degree
cy: Gradd faglor

source: Associate degree
cy: Gradd gyswllt

source: Secondary/high school
cy: Ysgol gyfun/uwchradd

source: Junior secondary/junior high/middle school
cy: Ysgol uwchradd iau/ganol

source: Elementary/primary school
cy: Ysgol gynradd/elfennol

source: No formal education
cy: Dim addysg ffurfiol

source: Other education
cy: Addysg arall

source: {platform_name} Honor Code Certificate for {course_name}
cy: Tystysgrif Côd Anrhydedd {platform_name} ar gyfer {course_name}

source: {platform_name} Verified Certificate for {course_name}
cy: Tystysgrif wedi'i gwirio {platform_name} ar gyfer {course_name}

source: {platform_name} Professional Certificate for {course_name}
cy: Tystysgrif proffesiynol {platform_name} ar gyfer {course_name}

source: The company identifier for the LinkedIn Add-to-Profile button e.g 0_0dPSPyS070e0HsE9HNz_13_d11_
cy: Y dynodydd cwmni ar gyfer botwm ychwanegu at broffil LinkedIn e.e 0_0dPSPyS070e0HsE9HNz_13_d11_

source: Short identifier for the LinkedIn partner used in the tracking code. (Example: 'edx') If no value is provided, tracking codes will not be sent to LinkedIn.
cy: Dynodydd byr ar gyfer y partner LinkedIn a ddefnyddiwyd yn y côd olrhain. (enghraifft: 'edx') Os na ddarperir gwerth, ni chaiff codau olrhain eu hanfon at LinkedIn.

source: {platform_name} Certificate for {course_name}
cy: Tystysgrif {platform_name} ar gyfer {course_name}

source: The ISO 639-1 language code for this language.
cy: Y côd iaith ISO 639-1 ar gyfer yr iaith hon.

source: Namespace of enrollment attribute
cy: Blwch enw'r priodoledd cofrestru

source: Name of the enrollment attribute
cy: Enw'r priodoledd cofrestru

source: Value of the enrollment attribute
cy: Gwerth y priodoledd cofrestru

source: The window of time after enrolling during which users can be granted a refund, represented in microseconds. The default is 14 days.
cy: Y cyfnod amser ar ôl cofrestru lle gall defnyddwyr dderbyn ad-daliad, wedi'u cynrychioli mewn microeiliadau. Y cyfnod diofyn yw 14 diwrnod.

source: Name of the UTM cookie
cy: Enw'r cwci UTM

source: Name of the affiliate cookie
cy: Enw'r cwci cysylltiedig

source: Name of this user attribute.
cy: Enw'r priodoledd defnyddiwr hwn.

source: Value of this user attribute.
cy: Gwerth y priodoledd defnyddiwr hwn.

source: The course you are looking for does not start until {date}.
cy: Nid yw'r cwrs rydych yn chwilio amdano yn dechrau tan {date}.

source: The course you are looking for is closed for enrollment as of {date}.
cy: Mae'r cofrestru ar gyfer y cwrs rydych yn chwilio amdano wedi cau ers {date}.

source: Course id not specified
cy: Ni nodwyd rhif adnabod y cwrs

source: Invalid course id
cy: Rhif adnabod y cwrs yn annilys

source: Course id is invalid
cy: Mae rhif adnabod y cwrs annilys

source: Could not enroll
cy: Methwyd cofrestru

source: You are not enrolled in this course
cy: Nid ydych wedi'ch cofrestru ar y cwrs hwn

source: Your certificate prevents you from unenrolling from this course
cy: Mae eich tystysgrif yn eich atal rhag dadgofrestru o'r cwrs hwn

source: Enrollment action is invalid
cy: Mae'r cofrestriad yn annilys

source: You've successfully logged into your {provider_name} account, but this account isn't linked with an {platform_name} account yet.
cy: Rydych wedi mewngofnodi'n llwyddiannus i'ch cyfrif {provider_name}, ond nid yw'r cyfrif hwn yn gysylltiedig â chyfrif {platform_name} eto.

source: Use your {platform_name} username and password to log into {platform_name} below, and then link your {platform_name} account with {provider_name} from your dashboard.
cy: Defnyddiwch eich enw defnyddiwr a chyfrinair {platform_name} i fewngofnodi i {platform_name} isod, ac yna gysylltu eich cyfrif {platform_name} gyda {provider_name} o'ch dangosfwrdd.

source: If you don't have an {platform_name} account yet, click <strong>Register</strong> at the top of the page.
cy: Os nad oes gennych gyfrif {platform_name} eto, cliciwch ar <strong>Cofrestru</strong> ar frig y dudalen.

source: There was an error receiving your login information. Please email us.
cy: Cafwyd gwall wrth dderbyn eich gwybodaeth mewngofnodi. E-bostiwch ni.

source: This account has been temporarily locked due to excessive login failures. Try again later.
cy: Mae'r cyfrif hwn wedi cael ei gloi dros dro oherwydd methwyd mewngofnodi gormod o weithiau. Rhowch gynnig arall nes ymlaen.

source: Your password has expired due to password policy on this account. You must reset your password before you can log in again. Please click the "Forgot Password" link on this page to reset your password before logging in again.
cy: Mae eich cyfrinair wedi darfod oherwydd y polisi cyfrinair ar y cyfrif hwn. Rhaid i chi ailosod eich cyfrinair cyn gallu mewngofnodi eto. Cliciwch ar y ddolen "Anghofio cyfrinair" ar y dudalen hon i ailosod eich cyfrinair cyn mewngofnodi eto.

source: Too many failed login attempts. Try again later.
cy: Wedi methu mewngofnodi gormod o weithio. Rhowch gynnig arall nes ymlaen.

source: Email or password is incorrect.
cy: Mae eich e-bost neu gyfrinair yn anghywir.

source: Please enter a username
cy: Rhowch enw defnyddiwr dilys.

source: Please choose an option
cy: Dewiswch opsiwn.

source: User with username {} does not exist
cy: Nid yw defnyddiwr â'r enw defnyddiwr {} yn bodoli

source: Successfully disabled {}'s account
cy: Wedi analluogi cyfrif {} yn llwyddiannus

source: Successfully reenabled {}'s account
cy: Wedi ailalluogi cyfrif {} yn llwyddiannus

source: Unexpected account status
cy: Statws cyfrif annisgwyl

source: An account with the Public Username '{username}' already exists.
cy: Mae cyfrif gyda'r enw defnyddiwr cyhoeddus '{username}' eisoes yn bodoli.

source: An account with the Email '{email}' already exists.
cy: Mae cyfrif gyda'r e-bost '{email}' eisoes yn bodoli.

source: An access_token is required when passing value ({}) for provider.
cy: Mae angen access_token wrth basio gwerth ({}) ar gyfer darparwr.

source: The provided access_token is already associated with another user.
cy: Mae'r access_token a ddarparwyd eisoes yn gysylltiedig â defnyddiwr arall.

source: The provided access_token is not valid.
cy: Nid yw'r access_token a ddarparwyd yn ddilys.

source: Unknown error. Please e-mail us to let us know how it happened.
cy: Gwall anhysbys. E-bostiwch ni i roi gwybod sut digwyddodd hynny.

source: Password reset unsuccessful
cy: Ni lwyddwyd i ailosod y cyfrinair

source: Error in resetting your password. Please try again.
cy: Gwall wrth ailosod eich cyfrinair. Rhowch gynnig arall arni.

source: No inactive user with this e-mail exists
cy: Nid oes defnyddiwr anactif gyda'r e-bost hwn yn bodoli

source: Unable to send reactivation email
cy: Yn methu anfon e-bost ailysgogi

source: Valid e-mail address required.
cy: Mae cyfeiriad e-bost dilys yn ofynnol.

source: Old email is the same as the new email.
cy: Mae'r hen e-bost fel yr e-bost newydd.

source: An account with this e-mail already exists.
cy: Mae cyfrif gyda'r e-bost hwn eisoes yn bodoli.

source: Unable to send email activation link. Please try again later.
cy: Yn methu anfon dolen ysgogi e-bost. Rhowch gynnig arall arni nes ymlaen.

source: Authentication with {} is currently unavailable.
cy: Nid yw awdurdodi gyda {} ar gael ar hyn o bryd.

source: Secondary providers are displayed less prominently, in a separate list of "Institution" login providers.
cy: Mae darparwyr eilaidd yn cael eu harddangos yn llai amlwg, ar restr ar wahân o ddarparwyr mewngofnodi "Sefydliadol".

source: The Site that this provider configuration belongs to.
cy: Y safle mae'r ffurfweddiad darparwr hwn yn perthyn iddo.

source: If this option is enabled, users will not be asked to confirm their details (name, email, etc.) during the registration process. Only select this option for trusted providers that are known to provide accurate user information.
cy: Os yw'r dewis hwn wedi'i alluogi, ni fydd gofyn i ddysgwyr gadarnhau eu manyllion (enw, e-bost, etc.) yn ystod y broses gofrestru. Dewiswch yr opsiwn hwn ar gyfer darparwyr cymeradwy y gwyddys eu bod yn darparu gwybodaeth gywir i ddefnyddwyr.

source: If this option is selected, users will not be required to confirm their email, and their account will be activated immediately upon registration.
cy: Os dewisir yr opsiwn hwn, ni fydd gofyn i'r defnyddwyr gadarnhau eu e-bost, a bydd eu cyfrif yn cael ei ysgogi'n syth wedi cofrestru.

source: If this option is not selected, users will not be presented with the provider as an option to authenticate with on the login screen, but manual authentication using the correct link is still possible.
cy: Os na chaiff yr opsiwn hwn ei ddewis, ni chaiff darparwr ei gyflwyno i'r defnyddwyr fel opsiwn i ddilysu ar y sgrîn mewngofnodi, ond bydd dilysu eich hun gan ddefnyddio'r ddolen gywir yn bosib o hyd.

source: The Site that this SAML configuration belongs to.
cy: Y safle mae'r ffurfweddiad SAML hwn yn perthyn iddo.

source: Please wait
cy: Arhoswch

source: Maximum upload file size is {file_size} bytes.
cy: Mwyafswm maint ffeil i'w llwytho i fyny yw {file_size} beit.

source: Course {course_id} requires {prerequisite_course_id}
cy: Mae cwrs {course_id} yn galw am {prerequisite_course_id}

source: System defined milestone
cy: Carreg filltir a ddiffiniwyd gan y system

source: Invalid Length ({0})
cy: Hyd annilys ({0})

source: must be {0} characters or more
cy: rhaid iddo fod yn {0} cymeriad neu fwy

source: must be {0} characters or fewer
cy: rhaid iddo fod yn {0} cymeriad neu lai

source: Must be more complex ({0})
cy: Rhaid iddo fod yn fwy cymhleth ({0})

source: must contain {0} or more uppercase characters
cy: rhaid iddo gynnwys {0} neu fwy o lythrennau bras

source: must contain {0} or more lowercase characters
cy: rhaid iddo gynnwys {0} neu fwy o lythrennau bach

source: must contain {0} or more digits
cy: rhaid iddo gynnwys {0} digid neu fwy

source: must contain {0} or more punctuation characters
cy: rhaid iddo gynnwys {0} neu fwy o nodau atalnodi

source: must contain {0} or more non ascii characters
cy: rhaid iddo gynnwys {0} neu fwy o nodau nad ydynt yn ascii

source: must contain {0} or more unique words
cy: rhaid iddo gynnwys {0} neu fwy o eiriau unigryw

source: Too similar to a restricted dictionary word.
cy: Yn rhy debyg i air geiriadur a gyfyngir.

source: To disable the XBlock and prevent rendering in the LMS, leave "Enabled" deselected; for clarity, update XBlockStudioConfiguration support state accordingly.
cy: I analluogi XBlock ac atal rendro yn LMS, peidiwch â dewis "Galluogi"; er eglurder, diweddarwch cyflwr cefnogi XBlockStudioConfiguration yn ôl y galw.

source: Only XBlocks listed in a course's Advanced Module List can be flagged as deprecated. Remember to update XBlockStudioConfiguration support state accordingly, as deprecated does not impact whether or not new XBlock instances can be created in Studio.
cy: Dim ond XBlocks a restrir yn rhestr modiwlau uwch y cwrs y gellir eu nodi'n anghymeradwy. Cofiwch ddiweddaru cyflwr cefnogi XBlockStudioConfiguration yn ôl y galw, gan nad yw statws anghymeradwy yn effeithio ar y gallu i greu achosion XBlock newydd yn Studio ai peidio.

source: XBlock/template combinations that are disabled cannot be edited in Studio, regardless of support level. Remember to also check if all instances of the XBlock are disabled in XBlockConfiguration.
cy: Ni ellir golygu cyfuniadau XBlock/patrymlun sydd wedi'u hanalluogi yn Studio, ni waeth beth yw lefel y gefnogaeth. Cofiwch hefyd wirio a yw'r holl achosion XBlock wedi'u hanalluogi yn XBlockConfiguration.

source: Enabled XBlock/template combinations with full or provisional support can always be created in Studio. Unsupported XBlock/template combinations require course author opt-in.
cy: Gellir creu cyfuniadau XBlock/patrymlun wedi'u galluogi gyda chefnogaeth lawn neu dros dro bob tro yn Studio. Mae cyfuniadau XBlock/patrymlun heb eu cefnogi yn galw i awdur y cwrs optio i mewn.

source: show deprecation messaging in Studio
cy: dangos negeseuon anghymeradwy yn Studio

source: Fully Supported
cy: Gyda chefnogaeth lawn

source: Provisionally Supported
cy: Cefnogir dros dro

source: Unsupported
cy: Heb ei gefnogi

source: Cannot rescore problems with possible file submissions
cy: Ni ellir ail-sgorio problemau gyda chyflwyno ffeiliau posib

source: Incorrect
cy: Anghywir

source: Correct
cy: Cywir

source: correct
cy: cywir

source: incorrect
cy: anghywir

source: partially correct
cy: yn rhannol gywir

source: incomplete
cy: anghyflawn

source: unanswered
cy: heb eu hateb

source: processing
cy: prosesu

source: This answer is correct.
cy: Mae'r ateb hwn yn gywir.

source: This answer is incorrect.
cy: Mae'r ateb hwn yn anghywir.

source: This answer is partially correct.
cy: Mae'r ateb hwn yn rhannol gywir.

source: This answer is being processed.
cy: Mae'r ateb hwn yn cael ei brosesu.

source: Not yet answered.
cy: Heb ei ateb eto.

source: Select an option
cy: Dewiswch opsiwn

source: ChoiceGroup: unexpected tag {tag_name}
cy: ChoiceGroup: tag annisgwyl {tag_name}

source: Answer received.
cy: Derbyniwyd yr ateb.

source: Expected a <choice> or <compoundhint> tag; got {given_tag} instead
cy: Disgwyliwyd tag <choice> neu <compoundhint>; wedi cael {given_tag} yn lle

source: Your files have been submitted. As soon as your submission is graded, this message will be replaced with the grader's feedback.
cy: Cyflwynwyd eich ffeiliau. Wedi i'ch cyflwyniad gael ei raddio, bydd y neges hon yn cael ei hamnewid gydag adborth y graddiwr.

source: Your answer has been submitted. As soon as your submission is graded, this message will be replaced with the grader's feedback.
cy: Cyflwynwyd eich ateb. Wedi i'ch cyflwyniad gael ei raddio, bydd y neges hon yn cael ei hamnewid gydag adborth y graddiwr.

source: {programming_language} editor
cy: golygydd {programming_language}

source: Press ESC then TAB or click outside of the code editor to exit
cy: Gwasgwch ESC yna TAB neu glicio y tu allan i olygydd y côd i adael

source: Submitted. As soon as a response is returned, this message will be replaced by that feedback.
cy: Cyflwynwyd. Wedi i ymateb ddychwelyd, bydd y neges hon yn cael ei hamnewid gan yr adborth hwnnw.

source: No response from Xqueue within {xqueue_timeout} seconds. Aborted.
cy: Dim ymateb gan Xqueue o fewn {xqueue_timeout} eiliad. Rhoddwyd y gorau iddi.

source: Error running code.
cy: Côd gwall yn rhedeg.

source: Cannot connect to the queue
cy: Ni ellir cysylltu i'r ciw

source: No formula specified.
cy: Ni nodwyd fformiwla.

source: Couldn't parse formula: {error_msg}
cy: Methwyd dosrannu'r fformiwla: {error_msg}

source: Error while rendering preview
cy: Gwall wrth rendro rhagolwg

source: Sorry, couldn't parse formula
cy: Blin gennym, methwyd dosrannu'r fformiwla

source: {input_type}: unexpected tag {tag_name}
cy: {input_type}: tag annisgwyl {tag_name}

source: Expected a {expected_tag} tag; got {given_tag} instead
cy: Disgwyliwyd tag {expected_tag}; wedi cael {given_tag} yn lle
