Repository: zhulinhai/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/underscore.po
Languages: cy

source: Sign in here using your email address and password, or use one of the providers listed below.
cy: Mewngofnodwch yma gan ddefnyddio'ch cyfeiriad e-bost a chyfrinair, neu ddefnyddiwch un o'r darparwyr a restir isod.

source: Sign in here using your email address and password.
cy: Mewngofnodwch yma gan ddefnyddio'ch cyfeiriad e-bost a'ch cyfrinair.

source: If you do not yet have an account, use the button below to register.
cy: Os nad oes gennych gyfrif, defnyddiwch y botwm isod i gofrestru.

source: or sign in with
cy: neu fewngofnodi gyda

source: Sign in with %(providerName)s
cy: Mewngofnodi gyda %(providerName)s

source: Use my institution/campus credentials
cy: Defnyddio fy nghymwysterau sefydliad/campws

source: New to %(platformName)s?
cy: Yn newydd i %(platformName)s?

source: Create an account
cy: Creu cyfrif

source: Password assistance
cy: Cymorth gyda chyfrinair

source: Please enter your email address below and we will send you instructions for setting a new password.
cy: Rhowch eich cyfeiriad e-bost isod a byddwn yn anfon cyfarwyddiadau atoch ynghylch gosod cyfrinair newydd.

source: Reset my password
cy: Ail-osod fy nghyfrinair

source: Create an account using
cy: Creu cyfrif gan ddefnyddio

source: Create account using %(providerName)s.
cy: Creu cyfrif gan ddefnyddio %(providerName)s.

source: or create a new one here
cy: neu greu un newydd yma

source: Create a new account
cy: Creu cyfrif newydd

source: Create your account
cy: Creu cyfrif

source: Required field
cy: Maes gofynnol

source: Already have an account?
cy: Gennych gyfrif eisoes?

source: Share your "%(display_name)s" award
cy: Rhannu eich dyfarniad "%(display_name)s"

source: Share
cy: Rhannu

source: Earned %(created)s.
cy: Enillwyd %(created)s.

source: What's Your Next Accomplishment?
cy: Beth yw eich cyflawniad nesaf?

source: Start working toward your next learning goal.
cy: Dechrau gweithio tuag at eich nod dysgu nesaf.

source: Find a course
cy: Canfod cwrs

source: An error occurred. Try loading the page again.
cy: Gwall wedi digwydd. Ceisiwch lwytho'r dudalen eto.

source: You are currently sharing a limited profile.
cy: Rydych yn rhannu proffil cyfyngedig ar hyn o bryd.

source: This learner is currently sharing a limited profile.
cy: Mae'r myfyriwr hwn yn rhannu proffil cyfyngedig ar hyn o bryd.

source: Share on Mozilla Backpack
cy: Rhannu ar Mozilla Backpack

source: To share your certificate on Mozilla Backpack, you must first have a Backpack account. Complete the following steps to add your certificate to Backpack.
cy: I rannu eich tystysgrif ar Mozilla Backpack, mae'n rhaid bod gennych gyfrif Backpack. Cwblhewch y camau hyn i ychwanegu eich tystysgrif i Backpack.

source: Create a %(link_start)sMozilla Backpack%(link_end)s account, or log in to your existing account
cy: Creu cyfrif %(link_start)sMozilla Backpack%(link_end)s, neu fewngofnodi i'ch cyfrif presennol

source: %(download_link_start)sDownload this image (right-click or option-click, save as)%(link_end)s and then %(upload_link_start)supload%(link_end)s it to your backpack.</li>
cy: %(download_link_start)s I lawrlwytho'r ddelwedd hon (de-gliciwch neu dewis-gliciwch, cadw fel)%(link_end)s ac yna %(upload_link_start)s llwytho i fyny %(link_end)s i'ch backpack.</li>

source: Congratulations! You are now verified on %(platformName)s!
cy: Llongyfarchiadau! Rydych nawr wedi'ch gwirio ar %(platformName)s!

source: You are now enrolled as a verified student for:
cy: Rydych wedi'ch cofrestru nawr fel myfyriwr a wiriwyd:

source: A list of courses you have just enrolled in as a verified student
cy: Rhestr o gyrsiau rydych newydd gofrestru arnynt fel myfyriwr wedi'i wirio

source: Explore your course!
cy: Archwilio eich cwrs!

source: Go to your Dashboard
cy: Mynd i'ch dangosfwrdd

source: Verified Status
cy: Statws wedi'i wirio

source: Thank you for submitting your photos. We will review them shortly. You can now sign up for any %(platformName)s course that offers verified certificates. Verification is good for one year. After one year, you must submit photos for verification again.
cy: Diolch am gyflwyno eich lluniau. Byddwn yn eu hadolygu cyn hir. Gallwch nawr gofrestru ar gyfer unrhyw gwrs mae %(platformName)s sy'n cynnig tystysgrifau wedi'u gwirio. Mae'r gwiriad yn ddilys am flwyddyn. Wedi blwyddyn, rhaid i chi gyflwyno lluniau i'w gwirio eto.

source: or:
cy: Gwall:

source: What You Need for Verification
cy: Beth sydd ei angen i wirio?

source: Webcam
cy: Gwe-gamera

source: You need a computer that has a webcam. When you receive a browser prompt, make sure that you allow access to the camera.
cy: Mae angen cyfrifiadur â gwe-gamera arnoch. Pan fyddwch yn derbyn ysgogiad porwr, sicrhewch eich bod yn caniatáu mynediad i'r camera.

source: Photo Identification
cy: Llun adnabod

source: You need a driver's license, passport, or other government-issued ID that has your name and photo.
cy: Mae angen trwydded yrru, pasport, neu gerdyn adnabod arall a roddwyd gan lywodraeth gyda'ch enw a'ch llun arno.

source: Take Your Photo
cy: Cymryd eich llun

source: When your face is in position, use the camera button {icon} below to take your photo.
cy: Pan fydd eich wyneb yn ei le, defnyddiwch y botwm camera {icon} isod i gymryd eich llun.

source: To take a successful photo, make sure that:
cy: I gymryd llun llwyddiannus, sicrhewch bod:

source: Your face is well-lit.
cy: Digon o olau ar eich wyneb.

source: Your entire face fits inside the frame.
cy: Eich wyneb cyfan o fewn y ffrâm.

source: The photo of your face matches the photo on your ID.
cy: Y llun o'ch wyneb yn cyd-fynd â'ch llun adnabod.

source: To use the current photo, select the camera button {icon}. To take another photo, select the retake button {icon}.
cy: I ddefnyddio'r llun cyfredol, gwasgwch y botwm camera {icon}. I gymryd llun arall, gwasgwch y botwm ailgymryd {icon}.

source: Frequently Asked Questions
cy: Cwestiynau Cyffredin

source: Why does %(platformName)s need my photo?
cy: Pam mae ar %(platformName)s angen fy llun?

source: As part of the verification process, you take a photo of both your face and a government-issued photo ID. Our authorization service confirms your identity by comparing the photo you take with the photo on your ID.
cy: Fel rhan o'ch proses wirio, mae angen i chi gymryd llun o'ch wyneb a'r llun adnabod a ddyroddwyd gan lywodraeth. Mae'r gwasanaeth awdurdodi yn cadarnhau pwy ydych chi drwy gymharu'r llun a gymerwch gyda'r llun adnabod.

source: What does %(platformName)s do with this photo?
cy: Beth mae %(platformName)s yn ei wneud gyda'r llun?

source: We use the highest levels of security available to encrypt your photo and send it to our authorization service for review. Your photo and information are not saved or visible anywhere on %(platformName)s after the verification process is complete.
cy: Rydym yn defnyddio'r lefelau diogelwch uchaf sydd ar gael i amgryptio eich llun a'i anfon i'n gwasanaeth awdurdodi i'w adolygu. Ni chaiff eich llun na'ch gwybodaeth eu cadw na'u gwneud yn weladwy unrhyw le ar %(platformName)s wedi cwblhau'r broses wirio.

source: Next: %(nextStepTitle)s
cy: Nesaf: %(nextStepTitle)s

source: Take a Photo of Your ID
cy: Tynnwch lun o'ch cerdyn adnabod

source: Use your webcam to take a photo of your ID. We will match this photo with the photo of your face and the name on your account.
cy: Defnyddiwch gwe-gamera i dynnu llun o'ch cerdyn adnabod. Byddwn yn gwirio bod y llun hwn yn cyd-fynd â llun eich wyneb a'r enw ar y cyfrif.

source: You need an ID with your name and photo. A driver's license, passport, or other government-issued IDs are all acceptable.
cy: Mae angen cerdyn adnabod arnoch gyda'ch enw a'ch llun. Mae trwydded yrru, pasport, neu gerdyn adnabod arall a roddwyd gan lywodraeth oll yn dderbyniol.

source: Tips on taking a successful photo
cy: Awgrymiadau ar sut i gymryd llun llwyddiannus

source: Ensure that you can see your photo and read your name
cy: Sicrhewch eich bod yn gallu gweld eich llun a darllen eich enw

source: Make sure your ID is well-lit
cy: Sicrhewch bod eich llun adnabod yn ddigon golau

source: Once in position, use the camera button {icon} to capture your ID
cy: Pan fydd eich wyneb yn ei le, defnyddiwch y botwm camera {icon} isod i gymryd eich llun

source: Use the retake photo button if you are not pleased with your photo
cy: Defnyddiwch y botwm ailgymryd llun os nad ydych yn hapus â'ch llun

source: Preview of uploaded image
cy: Rhagweld delwedd a lwythwyd i fyny

source: Upload an image or capture one with your web or phone camera.
cy: Llwytho delwedd i fyny neu gipio un gyda'ch gwe-gamera neu gamera ffôn.

source: Use your webcam to take a photo of your face. We will match this photo with the photo on your ID.
cy: Defnyddiwch eich gwe-gamera i dynnu llun o'ch wyneb. Byddwn yn sicrhau bod y llun hwn yn cyd-fynd â'r llun adnabod.

source: Make sure your face is well-lit
cy: Sicrhewch bod digon o olau ar eich wyneb

source: Be sure your entire face is inside the frame
cy: Gwnewch yn siŵr bod eich wyneb cyfan o fewn y ffrâm

source: Once in position, use the camera button {icon} to capture your photo
cy: Pan fydd eich wyneb yn ei le, defnyddiwch y botwm camera {icon} i gymryd eich llun

source: Can we match the photo you took with the one on your ID?
cy: Gawn ni gyfateb y llun a gymeroch gyda'r un ar eich cerdyn adnabod?

source: Thanks for returning to verify your ID in: {courseName}
cy: Diolch am ddychwelyd i wirio pwy ydych chi yn: {courseName}

source: You need to activate your account before you can enroll in courses. Check your inbox for an activation email. After you complete activation you can return and refresh this page.
cy: Mae'n rhaid i chi gynnau eich cyfrif cyn cofrestru ar gyrsiau. Edrychwch yn eich mewnflwch am e-bost ysgogi. Wedi i chi gwblhau'r ysgogi, gallwch ddychwelyd ac ail-wneud y dudalen hon.

source: Activate Your Account
cy: Ysgogi eich cyfrif

source: Check Your Email
cy: Edrychwch yr eich e-bost

source: Photo ID
cy: Llun adnabod

source: A driver's license, passport, or other government-issued ID with your name and photo
cy: Trwydded yrru, pasport, neu gerdyn adnabod a roddwyd gan lywodraeth gyda'ch enw a'ch llun arno.

source: You are enrolling in: {courseName}
cy: Rydych yn cofrestru ar: {courseName}

source: You are upgrading your enrollment for: {courseName}
cy: Rydych yn uwchraddio eich cofrestriad ar gyfer: {courseName}

source: You can now enter your payment information and complete your enrollment.
cy: Gallwch nawr roi eich gwybodaeth dalu a chwblhau eich cofrestriad.

source: You can pay now even if you don't have the following items available, but you will need to have these by {date} to qualify to earn a Verified Certificate.
cy: Gallwch dalu nawr hyd yn oed os nad oes gennych yr eitemau hyn, ond bydd angen i chi gael hyn erbyn {date} i gymhwyso i ennill tystysgrif wedi'i gwirio.

source: An email has been sent to {userEmail} with a link for you to activate your account.
cy: Anfonwyd e-bost at {userEmail} gyda dolen i chi ysgogi eich cyfrif.

source: Why activate?
cy: Pam ysgogi?

source: We ask you to activate your account to ensure it is really you creating the account and to prevent fraud.
cy: Gofynnwn i chi ysgogi eich cyfrif er mwyn sicrhau mai chi sy'n creu'r cyfrif ac i atal twyll.

source: You can pay now even if you don't have the following items available, but you will need to have these to qualify to earn a Verified Certificate.
cy: Gallwch dalu nawr hyd yn oed os nad oes gennych yr eitemau hyn, ond bydd angen i chi gael hyn i gymhwyso i ennill tystysgrif wedi'i gwirio.

source: Government-Issued Photo ID
cy: Llun adnabod a ddyroddwyd gan lywodraeth

source: ID-Verification is not required for this Professional Education course.
cy: Nid oes angen gwirio pwy ydych chi ar gyfer y cwrs addysg broffesiynol hwn.

source: All professional education courses are fee-based, and require payment to complete the enrollment process.
cy: Mae pob cwrs addysg broffesiynol yn seiliedig ar ffi, a gofynnir am daliad i gwblhau'r broses gofrestru.

source: You have already verified your ID!
cy: Rydych eisoes wedi gwirio pwy ydych chi!

source: Your verification status is good until {verificationGoodUntil}.
cy: Mae eich statws gwirio yn ddilys tan {verificationGoodUntil}.

source: price
cy: pris

source: Account Not Activated
cy: Cyfrif heb ei ysgogi

source: Upgrade to a Verified Certificate for {courseName}
cy: Tystysgrif wedi'i gwirio ar gyfer {courseName}

source: Before you upgrade to a certificate track, you must activate your account.
cy: Cyn i chi uwchraddio i lwybr tystysgrif, rhaid i chi ysgogi eich cyfrif.

source: Check your email for an activation message.
cy: Ewch i'ch e-bost i edrych am neges ysgogi.

source: Professional Certificate for {courseName}
cy: Tystysgrif proffesiynol ar gyfer {courseName}

source: Verified Certificate for {courseName}
cy: Tystysgrif wedi'i gwirio ar gyfer {courseName}

source: To receive a certificate, you must also verify your identity before {date}.
cy: I dderbyn tystysgrif, rhaid i chi hefyd wirio pwy ydych chi erbyn {date}.

source: To receive a certificate, you must also verify your identity.
cy: I dderbyn tystysgrif, rhaid i chi hefyd wirio pwy ydych chi.

source: To verify your identity, you need a webcam and a government-issued photo ID.
cy: I wirio eich hunaniaeth, mae angen gwe-gamera a llun adnabod a roddwyd gan y llywodraeth arnoch.

source: Your ID must be a government-issued photo ID that clearly shows your face.
cy: Rhaid i'ch cerdyn adnabod fod yn llun adnabod a ddyroddwyd gan lywodraeth sy'n dangos eich wyneb yn glir.

source: You will use your webcam to take a picture of your face and of your government-issued photo ID.
cy: Byddwch yn defnyddio eich gwe-gamera i gymryd llun o'ch gwyneb a'ch cerdyn adnabod llun a ddyroddwyd gan lywodraeth.

source: Thank you! We have received your payment for {courseName}.
cy: Diolch! Rydym wedi derbyn eich taliad ar gyfer {courseName}.

source: Next Step: Confirm your identity
cy: Cam nesaf: Cadarnhau pwy ydych chi

source: Check your email
cy: Edrychwch yr eich e-bost

source: You need to activate your account before you can enroll in courses. Check your inbox for an activation email.
cy: Mae'n rhaid i chi gynnau eich cyfrif cyn cofrestru ar gyrsiau. Edrychwch yn eich mewnflwch am e-bost ysgogi.

source: A driver's license, passport, or government-issued ID with your name and photo.
cy: Trwydded yrru, pasport, neu gerdyn adnabod a roddwyd gan lywodraeth gyda'ch enw a'ch llun arno.

source: If you don't verify your identity now, you can still explore your course from your dashboard. You will receive periodic reminders from %(platformName)s to verify your identity.
cy: Os na wiriwch chi pwy ydych chi nawr, gallwch barhau i archwilio'ch cwrs o'ch dangosfwrdd. Byddwch yn derbyn nodiadau atgoffa o bryd i'w gilydd gan %(platformName)s i wirio pwy ydych chi.

source: Identity Verification In Progress
cy: Gwirio pwy ydych chi ar waith

source: We have received your information and are verifying your identity. You will see a message on your dashboard when the verification process is complete (usually within 1-2 days). In the meantime, you can still access all available course content.
cy: Rydym wedi derbyn eich gwybodaeth ac yn gwirio pwy ydych chi. Byddwch yn gweld neges ar eich dangosfwrdd wedi cwblhau'r broses wirio (fel arfer o fewn 1-2 diwrnod). Yn y cyfamser, gallwch weld holl gynnwys y cwrs o hyd.

source: Return to Your Dashboard
cy: Dychwelyd i'ch dangosfwrdd

source: Review Your Photos
cy: Adolygu eich lluniau

source: Make sure we can verify your identity with the photos and information you have provided.
cy: Sicrhewch ein bod yn gallu gwirio pwy ydych chi gyda'r lluniau a'r wybodaeth rydych wedi'u darparu.

source: Photo of %(fullName)s
cy: Llun o %(fullName)s

source: Photo of %(fullName)s's ID
cy: Llun o gerdyn adnabod %(fullName)s

source: Photo requirements:
cy: Gofynion y llun:

source: Does the photo of you show your whole face?
cy: A yw'r llun yn dangos eich wyneb cyfan?

source: Does the photo of you match your ID photo?
cy: A yw'r llun yn cyd-fynd â'ch llun adnabod?

source: Is your name on your ID readable?
cy: A yw eich enw ar y cerdyn adnabod yn ddarllenadwy?

source: Does the name on your ID match your account name: %(fullName)s?
cy: A yw'r enw ar y manylion adnabod yn cyd-fynd ag enw'ch cyfrif: %(fullName)s?

source: Edit Your Name
cy: Golygu eich enw

source: Make sure that the full name on your account matches the name on your ID.
cy: Sicrhewch bod yr enw llawn ar eich cyfrif yn cyd-fynd â'r enw ar eich cerdyn adnabod.

source: Photos don't meet the requirements?
cy: Lluniau heb fodloni'r gofynion?

source: Retake Your Photos
cy: Ailgymryd eich lluniau

source: Before proceeding, please confirm that your details match
cy: Cyn bwrw ymlaen, cadarnhewch bod eich manylion yn cyfateb

source: Confirm
cy: Cadarnhau

source: Don't see your picture? Make sure to allow your browser to use your camera when it asks for permission.
cy: Methu gweld eich llun? Sicrhewch eich bod yn caniatáu i'ch porwr ddefnyddio'ch camera pan fydd yn gofyn caniatâd.

source: Live view of webcam
cy: Gweld gwe-gamera yn fyw

source: Retake Photo
cy: Ailgymryd llun

source: Take Photo
cy: Cymryd llun

source: Bookmarked on
cy: Wedi rhoi nod tudalen ar

source: You have not bookmarked any courseware pages yet
cy: Nid ydych wedi rhoi nod tudalen ar unrhyw dudalennau o'r cwrs eto.

source: Value
cy: Gwerth

source: Email
cy: E-bost

source: Sign In
cy: Mewngofnodi

source: First time here?
cy: Y tro cyntaf yma?

source: Create an Account.
cy: Creu cyfrif.

source: SIGN IN
cy: Mewngofnodi
